[{"title": "Deep Pockets", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["plain pat", "40", "drake"], "artist": "drake", "lyrics": "For my nigga Hush\nYeah, look\nDressed in fatigues, I rep the East with my trustees\nSmokin' on crushed leaves\nThey turn they back on everything we built, then they must bleed\nI've seen splatter hit the snow when the blood freeze\nStraps over territory they know we must keep\nGet home and white Air Forces get brushed clean\nBack when my mama would interrupt sleep\nTo tell me hurry up 'cause the bus leaves\nSummertime heatwaves, I used to just cut sleeves\nMy shorty really love me, man, she want me to cut keys\nI can't do that normal type of life, is it just me?\nNiggas steady try to ride the wave, but it's rough seas\nI'm losin' enough sleep dealin' with envy\nAnd the news that they sent for me got the block in a frenzy\nIt's on Meech like it's trendy\nRunnin' round from Laurier to MacKenzie when the city's empty, yeah\nEarly twenties, but I want fifties, hundreds, not pennies\nI need plenty\nGot me ready to flip the F out like Fendi\nWhatever's in me, it's takin' over\nI gotta bust it down, break it open\nUntil somebody starts takin' notice, then we rollin'\nYeah, then we rollin', then we rollin'\nDeep pockets on a nigga, I can't find my phone in\nNow we rollin'\nYeah, then we rollin', then we rollin'\nDeep pockets on a nigga, I can't find my phone in\nNow we rollin'\nLook\nBack when Big Apple sold dreams, I stuck to my own thing\nBack when the house that I own now was my home screen\nBefore I'd ever hit the road and feel like the home team\nRunnin' missions\nPyramid schemes just like the Egyptians\nBack when hotlines were still flippin'\nNow I'm seein' money off of hotlines blingin' but it feels different\nTransitions, plans switchin', ambition\nMindin' my business, buildin' a business, et cetera\nInspired by a few, but my mind really drives itself like Tesla\nI always had a little somethin' extra\nBack when Corey was our sole investor\nAnd the car could get from A to B, but won't impress ya\nLook, I ain't no baller\nStill need my accounts longer like the way my nephew's gettin' taller\nMy soundtrack is the second Carter, dreamin' of acceptin' offers\nAnd easin' tensions\nKeepin' family out of East Detention\nAnd out of Pine Hill Funeral Center\nSpots we got no business enterin'\nBack when Jill Scott was the apple of my afrocentric eye\nI had to find a way to get someone's attention\nThen we rollin', then we rollin'\nDeep pockets on a nigga, I can't find my phone in\nNow we rollin'\nYeah, then we rollin', then we rollin'\nDeep pockets on a nigga, I can't find my phone in\nNow we rollin'\n\n"}, {"title": "When To Say When", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["alonzo “roxx” thornhill", "bobby glenn", "drake", "june the genius"], "artist": "drake", "lyrics": "Yeah\nSomebody, um\nSomebody hit me today and they were like\n\"Nah, just make sure, you know\nYou tell me what to do when I get there, you know?\"\n(June, you're a genius)\nI said, \"I respect it, no problem\"\nI got all these blessings just to give it to others anyway\nKnow what I'm sayin'?\nYeah, my hand's always open, for real\nAyy\nThirty-three years, I gave that to the game\nThirty-three mil', I'll save that for the rain\nFive hundred weeks, I'll fill the charts with my pain\nFive hundred mil' and I'll fall back in the 6ix\nFinally give you niggas the space you need to exist\nMichael Jackson shit, but the palace is not for kids\nStill women sayin' it's childish, the way we live\nBrought a few Ws to the 6ix\nBaby mama fluke, but I love her for who she is\nBaby, Wayne and Tez responsible for this shit\nHalf the time, I question my consciousness in this shit\nOther times, I question if compliments are legit\nFull-time, I'm out here confident as a bitch\nTryna make good on the promises that I give\nTryna make sure my accomplices are legit\nRegister the business in my brother's name\nThirty-five hunnid in her pocket, that should cover things\nCertified lover man, trappin' out the motherland\nAlways move right so my watch is on the other hand\nShe can try and play it down now, but she was a fan\nPeople wanna know what's in my pockets, they don't understand\nMy assistant always findin' Percocet and rubber bands\nKnow my mom might not want to hear how I discover plans\nWord to Sandra Graham, no one love you like your mother can\nI watched Michael Rubin win a million off a couple hands\nI decide what to see next like it's on demand\nI decide what to be next like I'm switchin' plans\nI'ma tell you what you feel next like the weatherman\nI will split heads and break necks for my little man\n6 God, prayin' hands like I'm a religious man\nBut I'm just a sicker man, wicked man\nLook, we can argue back and forth, but who's the richer man?\nIsn't that what matters in this world that we livin' in?\nBang those dividends, snakes stay slitherin'\nHow you plan to make it to the top by just fittin' in?\nHow you plan to take a nigga's spot by just givin' in?\nHow you gon' treat this shit like you gon' get to live again?\nHow you gettin' hype off one hit? Do that shit again\nHow you got a manager you mad at after you got the win?\nBet you got some niggas that'll love you 'til the bitter end\nBet you got somebody that's just smarter than your other friends\nGive 'em a percentage, see what happens to your blessings then\nYou just need to stay close to your people that was there when others could've been\nThere when others should've been\nGot a nigga starin' at the game like, \"Damn, coach, put him in\"\nBut you never listen, so you niggas goin' wood again\nGot us in the crib, talkin' 'bout what niggas coulda been, shoulda been\nAnd I got your girl on the second floor, beggin' me to put it in\nAnd it's not because all of the money that you wouldn't spend\nAnd it's not because I set it up to try and get revenge\nIt's because you niggas insecure, you ain't made men\nIt's because even though you hate on me, we stay friends\nIt's because you niggas never learn when to say when\nYeah\nFor real\nFacts, you know what I'm sayin'?\nHahaha, yeah\n\n"}, {"title": "Chicago Freestyle", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["steve king", "jeff bass", "eminem", "drake"], "artist": "drake", "lyrics": "Ayy, truck to the plane to the truck\nTruck to the hotel lobby\nMe, I go through underground garages\nPresidential suite on deposit\nElevator up to the room\nShower up and then we hit the club\nTouch down, gotta see what's up\nArea code in my phone\nWhat numbers do I still have?\nWho do I know from the past?\nHit one, she say she got a man\nHit another one, it goes green\nMust've changed phones on the team\n'Member when you let me in between\nThat was 2017\nAll good, Chubbs will look around\nFind one that seem my type\nThat my dawg and he know what I like\nHe done found me plenty in my life\nProblem is, I meet a girl tonight\nThen I go and treat her too nice\nGalleria credit card swipes\nI don't even know if she a wife\nBut I do know one thing though\nWomen, they come they go\nSaturday through Sunday, Monday\nMonday through Sunday, yo\nMaybe I'll love you one day\nMaybe we'll someday grow\n'Til then, I'll sit my drunk ass on that runway\nOn this one way\nJewelry in the safe on arrival\nPistol on J for survival\nLot of people gunnin' for the title\nLot of people tryna take us viral\nI'm just tryin' to have a nice night though\nWaiter brought the check for the meal\nShe said, \"Babe, I think there was a typo\"\nNah, girl, I got it, that's light though\nI could show you bigger things than that\nIt's gon' be a minute 'til I'm back\nLet me give you images that last\nAMEX had a limit in the past\nI had plenty women in the past\nI done plenty sinnin' in the past\nYou don't need to know, but you can ask\nStickin' on your backstage pass\nAll access 'cause you bad\nYou could go wherever with that ass\nShow to the shower to the truck\nTruck to the club for the party\nYou go in first with your girls\n'Cause I don't know who's out there watchin'\nBut I do know one thing though\nWomen, they come they go\nSaturday through Sunday, Monday\nMonday, Sunday, yo\nMaybe I'll love you one day\nMaybe we'll someday grow\n'Til then, I'll sit my drunk ass on that runway\nOn this one way\n"}, {"title": "Not You Too", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["drake", "noel cadastre"], "artist": "drake", "lyrics": "First time in a long time\nHurtin' deeply inside\nFirst time in a long time\nHurtin' deeply\nThought I knew the real, then they flipped\nHow many times did I ask about this, on God?\nWhy you let me find out like this, on God?\nHouston, we got a problem, my dawg\nAll my niggas love you, got us all involved\nAin't no goin' back to how we started off\nNo, no, no, no\n\n"}, {"title": "Toosie Slide", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["oz", "drake"], "artist": "drake", "lyrics": "Black leather glove, no sequins\nBuckles on the jacket, it's Alyx shit\nNike crossbody, got a piece in it\nGot a dance, but it's really on some street shit\nI'ma show you how to get it\nIt go right foot up, left foot, slide\nLeft foot up, right foot, slide\nBasically, I'm sayin' either way, we 'bout to slide, ayy\nCan't let this one slide, ayy\nDon't you wanna dance with me? No?\nI could dance like Michael Jackson\nI could give you thug passion\nIt's a Thriller in the trap where we from\nBaby, don't you wanna dance with me? No?\nI could dance like Michael Jackson\nI could give you satisfaction\nAnd you know we out here every day with it\nI'ma show you how to get it\nIt go right foot up, left foot, slide\nLeft foot up, right foot, slide\nBasically, I'm sayin', either way, we 'bout to slide, ayy\nCan't let this one slide, ayy (Who's bad?)\nTwo thousand shorties wanna tie the knot, ayy, yeah\nTwo hundred shooters on my brother's block, woah, yeah\nPetal off a rose like I love her not, maybe not\nI don't know what's wrong with me, I can't stop, woah, yeah\nWon't stop, woah, yeah, never stop\nGot so many opps, I be mistakin' opps for other opps\nGot so many people that I love out of troubled spots\nOther than the family I got, it's either you or me\nThat's just how I think, it's either you or me\nThis life got too deep for you, baby\nTwo or three of us about to creep where they stayin'\nBlack leather glove, no sequins\nBuckles on the jacket, it's Alyx shit\nNike crossbody, got a piece in it\nGot a dance, but it's really on some street shit\nI'ma show you how to get it\nIt go right foot up, left foot, slide\nLeft foot up, right foot, slide\nBasically, I'm sayin' either way, we 'bout to slide, ayy\nCan't let this one slide, ayy (Who's bad?)\nToosie slide, then I hit it double-time\nThen I hit a spin 'cause we spun their block a couple times\nIf it's not the right time, there'll always be another time\nI'm not even trippin', we'll just see 'em in the summertime, woah, yeah\nCan't describe the pressure I be puttin' on myself, yeah\nReally, I just can't afford to lose nobody else, yeah\nIf they movin' shaky, we'll just do this shit ourselves, woah\nIf I'm movin' shaky, Chubbs'll do this shit himself, yeah\nSolo niggas, only YOLO, for real\nHeard a lot about you but we don't know for real\nNext time, guarantee the truth'll get revealed\nBlack leather gloves, no sequins, yeah\nBuckles on the jacket, it's Alyx shit\nNike crossbody, got a piece in it\nGot a dance, but it's really on some street shit\nI'ma show you how\nIt go right foot up, left foot, slide\nLeft foot up, right foot, slide\nBasically, I'm sayin' either way we 'bout to slide, ayy\nCan't let this one slide, ayy\nDon't you wanna dance with me? No?\nI could dance like Michael Jackson (Jackson)\nI could give you thug passion (Passion)\nIt's a Thriller in the trap where we from (Where we from)\nBaby, don't you wanna dance with me? No?\nI could dance like Michael Jackson (Jackson)\nI could give you satisfaction ('Faction)\nAnd you know we out here every day with it\nI'ma show you how to get it\nIt go right foot up, left foot, slide\nLeft foot up, right foot, slide\nBasically, I'm sayin' either way we 'bout to slide\n(Who's bad?)\n\n"}, {"title": "Desires", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["d. hill", "future", "drake"], "artist": "drake", "lyrics": "D. Hill (D. Hill)\nAyy\nI should've put you somewhere where no one could find you\nMansion out in the sticks with nothin' around you\nKaty, Texas, Dallas, Texas, you know, a different environment (Ayy)\n'Cause you got desires, I know, I know, I know\n'Cause you got desires, I know, I know, I know\n'Cause you got desires\nI should've put you somewhere where no one could find you (Ayy)\nMansion out in the sticks with nothin' around you\nKaty, Texas, Dallas, Texas, you know, a different environment (Ayy)\n'Cause you got desires, I know, I know, I know\n'Cause you got desires, I know, I know, I know\n'Cause you got desires\nAyy\nSelf-control has never been your thing\nDon't think it'll help if there's a ring with a rock in it\nWhere I'm from, they serve the soda clean (Clean, clean)\nYou come from a city where there's lean with the rocks in it\nHow the fuck you keep so many secrets?\nHow you goin' vegan, but still beefin' with me again?\nHow the fuck you've seen so many beaches?\nTickets to them places don't come cheap, and\nI see you back in Turks\nRemember who took you there first and don't you forget it\nGot you a whip, but then you got back on your shit\nI had to tell Eric go get it\nI'm always movin' too fast, the feeling don't last\nI feel like you take me for granted\nProbably my fault for the way that I handle it\nI should've put you somewhere where no one could find you (Ayy)\nMansion out in the sticks with nothin' around you\nKaty, Texas, Dallas, Texas, you know, a different environment (Ayy)\n'Cause you got desires, I know, I know, I know (Ayy)\n'Cause you got desires, I know, I know, I know (Ayy)\n'Cause you got desires\nOoh, shawty, you tried it\nVoice gettin' filled with entitlement\nWhy would you tell me those lies? And\nWhy would you make it so bold to my face?\nWhy are your stories all over the place?\nWhole lotta secrets friends don't keep safe\nWhere did your friends all go? (Woo)\nI can't solve your problems\nYou say your problems never needed solvin'\nI was too good to you, should've stayed solid\nNice guys always finish off where they started\nDéjà vu, you wanted things and you got 'em\nDéjà vu, I wanted smoke and I got it\nDéjà vu, déjà\nDéjà\n"}, {"title": "Time Flies", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["drake", "oz"], "artist": "drake", "lyrics": "Yeah, I'm outside in an AMG\nRight outside, TT\nToo turnt, baby girl, you know me, yeah\nStill with the dawgs that I grew beside\nAll the niggas 'round me ride or they die\nGotta watch the time 'cause it's flyin' right by\nI'm outside in an AMG, yeah\nRight outside, TT\nToo turnt, baby girl, you know me\nWho am I? All the niggas 'round me ride or they die\nGotta watch the time 'cause it's flyin' right by\nToo turnt, baby girl, you know me\nI just caught a shawty off a finsta\nJust threw on a hoodie, it's a Crenshaw\nWay that I been livin' unconventional\nI'm just tryna make it to the end, ya know\nCertain things just started gettin' tenser\nThink we need to have us an adventure\nI could be your man but maybe down the road\nRight now I would rather see my heart turn to chrome\nRather see my heart turn crystal\nI can't even front like I don't miss ya\nRight now I'm just stuck inside the crib on my own\nSoon as I free up, I'm 'bout to pop up on your phone like\nI'm outside in an AMG\nRight outside, TT\nToo turnt, baby girl, you know me, yeah\nWho am I? All the niggas 'round me ride or they die\nGotta watch the time 'cause it's flyin' right by\nToo turnt, baby girl, you know me\nYeah\nHeart's still on javelin, baby\nToo turnt, baby girl, you know me\nI was pullin' off 'fore they knew me\nSometimes I wish there was two of me or three of me\nWhen it was you and me\nI felt like I love you too much to change you\nYou believe in angles more than angels\nFeel like I've been going through too much to explain to you\nBut I'm still the same way I was when I came to you\nEverything I have, what I had to exchange for you\nEverything I've been through, I can't even complain to you\nWish it stayed the same for you, sorry\nI'm sorry\nAnd-and-and-and—\nI'm outside in a—\nI'm-I'm-I'm-I'm— (I'm-I'm-I'm-I'm—, I'm-I'm-I'm-I'm—)\nI'm outside in a—\nI'm-I'm-I'm-I'm— (I'm-I'm-I'm-I'm—, I'm-I'm-I'm-I'm—)\nI'm outside in a—\nAnd-and-and-and I'm outside in a—\nI'm-I'm-I'm-I'm— (I'm-I'm-I'm-I'm—, I'm-I'm-I'm-I'm—)\nI'm outside in a—\nWoi-oi, woi-oi-woi-oi-woi-oi-woi-oi-woi-oi\n\n"}, {"title": "Landed", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["cardo", "dez wright", "drake"], "artist": "drake", "lyrics": "Yeah, ayy, ayy\nIf I gotta land, I'ma stick it\nBaby, let it go and you gon' miss it\nWrote this with a Cartier pen, do I sound different? Yeah, yeah\nOverseas and back, I was round-trippin'\nI've been, uh, I've been, what?\nI've been pop, whippin', wrist is on another rhythm\nI was not kiddin', don't know why they playin' with him\nI was not finna let them get no top billin'\nMan, they really tried to take this shit and run with it\nAnd I bought my dawg a Rollie 'cause he rolled with it, yeah\nAnd I bought that girl a shovel 'cause she gold-diggin', yeah\nIf he talkin' out his head, then it's off with it, yeah\nBoardin' Air Drake, then we takin' off in it, yeah\nAnd if I gotta land, I'ma stick it, ayy, yeah\nBaby, let it go and you gon' miss it\nWrote this with a Cartier pen, do I sound different?\nYeah, you always said I changed, I'm just now switchin'\nAyy, ayy, what?\nAyy, ayy, I done dosed off\nI done got a different number 'cause I'm closed off\nUsed to hit the bitch and now she wanna... huh\nNow she wanna call me like she doesn't know that phone's off, uh, what?\nI just met her friend and now her clothes off, yeah\nDrop around whoever, bet it goes off, yeah\nPatek doin' backflips, showin' off\nYeah, and if I gotta land, I'ma stick it\nBaby, let it go and you gon' miss it\nWrote this with a Cartier pen, do I sound different? Yeah, yeah\nOverseas and back, I was round-trippin'\nI've been, uh, I've been, what?\nI've been pop, whippin,' wrist is on another rhythm\nHe been block-switchin', don't know how you ride with him\nGotta supermodel, wanna be a down missus\nAll my niggas, they be on them out-of-town missions\nWasn't hearin' me before, okay, but now listen\nPushin' five Cadillacs like a politician\nI be in and out arenas like I'm Scottie Pippen\nYeah, pop, whippin', wrist is goin' thirty with it, ooh, yeah\nPut the beat in front of me, I'm dirtyin' it, yeah, what?\nDo this shit for real, you niggas dabble in it, yeah\nSay you need a minute, I don't have a minute, yeah\nAnd if I gotta land, I'ma—\nStick that motherfucker at the Clearport and park that\n\n"}, {"title": "D4L", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["southside", "young thug", "future", "drake"], "artist": "drake", "lyrics": "Go to Palm Springs for a daytrip\nFreeband, October's Own, it's the same shit\nShawty keep on knockin' back the shots, better pace this\nWoah, woah, banknotes, presidential faces\nWoah, woah, Bankhead, started seein' spaceships, woah\nWe just started fuckin', she impatient\nNow she want a butt lift, now she want some LASIK\nJust to see the bag clearer, that way she can chase it\nAyy, ayy\nI remember grade six, I was up in Payless tryna get some Asics\nNow I'm Nike'd down in a motherfuckin' snake pit\nNow I'm type of nigga give it out and I don't take shit (808 my crew)\n"}, {"title": "Pain 1993", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["playboi carti", "pi’erre bourne", "drake"], "artist": "drake", "lyrics": "(Yo, Pi'erre, yo, Pi’erre)\nAyy\n"}, {"title": "Losses", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["foreign teck", "elyas", "sevn thomas", "drake"], "artist": "drake", "lyrics": "Yeah\nYeah\nLost you to the game, I gotta hug that\nI was here when you was asking where the love at\nDip your finger in the bag to get your buzz back\nI was wishin' on a star when I was that\nI've been fortunate enough to have it my way\nI'm a fortune teller, listen to what I say\n'Member when we used to park up in my driveway\nI always told it how it was, I never shy away\nThis life is really something you get lost in\nI know niggas that got famous and they bought friends\nI had friends that only had half of they heart in\nIt's hard to accept now, and it was hard then\nBut I treated you like gold, I was all in\nSpoiled rotten, they could smell you 'fore you walked in\nBurnin' incense in your new apartment\nBut you got no sense when it come to\nLost you to the game, I gotta hold that\nHow you feelin' in your soul since you sold that?\nI'll be better off without you, and we know that\nYou ain't lookin' at a nigga you could hold back\nLike I'm tryna show the waves, this is no cap\nYou sold me up the river, but I rowed back\nYou put me on the road without a roadmap\nI'm not tryna make no song, these are cold facts\nAyy\nBeing here wasn't in the plans\nI do it for the Grahams, not the 'Gram\nI do it for the fam, but still fuckin' Uncle Sam\nI tried to change for you, but that wasn't who I am\nEven when being real is out of fashion\nNiggas keep stealin' my style, now we out here matchin'\nI did it by being myself with no dramatic acting\nI couldn't sit around and wait, I had to have it happen\nLost you to the game, I gotta face that\nReally think I lost you like a ways back\nAlways sayin' how a nigga never play fair\nI took you up under my wing and you just stayed there\nYou was supposed to grow some wings, get your own pair\nWe started this from the bottom, now you alone there\nShit, you treat it like it's home there\nDependent on me, you was supposed to get your own share\nI still love you to my last days\nI never knew that shit would be this fast-paced\nI never thought I'd see awards in a glass case\nI could've ended up in your crib with a masked face\nIt could've went left on a couple bad days\nWhen I visit my last place is the only time I'm in last place\nSee me these days, I never got on a sad face\nSee me these days, I\nLost you to the game, and I see why\nIt was always you and I without the T-Y\nThis is not one of them stories that got three sides\nThis is not one of them stories you could rewind\nLike I'm tryna show the waves, this is no cap\nYou drove a nigga crazy, but I drove back\nYou wrote me off and then you never wrote back\nI'm not tryna make no song, these are cold facts\n"}, {"title": "From Florida With Love", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["40", "drake", "mexikodro"], "artist": "drake", "lyrics": "(Plugg)\n(Bitch)\nAyy, yeah\nAyy, ayy (Plugg)\nWritin' this from Florida with love (Love)\nWhen I linked with Mexiko, I knew I found a plug (Dro)\nRest in peace to Static, yellin' \"Shawty want a thug,\" ayy\nBottles in the club, ayy, know I love to touch (Ayy)\nWeezy played that shit for me and Kobe on the bus\nWent and got a chain for me, I had to give it up (Yeah)\nNiggas had they pistols loaded pointed at my truck, ayy\nAnd you know that lesson stuck (Right)\nFrom that day I never touched the road without a (Plugg)\nAyy, from that day I never saw the point in talkin' tough (Nah)\nHasn't happened since, I guess you niggas know what's up (Yup)\nYeah, haven't seen the 6ix in like a month (6ix)\nFuck that, I'm back, baby, where the love? (Love)\nRappers that I threw an alley-oop are throwin' subs (Yeah)\nBut they gotta dap me when they see me, that's what's up (That's what's up)\nI let that shit slide, I got everything\nI could lose it all if I'm reactin' to the petty things\nKnow that if I see you, I'ma ask you if you said them things\nYMB the gang and they down to stain anything, mhm\nYeah, that's right\nYMB the gang and they down to stain anything, mhm\nYeah, that's right\nYMB the gang and you know them niggas…\nBooted up, turned up, piped up (Plugg)\nI'm back, baby, where the love? (Where the love at?)\nI'm back, baby, where the love? (Where the love at?)\nI'm back, baby, where the love?\nBooted up, turned up, piped up (Plugg)\nI'm back, baby, where the love? (Where the love at?)\nI'm back, baby, where the love? (Where the love at?)\nI'm back, baby, where the love? (Ayy)\n(Plugg)\nWritin' this from Florida with love (Love)\nWhen I linked with Mexiko, I knew I found a plug (Dro)\nRest in peace to Static, yellin' \"Shawty want a thug,\" ayy\nBottles in the club, ayy, know she wanna fuck (Ayy)\nWeezy played that shit for me and Kobe on the bus\nWe ain't even get to reminiscin' what it was (Yeah)\nMoral of the story is the story finished us\nDamn, and you know that lesson stuck (Right)\nHaven't left the 6ix in like a month (Ayy)\nFuck that, I'm here, baby, where the love? (Nah)\nFuck that, I'm here, baby, just because (Yeah, yeah)\nI would never leave, but I could, though (6ix)\nYes, I know I leave you, not for good, though (No)\nSame way you could diss, but you wouldn't, though\n'Cause you know good and well that I'm...\nBooted up, turned up, piped up (Plugg)\nI'm back, baby, where the love? (Where the love at?)\nI'm back, baby, where the love? (Where the love at?)\nI'm back, baby, where the love?\nBooted up, turned up, piped up (Plugg)\nI'm back, baby, where the love? (Where the love at?)\nI'm back, baby, where the love? (Where the love at?)\nI'm back, baby, where the love? (Ayy)\n\n"}, {"title": "Demons", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["sosa geek", "jb made it", "fivio foreign", "drake"], "artist": "drake", "lyrics": ""}, {"title": "War", "year": "2020", "album": "Dark Lane Demo Tapes ", "writers": ["axl beats", "drake"], "artist": "drake", "lyrics": "AXL (AXL), AXL (AXL), AXL (AXL)\nWoi-oi\nAyy\nI don't cop things for resale, don't do iCloud, don't do email\nFeds wanna tap up man and wire up man like Chubbs did Detail\nBack when Ricky was doin' up Teesdale, I was doin' dinner with Teezy\nI didn't trust no one, swore gyal lined me 'cause gyal too greazy\nNiko never move neeky, sweatsuit Nike, sweatsuit DG\nIf man get beaky, ring ring, call up GiGi, do him up neatly\nUsed to look up to a man from certain ends with tune on repeat\nThought he was a bad boy, then 'til man got pinched and man went PC\nMan went PC just like Dell and Windows, some man been those\nBefore I was ever around Kendall's, I was at ends though, dreamin' up Enzos\nThe woman I do end up with has to be a bad gyal just like Munchie\nCan't have no pretentious ting when I know this road gets bumpy\nWord to the broski Jay, he got different names in different countries\nThree waps in the whip and we beat that case, where man live way too comfy\nI don't do well with people makin' disses or makin' threats\nWoi-oi, man got flown like private jets, for way, way less\nI know you tried to get one down on us, ever since then it's been stress\n'Cause you know the rest 'dem owe you one and we always pay them debts\nWassa, wassa, just like the crodie Pressa, I don't do no passa\nLink with Skull and Cuz and Jamie ah yard and we deh pon Gaza\nPasha Sasha pissed, I was way too young at the time for slashings\nYou niggas spend too much time on captions, not enough time on action\nPick one man with slaps that's rappin', I bet he don't want no clashings\nThe LV pouch on chest is just for fashion, niggas just actin'\nAre you dumb or stupid? The wheels on the Rolls is Chromazz, headshot domazz\nJust checked in at a hotel, floor that we on got potent aromas\nOVOXO link up, mandem drink up, me and the drillers\nHawk and Sticks and Cash and Baka, Gucci, P, and Gilla\nAnd the boy that sound like he sang on Thriller, you know that's been my nigga\nYeah, we just had to fix things, family, 6ix tings, we can't split up\nAs for the rest of the game, I'll do man dirty, man'll get two time\nTo me, that's just our side, I don't really care who rides on whose side\nBring ten shots to the poolside, never seen none of these grown men outside\n4301, won't spare no one, niggas gotta know about Southside\nSteppin' outta line, get outlined, and you know I'm tied up stateside\nBringin' man down when they take sides, tryna get saved by the bell like Bayside\nPrince, I carry that last name, that shit stays on me like brand names\nJas just lined up brand new hand tings and nice guy on a madting\nEveryone I know has codenames, anyone I'm beefin' with is a no-name\nNiggas can't even win home games, they just gotta fall in line like Soul Train\nAyy\nYeah\nAXL (AXL), AXL (AXL), AXL (AXL)\n\n"}]