[{"title": "Tuscan Leather", "year": "2013", "album": "Nothing Was the Same ", "writers": ["drake", "anthony palman", "linda thompson"], "artist": "drake", "lyrics": "Yeah, alright, yeah\nComin' off the last record, I'm gettin' 20 million off the record\nJust to off these records, nigga that's a record\nI'm livin' like I'm out here on my last adventure\nPast the present when you have to mention\nThis is nothin' for the radio, but they'll still play it though\nCause it's that new Drizzy Drake, that's just the way it go\nHeavy airplay all day with no chorus\nWe keep it thorough, nigga, rap like this for all of my borough niggas\nI reached the point where don't shit matter to me, nigga\nI reached heights that Dwight Howard couldn't reach, nigga\nPrince Akeem, they throw flowers at my feet, nigga\nI could go a hour on this beat, nigga\nI'm just as famous as my mentor\nBut that's still the boss, don't get sent for\nGet hype on tracks and jump in front of a bullet you wasn't meant for\nCause you don't really wanna hear me vent more\nHot temper, scary outcome\nHere's a reason for niggas that's hatin' without one\nThat always let they mouth run\nBench players talkin' like starters, I hate it\nStarted from the bottom, now we here, nigga, we made it\nYeah, Tom Ford Tuscan Leather smellin' like a brick\nDegenerates, but even Ellen love our shit\nRich enough that I don't have to tell 'em that I'm rich\nSelf explanatory, you just here to spread the story, wassup\nSittin' Gucci Row like they say up at UNLV\nYoung rebel, Young Money nothin' you could tell me\nPaperwork takin' too long, maybe they don't understand me\nI'll compromise if I have to, I gotta stay with the family\nNot even talkin' to Nicki, communication is breakin'\nI dropped the ball on some personal shit, I need to embrace it\nI'm honest, I make mistakes, I'd be the second to admit it\nThink that's why I need her in my life, to check me when I'm trippin'\nOn a mission tryna shift the culture\nTell me who dissin', I got some things that'll hit the culprit\nThem strep throat flows, them shits to stop all of the talkin'\nAll of the talkin', got one reply for all of your comments\nFuck what you think, I'm too busy, that's why you leave a message\nBorn a perfectionist, guess that makes me a bit obsessive\nThat shit I heard from you lately really relieved some pressure\nLike ayy, B I got your CD, you get an E for effort\nI piece letters together and get to talkin' reckless\nOwl chains like credentials, you know you see the necklace\nMy life's a completed checklist\nI'm tired of hearin' 'bout who you checkin' for now\nJust give it time, we'll see who's still around a decade from now\nThat's real\nHow much time is this nigga spendin' on the intro?\nLately I've been feelin' like Guy Pearce in Memento\nI just set the bar, niggas fall under it like a limbo\nThe family all that matters, I'm just out here with my kinfolk\nOff everything my pen wrote we went from Bundy to Winslow\nThis for shorty up on Glengrove who love when I catch my tempo\nI sip the Pora and listen to Cappadonna (Talk to 'em)\nThe fresh prince, just had dinner with Tatyana, no lie\nAll these 90's fantasies on my mind\nThe difference is that with mine, they all come true in due time\nI might come through without security to check if you're fine\nThat's just me on my solo like fuck it, like YOLO\nWanted to tell you, \"Accept yourself\"\nYou don't have to prove shit to no one except yourself\nAnd if you end up needin' some extra help, then I could help\nYou know, back on your feet and shit\nTryna get my karma up, fuck the guilty and greedy shit\nHow much time is this nigga spendin' on the intro?\nHow this nigga workin' like he got a fuckin' twin though?\nLife is soundin' crazy, 40 on Martin Scorsese\nAnd I wouldn't change a thing if you paid me, now real nigga wassup\nHow much time is this nigga spendin' on the intro?\nIf there's hell below. I'll see you when you get there. Are you enjoyin' yourselves? If we may we'd just like to close off with somethin' a bit inspirational. Hopefully something a bit relevant as to us all are having the same fears, shedding similar tears, and of course dying in so many years. It don't mean that we can't have a good life. So we'd like to just maybe close out with something, some food for thought, for all of us\n\n"}, {"title": "Furthest Thing", "year": "2013", "album": "Nothing Was the Same ", "writers": ["adrian x", "anthony palman", "drake"], "artist": "drake", "lyrics": "Somewhere between psychotic and iconic\nSomewhere between I want it and I got it\nSomewhere between I'm sober and I'm lifted\nSomewhere between a mistress and commitment\nBut I stay down, girl I always stay down, get down, never lay down\nPromise to break everybody off before I break down\nEveryone just wait now, so much on my plate now\nPeople I believed in they don't even show they face now\nWhat they got to say now? Nothin' they can say now\nNothin' really changed but still they look at me a way now\nWhat more can I say now? What more can I say now?\nYou might feel like nothin' was the same\nI still been drinkin' on the low, mobbin' on the low\nFuckin' on the low, smokin' on the low\nI still been plottin' on the low, schemin' on the low\nThe furthest thing from perfect like everyone I know\nI just been drinkin' on the low, mobbin' on the low\nFuckin' on the low, smokin' on the low\nI just been plottin' on the low, schemin' on the low\nThe furthest thing from perfect like everyone I know\nAnd I hate that you don't think I belong to ya\nJust too busy runnin' shit to run home to ya\nYou know that paper my passion\nBittersweet celebrations, I know I can't change what happened\nI can't help it, I can't help it, I was young and I was selfish\nI made every woman feel like she was mine and no one else's\nAnd now you hate me, stop pretendin', stop that frontin', I can't take it\nGirl don't treat me like a stranger, girl you know I seen you naked\nGirl you know that I remember, don't be a pretender\nGettin' high at the condo, that's when it all comes together\nYou know I stay reminiscing and make-up sex is tradition\nBut you been missin' girl and you might feel like nothin' was the same\nI still been drinkin' on the low, mobbin' on the low\nFuckin' on the low, smokin' on the low\nI still been plottin' on the low, schemin' on the low\nThe furthest thing from perfect like everyone I know\nI just been drinkin' on the low, mobbin' on the low\nFuckin' on the low, smokin' on the low\nI just been plottin' on the low, schemin' on the low\nThe furthest thing from perfect like everyone I know\nDrinkin', smokin', fuckin', plottin'\nSchemin', plottin', schemin', gettin' money\nDrinkin', fuckin', smokin', plottin'\nSchemin', plottin', schemin', gettin' money\nUh, this the life for me\nMy momma told me this was right for me\nI got 'em worried, like make sure you save a slice for me\nI should have Spoons serve you up with a fork and knife for me\nYour actions make us doubt you\nYour lack of effort got me rappin' different\nThis the shit I wanna go out to\nPlay this shit at my funeral if they catch me slippin'\nNaked women swimmin', that's just how I'm livin'\nDonate a million to some children, that's just how I'm feelin'\nA nigga fillin' up arenas, who the fuck could see us?\nI had to Derrick Rose the knee up before I got the re-up\nYours truly, the boy\nI just build and build more, y'all niggas build to destroy\nY'all niggas party too much, man, I just chill and record\nNo filler, you feel it now if you ain't feel it before\nYes, Lord, this the shit I wanna go out to\nYeah yeah, this the shit I wanna go out to\n\n"}, {"title": "Started from the Bottom", "year": "2013", "album": "Nothing Was the Same ", "writers": ["mike zombie", "40", "drake"], "artist": "drake", "lyrics": "Started…\nZombie on the track\nStarted from the bottom, now we're here\nStarted from the bottom, now my whole team fuckin' here\nStarted from the bottom, now we're here\nStarted from the bottom, now the whole team here, nigga\nStarted from the bottom, now we're here\nStarted from the bottom, now my whole team here, nigga\nStarted from the bottom, now we're here\nStarted from the bottom, now the whole team fuckin' here\nI done kept it real from the jump\nLivin' at my momma's house, we'd argue every month\nNigga, I was tryna get it on my own\nWorkin' all night, traffic on the way home\nAnd my uncle callin' me, like, \"Where you at?\nI gave you the keys, told you bring it right back”\nNigga, I just think it's funny how it goes\nNow I'm on the road, half a million for a show, and we—\nStarted from the bottom, now we're here\nStarted from the bottom, now my whole team fuckin' here\nStarted from the bottom, now we're here\nStarted from the bottom, now the whole team here, nigga\nStarted from the bottom, now we're here\nStarted from the bottom, now the whole team fuckin' here\nStarted from the bottom, now we're here\nStarted from the bottom, now the whole team here, nigga\nBoys tell stories 'bout the man\nSay I never struggled, wasn't hungry, yeah, I doubt it\nNigga, I could turn your boy into the man\nThere ain't really much out here that's poppin' off without us\nNigga, we just want the credit where it's due\nI'ma worry 'bout me, give a fuck about you\nNigga, just as a reminder to myself\nI wear every single chain, even when I'm in the house\nCause we—\nStarted from the bottom, now we're here\nStarted from the bottom, now my whole team fuckin' here\nStarted from the bottom, now we're here\nStarted from the bottom, now the whole team here, nigga\nNo new niggas, nigga, we don't feel that\nFuck a fake friend, where your real friends at?\nWe don't like to do too much explainin'\nStory stayed the same, I never changed it\nNo new niggas, nigga, we don't feel that\nFuck a fake friend, where your real friends at?\nWe don't like to do too much explainin'\nStory stayed the same through the money and the fame\nCause we—\nStarted from the bottom, now we're here\nStarted from the bottom, now my whole team fuckin' here\nStarted from the bottom, now we're here\nStarted from the bottom, now the whole team here, nigga\nStarted from the bottom, now we're here\nStarted from the bottom, now my whole team here, nigga\nStarted from the bottom, now we're here\nStarted from the bottom, now the whole team here, nigga\n\n"}, {"title": "Wu-Tang Forever", "year": "2013", "album": "Nothing Was the Same ", "writers": ["40", "anthony palman", "drake"], "artist": "drake", "lyrics": "I just love when I'm with you, yeah, this shit is on ten\nWe used to be friends, girl, and even back then\nYou would look at me with no hesitation and you'd tell me baby, it's yours\nNobody else's, yeah, this shit belong to nobody, it's yours\nNobody else's, yeah, this shit belong to nobody and that\nWhat made me think about the game, girl\nAnd how I switched it up with a new thing\nYoung nigga came through on his Wu-Tang\nAnd nowadays when I ask about who got it, they say it's yours\nNobody else's, yeah, this shit belong to nobody, it's yours\nNobody else's, yeah, this shit belong to nobody, it's yours\nIt's yours, it's yours, it's yours that's for sure, that's for sure (yeah)\nIt's yours, it's yours, it's yours, it's yours that's for sure, that's for sure\nHow you feel about comin' home with a nigga for the night?\nIf you nervous, hit the lights, I know we only fuckin' out of spite\nCause your man don't do you right, do you right, I could fuck you so good\nThen I hit you with the 9 a.m. in Dallas who you like, baby, who you like?\nMachine gun raps for all my niggas in the back\nStadium packed, just glad to see the city on the map\nI just gave the city life, it ain't about who did it first\nIt's 'bout who did it right, niggas looking like \"Preach\"\nOpen cases on me for a half a million each\nI find peace knowing that it's harder in the streets, I know\nLuckily I didn't have to grow there\nI would only go there cause niggas that I know there\nI don't know what's getting into me, I just like the rush\nWhen you see your enemy somewhere in the club and you realize\nHe just not in a position to reciprocate your energy\nYou ain't ever worried cause he's not who he pretends to be\nPeople like Mazin who was a best friend to me\nStart to become a distant memory, things change in that life\nAnd this life started lacking synergy\nAnd fuckin' with me mentally, I think it's meant to be\nYeah, paranoid, always rolling with my mothafuckin' boys\nBut you gotta understand when it's yours\nThey don't really leave your ass with a mothafuckin' choice, man\nI just love when I'm with you, yeah, this shit is on ten\nWe used to be friends, girl, and even back then\nYou would look at me with no hesitation and you'd tell me baby, it's yours\nNobody else's, yeah, this shit belong to nobody, it's yours\nNobody else's, yeah, this shit belong to nobody and that\nWhat made me think about the game, girl\nAnd how I switched it up with a new thing\nYoung nigga came through on his Wu-Tang\nAnd nowadays when I ask about who got it, they say it's yours\nNobody else's, yeah, this shit belong to nobody, it's yours\nNobody else's, yeah, this shit belong to nobody, it's yours\nIt's yours, it's yours, it's yours that's for sure, that's for sure\nIt's yours, it's yours, it's yours that's for sure, that's for sure\n\n"}, {"title": "Own It", "year": "2013", "album": "Nothing Was the Same ", "writers": ["detail", "dre moon", "anthony palman", "drake"], "artist": "drake", "lyrics": "Yours... You're still the one that I adore\nAin't much out there to have feelings for\nGuess whose it is? Guess whose it is?\nGuess whose it is? Guess whose it is? Yours\nA few bottles on the table, a few waters\nIt ain't a secret, baby, everybody saw us\nGuess whose it is? Guess whose it is?\nGuess whose it is? It's yours\nNext time we fuck, I don't wanna fuck, I wanna make love\nNext time we talk, I don't wanna just talk, I wanna trust\nNext time I stand tall, I wanna be standin' for you\nAnd next time I spend I want it all to be for you\nPeakin', I'm peakin'\nWake up with me this weekend, we can, oh\nGuess whose it is? Guess whose it is?\nGuess whose it is? It's yours\nNiggas talk more than bitches these days\nJust let that shit sink in, ha!\nNiggas talk more than bitches these days\nWho could get the pussy quicker these days\nStill straight with the weed and the liquor these days\nCause the new drugs got the kids trippin' these days\nBunch of journalists been searchin' for a story\nMy ex-girl been searchin' for a \"sorry\"\nCouple bitches tryna have me on the Maury\nLike nigga it's yours, you should be supportin'\nBut where you been at? On tour, gettin' money\nY'all don't even really check for me\nYou ain't even hit me when that nigga had threats for me, girl\nYou don't love me, you just say that shit to get to me, girl\nCause you got the Batphone and my workline, you should call\nWhen the last time you did somethin' for the first time?\nYou done done it all\nI swear to God, niggas talk more than bitches these days\nGot you thinkin' that I'm different these days\nBroken telephone for every single conversation\nBy the time it gets to you, shit switches these days\nIt's yours, it's yours, it's yours, it's... it's always gonna be yours\n"}, {"title": "Worst Behavior", "year": "2013", "album": "Nothing Was the Same ", "writers": ["detail", "dj dahi", "anthony palman", "drake"], "artist": "drake", "lyrics": "Worst...\nMothafucka never loved us\nFucka never loved us\nYou ain't know, now you know now\nStill at it, scrub J's with a toothbrush\nShit...\nNiggas still playing my old shit\nBut your shit is like the police askin' us questions\nNigga, we don't know shit\nFlexin'...\nNigga, I'm just flexin'\nNigga never loved us\nDo it look like we stressin'?\nLook at you, look at you and look at you\nAww, I'm glad that they chose us\n'Cause man it's a mission, tryna fight to the finish\nJust to see am I finished\nOn my worst behavior, no? They used to never want to hear us\nRemember? Mothafucka never loved us\nRemember? Mothafucka!\nRemember? Mothafucka never loved us\nI'm on my worst behavior! Don't you ever get it fucked up!\nMothafuckas never loved us! Man, mothafuckas never loved us\nWorst behavior! Mothafuckas never loved us\nFucka never loved us! Worst behavior\nHold up, hold my phone\nMothafuckas never loved us\nFucka never loved us\nNow you want to roll one\nMothafucka never loved us\nSo everywhere we go now, full cup\nAlways hated the boy, but now the boy is the man\nMothafucka, I done growed up\nYou know me? You know me?\nI'm liable to do anything\nWhen it comes to that you owe me\nYou owe me, you owe me\nBitch, you better have my money\nWhen I come for that shit like O.D.B\nOn my worst behavior, no? They used to never want to hear us\nRemember? Mothafucka never loved us\nRemember? Mothafucka!\nRemember? Mothafucka never loved us\nI'm on my worst behavior! Don't you ever get it fucked up!\nMothafuckas never loved us! Man, mothafuckas never loved us\nWorst behavior! Mothafuckas never loved us\nFucka never loved us! Worst behavior\nWho's hot, who not? Tell me who rock, who sell out in stores?\nYou tell me who flop, who copped the new drop, whose jewels got rocks\nWho else making rap albums, doing numbers like it's pop?\nSame old pimp, Drake, you know ain't nothin' changed\nWith these funny style niggas, we done put on in the game\nI just ask for some blessings at my grandmother's grave\nThen it's back to L.A., open the mail, starin' at the check\nEnough to make you throw up, man, it's gross what I net\nI'm with my whole set, tennis matches at the crib\nI swear I could beat Serena when she playin' with her left\nOh, where I reside it look like a resort inside\nNigga, where your shit from? I imported mine\nBar mitzvah money like my last name Mordecai\nFuck you bitch, I'm more than high\nMy momma probably hear that and be mortified\nThis ain't the son you raised who used to take the Acura\n5 a.m. then go and shoot Degrassi up on Morningside\nFor all the stuntin', I'll forever be immortalized\nYeah, back and forth across the borderline\nHate to leave the city, but I've got to do the overtime\nGone all the time, even the important times\nI should let you know ahead I'm comin' back on my worst behavior\nRemember? Remember? Mothafucka, remember?\nHold up, hold my phone, they used to never want to hear us\nRemember? Mothafucka never loved us\nRemember? Mothafucka, remember? Worst behavior\n\n"}, {"title": "From Time", "year": "2013", "album": "Nothing Was the Same ", "writers": ["chilly gonzales", "40", "jhené aiko", "drake"], "artist": "drake", "lyrics": "Yeah, I needed to hear that shit, I hate when you're submissive\nPassive aggressive when we're texting, I feel the distance\nI look around the peers that surround me, these niggas tripping\nI like when money makes a difference but don't make you different\nStarted realizing a couple places I could take it\nI want to get back to when I was that kid in the basement\nI want to take it deeper than money, pussy, vacation\nAnd influence a generation that's lacking in patience\nI've been dealing with my dad, speaking of lack of patience\nJust me and my old man getting back to basics\nWe've been talking 'bout the future and time that we wasted\nWhen he put that bottle down, girl that nigga's amazing\nWell, fuck it, we had a couple Coronas\nWe might have rolled a white paper, just something to hold us\nWe even talked about you and our couple of moments\nHe said we should hash it out like a couple of grown ups\nYou a flower child, beautiful child, I'm in your zone\nLooking like you came from the 70's on your own\nMy mother is 66 and her favorite line to hit me with is\nWho the fuck wants to be 70 and alone?\nYou don't even know what you want from love anymore\nI search for something I'm missing and disappear when I'm bored\nBut girl, what qualities was I looking for before?\nWho you settling for? Who better for you than the boy, huh?\nUh, thinking 'bout Texas, back when Porscha used to work at Treasures\nOr further back than that, before I had the Houston leverage\nWhen I got Summer a Michael Kors with my momma's debit\nA weak attempt at flexing, I'll never forget it\n'Cause that night I played her three songs\nThen we got to talking 'bout something we disagreed on\nThen she start telling me how I'll never be as big as Trey Songz\nBoy was she wrong, that was just negative energy for me to feed off\nNow it's therapeutic blowing money in the Galleria\nOr Beverly Center Macy's where I discovered Bria\nLandmarks of the muses that inspired the music\nWhen I could tell it was sincere without tryna prove it\nThe one that I needed was Courtney from Hooters on Peachtree\nI've always been feeling like she was the piece to complete me\nNow she engaged to be married, what's the rush on commitment?\nKnow we were going through some shit, name a couple that isn't\nRemember our talk in the parking lot at the Ritz\nGirl I felt like we had it all planned out, I guess I fucked up the vision\nLearning the true consequences of my selfish decisions\nWhen you find out how I'm living, I just hope I'm forgiven\nIt seem like you don't want this love anymore\nI'm acting out in the open, it's hard for you to ignore\nBut girl, what qualities was I looking for before?\nWho you settling for? Who better for you than the boy, huh?\n"}, {"title": "Hold On, We’re Going Home", "year": "2013", "album": "Nothing Was the Same ", "writers": ["majid al maskati", "drake", "nineteen85"], "artist": "drake", "lyrics": "I got my eyes on you\nYou're everything that I see\nI want your hot love and emotion endlessly\nI can't get over you\nYou left your mark on me\nI want your hot love and emotion endlessly\n'Cause you're a good girl and you know it\nYou act so different around me\n'Cause you're a good girl and you know it\nI know exactly who you could be\nJust hold on, we're going home\nJust hold on, we're going home\nIt's hard to do these things alone\nJust hold on, we're going home\nI got my eyes on you\nYou're everything that I see\nI want your hot love and emotion endlessly\nI can't get over you\nYou left your mark on me\nI want your hot love and emotion endlessly\n'Cause you're a good girl and you know it\nYou act so different around me\n'Cause you're a good girl and you know it\nI know exactly who you could be\n"}, {"title": "Connect", "year": "2013", "album": "Nothing Was the Same ", "writers": ["kenza samir", "40", "drake", "hudson mohawke"], "artist": "drake", "lyrics": "Isn't it amazing?\nHow you talk all this shit and we still lack communication\nHow beautiful our kids would be, girl, I don't need convincing\nHow every conversation starts with \"this time will be different\"\nOh, the idea is fun, oh, the idea is fun\nOh, the idea is so fun every time\nAt least we try for home run every time\nSwanging, eyes closed, just swanging\nSame city, same friends, if you're looking for me\nSame city, same friends, if you're looking\nI'll be here just swanging\nDon't talk to me like I'm famous\nAnd don't assume, 'cause I don't respect assumptions, babe\nI'm just tryna connect with somethin', baby\nYeah, swanging\nShe just wanna run around the city and make memories\nThat she can barely remember\nAnd I'd allow her\nTalk about pussy power\nShe just wanna run over my feelings\nLike she drinking and driving in an 18 wheeler\nAnd I'd allow her, talk about pussy power\nShe used to say: \"You can be whoever you want, even yourself\"\nYeah, I show up knowin' exactly who I was\nAnd never leave as myself\nBut when it falls apart, I'm always still down\nTo pick a million tiny little pieces off the ground\nWish you would learn to love people and use things\nAnd not the other way around\nSwanging, eyes closed just swanging\nSame city, same friends if you're looking for me\nSame city, same friends if you're looking\nI'll be here just swanging\nDon't talk to me like I'm famous\nAnd don't assume cause I don't respect assumptions bae\nI'm just tryna connect with somethin' baby\nI'll be here, just swanging\nI remember when my schedule was as flexible as she is\nShe call and tell me be here before the sun up\nI be dressed before we hung up\nI take Eglinton to 401 east\nAnd exit at Markham road in the east end\nWhere all the pretty girls are sleeping\nMy license been expired I renew it after the weekend\nFuck I know I said that shit the last 7 weekends\nGirl I guess procrastination is my weakness\nI hate stoppin' for gas this late\nCause there's niggas creepin and not like how we're creepin'\nSummer is comin' know you could feel it\n20 on pump whatever I ain't got enough to fill it\nWon't knock on your door\nMy uncle say, \"You drive my whip like it's yours\"\nI got the pedal to the floor\nI'm on my motherfuckin' way, swangin'\nDon't fall asleep on me, hang in there\nI'll be there just swangin'\nI'll be there just swangin'\nI treat you good, girl, like you're famous\nI know I'm late, it's always the same shit\nBut don't fall asleep on me, hang in there\nI'm on the road right now swangin, girl\n\n"}, {"title": "The Language", "year": "2013", "album": "Nothing Was the Same ", "writers": ["birdman", "anthony palman", "drake"], "artist": "drake", "lyrics": "Yeah\nYeah, yeah\nYeah, yeah\nYeah, yeah\nYeah, yeah\nLook, look\nI don't know why they been lyin'\nBut your shit is not that inspirin'\nBank account statement  just look like\nI'm ready for early retirement\nFuck any nigga that's talking that shit just to get a reaction\nFuck going platinum\nI look at my wrist and it's already platinum\nI am the kid with the motor mouth\nI am the one you should worry 'bout\nI don't know who you're referring to\nWho is this nigga you heard about?\nSomeone just talking that bullshit\nMan, someone just gave you the run-around\nNiggas downplayin' the money\nBut that's what you do when the money down\nI don't waste time puttin' money down\nI just go straight to who got it and buy it in cash\nPussy so good that you gotta come see me on tour\nAnd you gotta fly in first class\nThis has been years in the makin'\nIt's all for the city, they know I come right every summer\nCash Money Records forever, I'm always big timin'\nBitch, I came up right under Stunna, you know it\nJealousy in the air tonight, I could tell\nI will never understand that, but oh well\nBeen ready, it's real, I don't know 'bout you\nShe just want to smoke and fuck\nI said \"Girl, that's all that we do.\"\nOkay, now you're talkin' my language\nNow you're talkin' my language\nNow you're talkin' my language\nNow you're talkin' my language\nBeen ready, it's real, I don't know 'bout you\nShe just want to smoke and fuck\nI said \"Girl, that's all that we do.\"\nI'm 'bout to roll one and light it\nAnd fuck it, man, no one's invited\nI got to kill off the weak shit\nThat's got all you niggas excited\nI can't even listen, you wildin'\nI'd much rather sit here in silence\nI send all my money to banks in the islands\nAnd eat with Italians, I do\nPeople are funny, you don't even know\n'Bout the shit that I been through\nI just want some head in a comfortable bed\nIt could all be so simple\nTalkin' that shit with your back to me\nJust know it always get back to me\nCome get your girl, she been here for three days\nAnd she way too attached to me\nHate when they get too attached to me\nI got to get on the bus and get back on the road\nGet what I can out the country\nAnd then I just get on the jet and go back to the cold\nCan't even drive with the top off\nI been workin' so hard on the album, I missed the whole summer\nI just might bring in some girls from Miami\nTo heat up the city, and that's word to Stunna, you know it\nJealousy in the air tonight, I could tell\nI will never understand that, but oh well\nBeen ready, it's real, I don't know 'bout you\nShe just want to smoke and fuck\nI said \"Girl, that's all that we do.\"\nOkay, now you're talkin' my language\nNow you're talkin' my language\nNow you're talkin' my language\nNow you're talkin' my language\nBeen ready, it's real, I don't know 'bout you\nShe just want to smoke and fuck\nI said \"Girl, that's all that we do.\"\n"}, {"title": "305 to My City", "year": "2013", "album": "Nothing Was the Same ", "writers": ["detail", "dre moon", "drake"], "artist": "drake", "lyrics": "Drop down, drop-drop (Shit is real out here)\nDrop down, drop-drop\nDrop down, drop-drop, get it, get it\nDrop down, drop-drop\nI get it, I get it, I get it, I get it\nYour hustle don't ever go unnoticed baby, I'm with you I'm with it\nI get it, I get it, I get it, I get it, I get it, I get it\nThey don't work hard as you, damn that's so crazy\nAt the end of the night when you count, numbers don't lie to my baby\nLocker room full of money, girl you just did it\nI get it I get it, man fuck all that talking, take shots to the kidney\nDown payment on the Jaguar, your roommate got credit\n12 months on the lease, that's a come up baby don't you ever forget it\nConnections are heavy, every real nigga they fuck with you\nNails chipped out in diamonds, you sparkle but fuck man\nThe spark ain't enough for you\nI get it, I get it, I get it, I get it\nYour hustle don't ever go unnoticed baby, I'm with you I'm with it\nI get it, I get it, I get it, I get it, I get it, I get it\nTonight was your night, go get you some lobsters and shrimp\nYou smart and you know it, I get it I get it, you outdo these pimps\nI hope you don't fall, that's you on the top of the ceiling\nDon't you ever forget 'bout your story, I get it, you did it you did it\nGot a link on the champagne, your best friend is bar-tending\nYour parents saying this another phase in your life\nThey can't wait until it's all finished\nShine on them hoes, let 'em know that you run shit\nI get it I get it, I'm working too hard let's get into some fun shit\n281 to my city, heard you had trouble at customs\nYour girl got a DUI, I'll make the calls to get y'all through customs\nTell your best friend, \"Girl get your paperwork right\"\nI get it I get it, what's up for the night?\nGet it, get it, get it, drop down, drop drop down\nGet it, get it, get it, drop down, drop drop down\nYour momma used to live at the church on Sunday\nYou just go to LIV after church on Sunday\nOh Lord, oh Lord we're not in Kansas anymore\nWe're not in Kansas anymore\n\n"}, {"title": "Too Much", "year": "2013", "album": "Nothing Was the Same ", "writers": ["emile haynie", "drake", "nineteen85"], "artist": "drake", "lyrics": "Done sayin' I'm done playin'\nLast time was on the outro\nStuck in the house, need to get out more\nI've been stackin' up like I'm fundraising\nMost people in my position get complacent\nWanna come places with star girls, and they end  up on them front pages\nI'm quiet with it, I just ride with it\nMoment I stop having fun with it, I'll be done with it\nI'm the only one that's putting shots up\nAnd like a potluck, you need to come with it\nDon't run from it, like H-Town in the summertime, I keep it 100\nMet a lot of girls in my times there, word to Paul Wall, not one fronted\nI was birthed there in my first year, man I know that place like I come from it\nBackstage at Warehouse in '09 like \"Is Bun coming?\nFuck that, is anyone comin' 'fore I show up there and there's no one there?\"\nThese days, I could probably pack it for like twenty nights if I go in there\nBack rub from my main thing, I've been stressed out\nTalkin' to her like back then they didn't want me, I'm blessed now\nTalkin' to her like this drop, bet a million copies get pressed out\nShe tell me, \"Take a deep breath, you're too worried about being the best out\"\nSomeone go tell Noel to get the Backwoods\nMoney got my whole family going backwards\nNo dinners, no holidays, no nothin'\nThere's issues at hand that we're not discussin'\nI did not sign up for this\nMy uncle used to have all these things on his bucket list\nAnd now he's actin' like, \"Oh, well, this is life, I guess,\" Nah, fuck that shit\nListen man, you can still do what you wanna do, you gotta trust that shit\nHeard once that in dire times when you need a sign, that's when they appear\nGuess since my text message didn't resonate, I'll just say it here\nHate the fact my mom cooped up in her apartment, telling herself\nThat she's too sick to get dressed up and go do shit, like that's true shit\nAnd all my family from the M-Town that I've been 'round, started treating me like I'm \"him\" now\nLike we don't know each other, we ain't grow together, we just friends now\nShit got me feeling pinned down, pick the pen up or put the pen down\nI'm writing to you from a distance like a pen pal, but we've been down\n"}, {"title": "Pound Cake / Paris Morton Music 2", "year": "2013", "album": "Nothing Was the Same ", "writers": ["dre moon", "anthony palman", "drake"], "artist": "drake", "lyrics": "Yeah\nUh, after hours at Il Mulino\nOr Sotto Sotto, just talkin' women and vino\nThe contract like '91 Dan Marino\nI swear this guy Michael Rapino's boosting my ego\nOverly focused, it's far from the time to rest now\nDebates growin' 'bout who they think is the best now\nTook a while, got the jokers out of the deck now\nI'm holdin' all the cards and niggas wanna play chess now\nI hear you talking, say it twice so I know you meant it\nFuck it, I don't even tint it, they should know who's in it\nI'm authentic, real name, no gimmicks\nNo game, no scrimmage, I ain't playin' with you niggas at all\nMy classmates, they went on to be chartered accountants\nOr work with their parents\nBut thinkin' back on how they treated me\nMy high school reunion might be worth an appearance\nMake everybody have to go through security clearance\nTables turn, bridges burn, you live and learn\nWith the ink I could murder, word to my nigga Irv\nYeah, I swear shit just started clickin' dog\nYou know it's real when you are who you think you are\nYeah, uh\nLook, fuck all that \"Happy to be here\" shit that y'all want me on\nI'm the big homie, they still be tryna lil bro me, dog\nLike I should fall in line, like I should alert niggas\nWhen I'm 'bout to drop somethin' crazy\nAnd not say I'm the greatest of my generation\nLike I should be dressing different\nLike I should be less aggressive and pessimistic\nLike I should be way more nervous and less dismissive\nLike I should be on my best behavior and not talk my shit\nAnd do it major like the niggas who paved the way for us\nLike I didn't study the game to the letter\nAnd understand that I'm not doin' it the same\nMan, I'm doing it better\nLike I didn't make that clearer this year\nLike I should feel, I don't know, guilty for saying that\nThey should put a couple more mirrors in here\nSo I can stare at myself\nThese are usually just some thoughts\nThat I would share with myself\nBut I thought \"Fuck it\", it's worth it to share 'em\nWith someone else other than Paris for once\nI text her from time to time, she a mom now\nI guess sometimes life forces us to calm down\nI told her she could live with me if she need to\nI got a compound but I think she's straight\n'Cause she supported since Hot Beats\nRight before Wayne came and got me\nOut of the back room where I was rapping with Jas\nOver beats that I shouldn't have in the hopes for the glory\nHe walked right past in the hallway\nThree months later, I'm his artist\nHe probably wouldn't remember that story\nBut that shit stick with me always\nCouldn't believe when he called me\nYou never know what could happen to you\nAnd I just spent four Ferraris all on a brand new Bugatti\nAnd did that shit 'cause it's somethin' to do\nYeah, I guess that's just who I became, dawg\nNothing was the same, dawg\n\n"}, {"title": "Come Thru", "year": "2013", "album": "Nothing Was the Same ", "writers": ["noel “gadget” campbell", "anthony palman", "drake"], "artist": "drake", "lyrics": "Yeah\nWe had the type of nights where mornin' comes too soon\nAnd nothin' was the same\nWatch me, goin' out of the way, when I shoulda went home\nOnly time of the day I get to spend on my own\nI was trippin' off how I used to sleep at ya crib\nShould drive by right where you live and pick you up on the way\nWe ain't spoke in so long, prolly put me in the past\nI can still get you wet, and I can still make you laugh\nYou should call into work if that ain't too much to ask\nI could pour you up a drink and we can burn somethin'\nCome through, come through, come through, come through\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come through\nKnow ya got that thang that I like\nKnow ya, know ya got that thang that I like\nCome through, come through, come through\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come through\nYeah, last night I brought DOA to the studio\nThey already had a stage and a booty pole\nIt's supposed to be a lot of hard workin' goin' on\nBut who the fuck can focus with this twerkin' goin' on?\nSomeone put a order in for a chicken (for a chicken)\nTold my girl to order in, I need the kitchen (need the kitchen)\nYeah, they know I got the hookup, they just wait on me to cook up\nBaby, I heat up the stove, you do the dishes, ya know?\nRap game, crack game, ain't that different, ya know?\nLast album had it boomin' somethin' vicious, ya know?\nAnd ya know I need ya back in my life\nGirl, ya know ya got that, know ya got that thing that I like\nGirl, you got that thing for real\nWhen I was on a mission to make it\nWho used to sleep on the floor with you when you lived in the basement?\nWho else got all the things you need at 4am when it's late?\nI always pour you up a drink and let you burn somethin'\nCome through, come through, come through, come through\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come through\nKnow ya got that thang that I like\nKnow ya, know ya got that thang that I like\nCome through, come through, come through\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come through\nWhy has it been so long? Why has it been so long?\nWhy has it been? Why has it been?\nWho you been crying to? Who you been flying to?\nWhose bed are you sleeping in? Someone's been hiding you\nWhere have you been? You deserve rounds tonight\nCome through girl you deserve rounds tonight\nCome through girl you deserve rounds tonight\nCome through girl you deserve rounds tonight\nRounds tonight oh\nCome through girl you deserve rounds tonight\nCome through girl you deserve rounds tonight\nCome through girl you deserve rounds tonight\n\n"}, {"title": "All Me", "year": "2013", "album": "Nothing Was the Same ", "writers": ["drake", "anthony palman", "maurice yvain"], "artist": "drake", "lyrics": "Got everything, I got everything\nI cannot complain, I cannot\nI don't even know how much I really made, I forgot, it's a lot\nFuck that, never mind what I got\nNigga don't watch that 'cause I—\nCame up, that's all me, stay true, that's all me (yeah)\nNo help, that's all me, all me for real\nCame up, that's all me, stay true, that's all me (2 Chainz)\nNo help, that's all me, all me for real\nGot everything, I got everything\nI cannot complain, I cannot\nI don't even know how much I really made, I forgot, it's a lot\nFuck that, never mind what I got\nNigga don't watch that 'cause I—\nCame up, that's all me, stay true, that's all me\nNo help, that's all me, all me for real\nCame up, that's all me, stay true, that's all me\nNo help, that's all me, all me for real\nI touched down in '86, knew I was the man by the age of 6\nI even fucked the girl that used to babysit\nBut that was years later on some crazy shit\nI heard your new shit, nigga hated it\nDamon Wayans, homie don't play that shit\nI get paid a lot, you get paid a bit\nAnd my latest shit is like a greatest hits\nGod damn, ain't no wishing over on this side\nY'all don't fuck with us, then we don't fuck with y'all\nIt's no different over on this side\nGod damn, should I listen to everybody or myself?\n'Cause myself just told myself:\n\"You're the motherfucking man, you don't need no help\"\nCashing checks and I’m bigging up my chest\nY'all keep talking ‘bout who next, but I’m about as big as it gets\nI swear y'all just wasting y'all breath\nI’m the light skinned Keith Sweat, I'ma make it last forever\nIt’s not your turn 'cause I ain't done yet\nLook, just understand that I'm on a roll like Cottonelle\nI was made for all of this shit\nAnd I’m on the road box office sales\nI’m getting paid for all of this shit\nAsk you to please excuse my table manners\nI was making room for the table dancers\n'Cause if we judging off your advances\nThen I just got paid like eight advances, God damn!\nGot everything, I got everything\nI cannot complain, I cannot\nI don't even know how much I really made, I forgot, it's a lot\nFuck that, never mind what I got\nNigga don't watch that 'cause I—\nCame up, that's all me, stay true, that's all me\nNo help, that's all me, all me for real\nCame up, that's all me, stay true, that's all me—\nOh me, oh me, oh my\nI think I done fucked too many women from the 305\n'Fore the end of this year\nI'll do King of Diamonds 3 more times\nSmoking on that kush all in our section\nLike it's legalized\nGirl, you can't always have your way\nSometimes it be like that\nThey don't really fuck with you like that\nThey ain't never did me like that\nI just took my time, you got the shine\nI let you eat like that\nI been taught to never loan somebody\nWhat you need right back\nAnd I need that shit right back\n(No more free Randy) I’m blessed than a muhfucka\nNiggas been stressed than a muhfucka\nNiggas getting nervous\nClutching they chests like a muhfucka\nDamn that’s a motherfucker\nTell the truth, I don’t listen to you\n'Cause I don’t like being lied to\nAnd that ship won’t sail\nAnd that wind won’t guide you\nDaddy was in jail, we was talking through the window\nLike a motherfucking drive-thru\nThat was back then, man\nNow my niggas rich enough to do whatever I do\n\n"}, {"title": "The Motion", "year": "2013", "album": "Nothing Was the Same ", "writers": ["40", "drake", "sampha"], "artist": "drake", "lyrics": "I don't have a fuck to give, I've been moving state to state\nIn my leather and my Timbs like it's 1998\nAnd my dog Chubby Chub, that's my nigga from the way\nOn the Eastside of the city, that's where everybody stay\nSeem like everybody calling 'cause they want me on their song\nIt's like every time I touch it I could never do no wrong\nWhen they need a favor from you, man, they don't leave you alone\nBut I guess that's just the motion, yeah\nYeah, looking back on it, at least my pride is intact\n'Cause we said \"no strings attached\" and I still got tied up in that\nEverything that I write is either for her or about her\nSo I'm with her even when I'm here without her and she know it\nThe girl that I wanna save is like a danger to my health\nTry being with somebody that wanna be somebody else\nI always thought she was perfect when she was being herself\nDon't even know how to help, but I guess that's just the motion, yeah\n"}]