[{"title": "Over My Dead Body", "year": "2011", "album": "Take Care ", "writers": ["chantal kreviazuk", "40", "anthony palman", "drake"], "artist": "drake", "lyrics": "I think I killed e'rybody\nIn the game last year, man, fuck it, I was on though\nAnd I thought I found the girl of my dreams\nAt the strip club, mmm-mmm, fuck it, I was wrong though\nShout out to all my niggas living tax free\nNowadays it's six figures when they tax me\nOh well, I guess you lose some and win some\nLong as the outcome is income\nYou know I want it all and then some\nShout out to Asian girls, let the lights dim some\nShots came, I don't know where they was sent from\nProbably some bad hoes I'm 'bout to take the hint from\nYeah, you know me well, nigga\nI mean you ain't the only real nigga\nThey got me on these white women like Seal, nigga\nSlave to the pussy but I'm just playing the field, nigga\nAre these people really discussing my career again?\nAsking if I'll be going platinum in a year again?\nDon't I got the shit the world wanna hear again?\nDon't Michael Jordan still got his hoop earring in?\nMan all of your flows bore me: paint drying\nAnd I don't ever be trippin off of what ain't mine\nAnd I be hearing the shit you say through the grapevine\nBut jealousy is just love and hate at the same time\nYeah, it's been that way from the beginning\nI just been playing, I ain't even notice I was winning\nAnd this is the only sound you should fear\nMan, these kids wear crowns over here and everything is all right\nYou say I'm old news, well who the new star?\nCause if I'm going anywhere, it's probably too far\nJust performed at a Bar Mitzvah over in the States\nUsed half of the money to beat my brother's case\nRed wine over Fed time\nAnd shout out to the niggas that's doing dead time\nShout out to the bitches there when it's bedtime\nAnd fuck you to the niggas that think it's their time\nYeah, don't make me take your life apart, boy\nYou and whoever the fuck gave you your start boy\nOh, you wanna be a motherfucking funny guy?\nDon't make me break your Kevin Hart, boy\nYeah, it's whatever\nYou know, feeling good, living better\nI think maybe I was numb to it last year\nBut you know I feel it now more than ever\nMy city love me like Mac Dre in the Bay\nSecond album, I'm back paving the way\nThe backpackers are back on the bandwagon\nLike this was my comeback season back, back in the day\nAnd I met your baby moms last night\nWe took a picture together, I hope she frames it!\nAnd I was drinking at the Palms last night\nAnd ended up losing everything that I came with\nFeel like I've been here before, huh?\nI still got ten years to go, huh?\nAnd this is the only sound you should fear\nMan, these kids wear crowns over here and everything is all right\nThree in the morning, still going down\n\n"}, {"title": "Shot for Me", "year": "2011", "album": "Take Care ", "writers": ["the weeknd", "40", "drake"], "artist": "drake", "lyrics": "I can see it in your eyes, you're angry\nRegret got shit on what you're feelin' now\nMad cause he ain't like me\nOh you mad cause nobody ever did it like me\nAll the care I would take\nAll the love that we made\nNow you're trying to find somebody to replace what I gave to you\nIt's a shame you didn't keep it\nAlisha, Catya, I know that you gon' hear this\nI'm the man, yeah I said it\nBitch, I'm the man, don't you forget it\nThe way you walk, that's me\nThe way you talk, that's me\nThe way you've got your hair up, did you forget that's me?\nAnd the voice in your speaker right now that's me\nThat's me, and the voice in your ear\nThat's me, can't you see\nThat I made it? Yeah, I made it\nFirst I made you who you are and then I made it\nAnd you're wasted with your latest\nYeah, I'm the reason why you always getting faded\nTake a shot for me (Oh-oh-oh-oh, oh-oh-oh-oh)\nTake a shot for me (Oh-oh-oh-oh, oh-oh-oh-oh)\nTake a shot for me (Uh-huh, uh-huh, oh-whoa, oh, whoa)\nA shot for me (Uh-huh, uh-huh, oh-whoa, oh, whoa)\nA shot for me\nOk, look, I'm honest. Girl, I can't lie, I miss you\nYou and the music were the only things that I'd commit to\nI never cheated, for the record, back when I was with you\nBut you believed in everything but me, girl, I don't get you\nShe says \"I know you changed\nI never see you cause you're always busy doing things\"\nI really wish she had a different way of viewing things\nI think the city that we're from just kinda ruined things\nIt's such a small place; not much to do but talk and listen\nThe men are jealous and the women all in competition\nAnd all your friends telling you stories that you often misin-terpret\nAnd taint all the images of your \"Mr. Perfect\"\nI could tell that you been crying all night, drinking all summer\nPrayin' for your happiness, hope that you recover, uh\nThis is one I know you hated when you heard it\nAnd it's worse because you know that I deserve it\nTake a shot for me (Oh-oh-oh-oh, oh-oh-oh-oh)\nTake a shot for me (Oh-oh-oh-oh, oh-oh-oh-oh)\nTake a shot for me (Uh-huh, uh-huh, oh-whoa, oh, whoa)\nA shot for me (Uh-huh, uh-huh, oh-whoa, oh, whoa)\nA shot for me\nYeah\nMay your neighbors respect you\nTrouble neglect you\nAngels protect you\nAnd heaven accept you\n\n"}, {"title": "Headlines", "year": "2011", "album": "Take Care ", "writers": ["boi-1da", "40", "drake"], "artist": "drake", "lyrics": "I might be too strung out on compliments\nOverdosed on confidence\nStarted not to give a fuck and stopped fearin' the consequence\nDrinkin' every night because we drink to my accomplishments\nFaded way too long, I'm floatin' in and out of consciousness\nAnd they sayin' I'm back, I'd agree with that\nI just take my time with all this shit, I still believe in that\nI had someone tell me I fell off, ooh, I needed that\nAnd they want to see me pick back up, well, where'd I leave it at?\nI know I exaggerated things, now I got it like that\nTuck my napkin in my shirt ‘cause I'm just mobbin' like that\nYou know good and well that you don't want a problem like that\nYou gon' make someone around me catch a body like that\nNo, don't do it (Ayy), please don't do it (Ayy)\n‘Cause one of us goes in, and we all go through it (Ayy)\nAnd Drizzy got the money, so Drizzy gonna pay it\nThose my brothers, I ain't even gotta say it\nThat's just something they know\nThey know, they know, they know (They know, ayy)\nThey know, they know, they know\nThey know, they know, they know\nYeah, they know, yeah\nThat the real is on the rise\nFuck them other guys\nI even gave 'em a chance to decide\nNow it's something they know\nThey know, they know, they know\nYeah!\nI be yellin' out, \"Money over everything! Money on my mind!\"\nThen she wanna ask when it got so empty\nTell her I apologize, happened over time\nShe says, \"They miss the old Drake\", girl don't tempt me\n\"If they don't get it, they'll be over you\nThat new shit that you got is overdue\nYou better do what you supposed to do\"\nI'm like, \"Why I gotta be all that?\"\nBut still I can't deny the fact that it's true\nListening to you expressin' all them feelings\nSoap opera rappers, all these niggas sound like All My Children\nAnd that's who you thinkin' is 'bout to come and make a killin'\nI guess it really is just me, myself and all my millions\nYou know that they ain't even got it like that\nYou gon' hype me up and make me catch a body like that\n‘Cause I live for this, it isn't just a hobby like that\nWhen they get my shit and play it\nI ain't even gotta say it, they know\nThey know, they know, they know (They know)\nThey know, they know, they know\nThey know, they know, they know\nYeah, they know, yeah\nThat the real is on the rise\nFuck them other guys\nI even gave 'em a chance to decide\nNow it's something they know\nThey know, they know, they know\nI be yelling out \"Money over everything!\"\n\"Money on my mind, mind, mind-mind!\"\nTell them I apologize, it happened over time, time, time-time\nThey know\nThey know, they know, they know\nThey know, they know, they know\nThey know, they know, they know\nYeah…\nI heard once that they would rather hear about memories than enemies\nRather hear what was or what will be than what is\nRather hear how you got it over how much it cost you\nRather hear about findin' yourself than how you lost you\nRather you make this an open letter\nAbout family, and struggle, and it takin' forever\nAbout hearts that you've broken, and ties that you've severed\nNo doubt in my mind, that'll make them feel better\n\n"}, {"title": "Crew Love", "year": "2011", "album": "Take Care ", "writers": ["illangelo", "the weeknd", "40", "drake"], "artist": "drake", "lyrics": "Yeah\nSmoking weed under star projectors\nI guess we'll never know what Harvard gets us\nBut seeing my family have it all\nTook the place of that desire for diplomas on the wall\nAnd really, I think I like who I'm becoming\nThere's times where I might do it just to do it like it's nothing\nThere's times when I might blow like 50k on a vacation\nFor all my soldiers just to see the looks on all they faces\nAll it took was patience\nI got a lotta friends to come up off the strip for me\nThe same ones that'll come up off the hip for me\nThe realest niggas say your lyrics do shit for me\nI told my story, and made history\nTell them I'ma need reservations for 20\nI've never really been one for the preservation of money, nah\nMuch rather spend it all while I'm breathing\nThat OVO and that XO is everything you believe in, I know\n"}, {"title": "Take Care", "year": "2011", "album": "Take Care ", "writers": ["40", "jamie xx", "drake"], "artist": "drake", "lyrics": "I've asked about you and they told me things\nBut my mind didn't change and I still feel the same\nWhat's a life with no fun? Please, don't be so ashamed\nI've had mine, you've had yours, we both know, we know\nThey won't get you like I will, my only wish is I die real\n'Cause that truth hurts and those lies heal\nAnd you can't sleep thinking that he lies still\nSo you cry still, tears all in the pillowcase\nBig girls all get a little taste, ah\nPushing me away so I give her space, ah\nDealing with a heart that I didn't break\nI'll be there for you, I will care for you\nI keep thinking you just don't know\nTryna run from that, say you done with that\nOn your face, girl, it just don't show\nWhen you're ready, just say you're ready\nWhen all the baggage just ain't as heavy\nAnd the party's over, just don't forget me\nWe'll change the pace and we'll just go slow\nYou won't ever have to worry, you won't ever have to hide\nYou've seen all my mistakes so look me in my eyes\nIt's my birthday, I'll get high if I want to\nCan't deny that I want you but I'll lie if I have to\nCause you don't say you love me\nTo your friends when they ask you\nEven though we both know that you do, you do\nOne time, been in love one time\nYou and all your girls in the club one time\nAll so convinced that you're following your heart\n'Cause your mind don't control what it does sometimes\nWe all have our nights, though, don't be so ashamed\nI've had mine, you've had yours, we both know, we know\nYou hate being alone well you ain't the only one\nYou hate the fact that you bought the dream\nAnd they sold you one\nYou love your friends, but somebody should've told you some\nTo save you; instead, they say:\n"}, {"title": "Marvin’s Room", "year": "2011", "album": "Take Care ", "writers": ["adrian x", "40", "drake"], "artist": "drake", "lyrics": "Cups of the rosé\nBitches in my old phone\nI should call one and go home\nI've been in this club too long\nThe woman that I would try\nIs happy with a good guy\nBut I've been drinkin' so much\nThat I'ma call her anyway, and say\nFuck that nigga that you love so bad\nI know you still think about the times we had\nI say fuck that nigga that you think you found\nAnd since you picked up, I know he's not around\nUh, cups of the XO\nAll my people been here\nI see all of her friends here\nGuess she don't have the time to kick it no more\nFlights in the morning\nWhat you doin' that's so important?\nI've been drinkin' so much\nThat I'ma call you anyway, and say\nFuck that nigga that you love so bad\nI know you still think about the times we had\nI say fuck that nigga that you think you found\nAnd since you picked up, I know he's not around\nI think I'm addicted to naked pictures\nAnd sitting talking 'bout bitches that we almost had\nI don't think I'm conscious of makin' monsters\nOutta the women I sponsor 'til it all goes bad\nBut, shit, it's all good\nWe threw a party, yeah, we threw a party\nBitches came over, yeah, we threw a party\nI was just calling, ‘cause they were just leavin'\nTalk to me, please, don't have much to believe in\nI need you right now, are you down to listen to me?\nToo many drinks have been given to me\nI got some women that's livin' off me\nPaid for their flights and hotels, I'm ashamed\nBet that you know them, I won't say no names\nAfter a while, girl, they all seem the same\nI've had sex four times this week; I'll explain\nHavin' a hard time adjustin' to fame\nSprite in that mixture\nI've been talkin' crazy, girl, I'm lucky that you picked up\nLucky that you stayed on\nI need someone to put this weight on\n\"Well, I'm sorry\"\nYou're not gonna come?\nGuess I'm 'bout to just kick it here, then\nJust throw up while I hold your hair back\nHer white friend said, \"You niggas crazy\"\nI hope no one heard that\nI hope no one heard that\n‘Cause if they did, we gonna be in some trouble\nWe really gonna be in some trouble, trouble\n\n"}, {"title": "Buried Alive Interlude", "year": "2011", "album": "Take Care ", "writers": ["supa dups", "40", "drake", "kendrick lamar"], "artist": "drake", "lyrics": ""}, {"title": "Under Ground Kings", "year": "2011", "album": "Take Care ", "writers": ["40", "drake", "t-minus"], "artist": "drake", "lyrics": "Yeah\nBridge over troubled water, ice in my muddy water\nRich off a mixtape, got rich off a mixtape\nProbably shouldn't be driving, it just got so much harder\nCan't even see it straight, I can't even see it straight\nUh, fuck with me, I buy the shots\nLive a little, 'cause niggas die a lot\nAnd lie a lot but I'm the truth -- that's right, I fucking said it\nThe living proof that you ain't gotta die to get to heaven\nYou girl, you right there, you look like you like this shit\nHow'd I know, how'd I know? That's me on some psychic shit\nI can tell a lie if you askin' me my whereabouts\nBut I might talk that real if you ask me what I care about\nRap and bitches, rappin' bitches, bitches\nAnd rappin', rappin' and bitches until all of it switches, I swear\nIt's been two years since somebody asked me who I was\nI'm the greatest man, I said that before I knew I was\nThat's what's important, what really happened before this\nWhen me and my crew was all about this rapper from New Orleans\nSinging, \"Walking like a man, finger on the trigger\nI got money in my pocket, I'm a uptown nigga, ah\"\nWith fame on my mind, my girl on my nerves\nI was pushing myself to get something that I deserve\nThat was back in the days, Acura days\nI was a cold dude, I'm getting back to my ways\nPeople always ask how I got my nice things\nTake my crown to the grave, I'm an underground king\nI bet we can make tonight the greatest story ever told\n'Cause I'm down to spend whatever, lately I've been on a roll\nAnd I do it for the city, 'cause you know the city love a nigga\nDo it for the city, 'cause you know the city love a nigga\nDo it for the city, 'cause you know the city love a nigga\nDo it for the city (UGK, fuck these other niggas)\nSometimes I need that romance\nSometimes I need that pole dance\nSometimes I need that stripper\nThat's gon' tell me that she don't dance\nTell me lies, make it sound good, make it sound good\nDo me like the women from my town would\nLeather with that woodgrain, Persian rugs on wood floors\nTalking all the good things, that's all I'm really good for\nMemphis, Tennessee no, see I start to go deep back\nAnd Ridge Crest with my seat back with Yo Gotti and E-Mack\nAnd these niggas got them diamonds glowing in they mouth\nAnd they rockin' furs like it's snowing in the south\nAnd every pretty girl tell me that's the shit that she like\nSo why am I in class if this is who I'm tryna be like\nSo I drop out, lessons I was taught are quick to fade\nSoon as I realize that turning papers in won't get me paid\nAnd if I don't do nothing, I'ma ball\nI'm counting all day like a clock on the wall, yeah, I need that\nMaking major changes to the life I'm living\nI had no choice, I had to prove I made the right decision\nThat was back in the days, Acura days\nI was a cold dude, I'm getting back to my ways\nPeople always ask how I got my nice things\nTake my crown to the grave, I'm an underground king\nI bet we can make tonight the greatest story ever told\n'Cause I'm down to spend whatever, lately I've been on a roll\nAnd I do it for the city, 'cause you know the city love a nigga\nDo it for the city, 'cause you know the city love a nigga\nDo it for the city, 'cause you know the city love a nigga\nDo it for the city (UGK, fuck these other niggas)\n\n"}, {"title": "We’ll Be Fine", "year": "2011", "album": "Take Care ", "writers": ["birdman", "40", "drake", "t-minus"], "artist": "drake", "lyrics": "Yeah, never thoughts of suicide, I'm too alive\nBut I still treat it likes it's do or die\nEven though dying isn't in the plans\nBut neither was making it and here I am\nIn the Presidential -- do you like your new room?\nAlways presidential and tonight's no blue moon\nSince I saw Aaliyah's precious life go too soon\nShe deserve the credit for how I'm about to get it\nThat's why I got a new dumb thing moving through the street, got a new condo, move it to the beach\nHeard Nicki just bought a brand new crib, goddamn, man, she's beauty and the beast (Lord)\nSeems like yesterday that I was up and coming\nStill so young that I ain't had enough of nothing\nThe fam here, the drink here\nThe girls here?\nWell, fuck, let's get it then\nI'm trying to let go of the past\nShould we make this one a double, you ain't even gotta ask, Ahh\nBecause it's hard to say no (say no)\nYeah, it gets hard to say no\nAre you down, are you down? Yeah, you all the way down, every time, every time, every time, every time\nAm I down, am I down? Yeah, I'm all the way down, We'll be fine, We’ll be fine\nWe’ll be fine, We’ll be fine\nAre you down, are you down? Yeah, you all the way down, every time, every time, every time, every time\nAm I down, am I down? Yeah, I'm all the way down, We'll be fine, We’ll be fine, We’ll be fine, We’ll be fine\nUsed to make us proud -- we had dreams of getting bigger, man\nLoved you until now, but now I'm the nigga, man\nYou keep talking that, \"You was this and you had this\"\nAnd you deserve some fucking credit how did anyone forget it\nGot a show up in your city, yo girl is in the line\nAnd the line around the corner, it's my motherfucking time\nYou should take it as a sign, man I got it right now\nI wouldn't doubt it cause these bitches all about it right now\nLet's be real about this shit, can I take you home?\nOr come to where you stay? Do you live on your own?\nI heard you got your ways, I never would have known\nShe said, \"you're such a dog\", I said, \"you're such a bone.\"\nI've been everywhere, where you know me from?\nThese days women give it to me like they owe me one\nBut they crave attention, though, they always saying, \"show me some\"\nBut girl you ain't the only one that's trying to be the only one\nAt least I admit that, if you get that, and you with that\nThen, fuck, let's get it then\nI'm trying to let go of the past\nShould we make this one a double, you ain't even gotta ask, Ahh\nBecause it's hard to say no (say no)\nYeah, it gets hard to say no\nAre you down, are you down? Yeah, you all the way down, every time, every time, every time, every time\nAm I down, am I down? Yeah, I'm all the way down, We'll be fine, We’ll be fine, We’ll be fine, We’ll be fine\nAre you down, are you down? Yeah, you all the way down, every time, every time, every time, every time\nAm I down, am I down? Yeah, I'm all the way down, We'll be fine, We’ll be fine, We’ll be fine, We’ll be fine\n"}, {"title": "Make Me Proud", "year": "2011", "album": "Take Care ", "writers": ["nikhil seetharam", "drake", "nicki minaj", "t-minus"], "artist": "drake", "lyrics": "I like a woman with a future and a past\nA little attitude problem all good, it’ll make the shit last\nDon’t make it too easy, girl, don’t take it too fast\nYeah, that's it right there\nThat's it, do it just like that\nOnly you can do it just like that\nAnd I love it when your hair still\nWet cause you just took a shower\nRunning on a treadmill and only eating salad\nSound so smart like you graduated college\nLike you went to Yale but you probably went to Howard\nKnowing you, weekend in Miami trying to study by the pool\nCouple things due but you always get it done\nMight've been a time when I loved her too\nBut you take that away and you’ve always been the one\nOne, I wonder why the moon looks nice, girl\nMaybe it’s just right for the night\nYou said niggas coming on too strong, girl\nThey want you in their life as a wife\nThat's why you want to have no sex, why you want to protest\nWhy you want to fight for your right\nCause you don’t love them boys\nPussy run everything, fuck that noise\nI know things get hard, but girl, you got it\nGirl, you got it, there you go\nCan’t you tell by how they looking at you everywhere you go?\nWondering what's on your mind, it must be hard to be that fine\nWhen all these muthafuckas wanna waste your time\nIt’s just amazing, girl, and all I can say is\nI’m so I'm so I'm so I'm so I'm so  proud of you\nI’m so I'm so I'm so I'm so I'm so  proud of you\nI’m so I'm so I'm so I'm so I'm so  proud of you\nEverything’s adding up, you’ve been through hell and back\nThat's why you’re bad as fuck and you—\nI know things get hard, but girl, you got it\nGirl, you got it, there you go\nCan’t you tell by how they looking at you everywhere you go?\nWondering what's on your mind, it must be hard to be that fine\nWhen all these muthafuckas wanna waste your time\nIt’s just amazing, girl, all I can say is\nI’m so I'm so I'm so I'm so I'm so  proud of you\nI’m so I'm so I'm so I'm so I'm so  proud of you\nI’m so I'm so I'm so I'm so I'm so  proud of you\nEverything's adding up, you've been through hell and back\nThat's why you're bad as fuck and you know you are\nAnd I know all I can say is\nI’m so I'm so I'm so I'm so I'm so  proud of you\nAnd I know all I can say is\nI’m so I'm so I'm so I'm so I'm so  I'm so\nI’m so I'm so I'm so I'm so I'm so  proud of you\nI’m so I'm so I'm so I'm so I'm so  proud of you\nI’m so I'm so I'm so I'm so I'm so  proud of you\nEverything’s adding up, you’ve been through hell and back\nThat's why you're bad as fuck and you know you are\n\n"}, {"title": "Lord Knows", "year": "2011", "album": "Take Care ", "writers": ["just blaze", "rick ross", "drake"], "artist": "drake", "lyrics": ""}, {"title": "Cameras", "year": "2011", "album": "Take Care ", "writers": ["40", "anthony palman", "drake"], "artist": "drake", "lyrics": "Word on road is the clique about to blow\nYou ain't gotta run and tell nobody they already know\nWe've been living on a high, they've been talking on the low\nBut it's cool, know you heard it all before\nThat's why I asked you how you mean, how you mean\nThought you knew about the team, (ay)\nThat's why I asked you how you mean, how you mean\nThought you knew about the team, (ay)\nHow you mean, how you mean, what you know about the team\nMan these niggas need to stop it they be crowding up the scene\nBaby girl you need to stop it -- all that pride and self esteem\nGot you angry about this girl I'm with in all them magazines\nBaby she look like a star, but only on camera\nOnly on camera, only on camera\nIt look like we in love, but only on camera\nOnly on camera, only on camera\nDon't listen to the lies, I swear they all lies\nYou know I could be your knight in shining Armor All tires\nTrying to tell you I'm the one, come and holla at me\nBefore I'm on the next ting, YMCMB (ah)\nOoh finally got you right here\nTonight I’ll ease your mind\nThat’s why I’m calling on you\nAnd ooh soft your loves desire\nIt’s hard to stay away\nYou keep me calling on you\nThat's why I asked you how you mean, how you mean\nThought you knew about the team, (ay)\nThat's why I asked you how you mean, how you mean\nThought you knew about the team, (ay)\nHow you mean, how you mean, what you know about the team\nYou just know what you get told girl I see behind the scene\nShe spilled whiskey on her shirt, she gonna have to get it cleaned\nShe been going way too hard, someone has to intervene\nBaby she look like a star, but only on camera\nOnly on camera, only on camera\nIt might look like I care, but only on camera\nOnly on camera, only on camera\nDon't listen to the lies, I swear they all lies\nYou know I could be your knight in shining armor all tires\nGirl, they love me like I'm Prince, like the new king with the crown\nBunch of underground kings, thought you knew how we get down (ah)\nOoh finally got you right here\nTonight I’ll ease your mind\nThat’s why I’m calling on you\nAnd ooh soft your loves desire\nIt’s hard to stay away\nYou keep me calling on you\nHow you mean, how you mean, thought you knew about the team (ay)\nHow you mean, how you mean, thought you knew about the team (ay)\n\nJust mail me my ring back, can't keep that shit.\n\n"}, {"title": "Good Ones Go (Interlude)", "year": "2011", "album": "Take Care ", "writers": ["the weeknd", "40", "drake"], "artist": "drake", "lyrics": "Oh yeah\nOh yeah, oh yeah, oh\nOh yeah, oh yeah, oh\nSummer's mine\nI swear I said it about a hundred times, I'ma need it back\nWish that you would come and find me\nJust to tell me that I haven't changed, girl, I needed that from you\nI'm gettin' money just taking care of me, girl\nI'm spendin' time just taking care of me right now\nI'm gettin' money just taking care of me, girl\n'Cause you'd be tired of taking care of me by now\nBut the good ones go\nThe good ones go, if you wait too long\nBut the good ones go\nThe good ones go, if you wait too long\nSo you should go\nYou should go, before you stay too long\nBut don't you go getting married, don't you go get engaged\nI know you're getting older, don't have no time to waste\nI shouldn't be much longer but you shouldn't have to wait\nCan't lose you, can't help it, I'm so sorry, I'm so selfish\nUh, uh, I've been chillin' in the city where the money's thrown high and the girls get down\nIn case you started to wonder why my new shit's sounding so H-Town\nBut when it's all done, baby, I'm yours if you're still around\nShe knows, she knows, she knows\nBut the good ones go\nThe good ones go, if you wait too long\nBut the good ones go\nThe good ones go, if you wait too long\nSo you should go\nYou should go, before you stay too long\n\n"}, {"title": "Doing It Wrong", "year": "2011", "album": "Take Care ", "writers": ["40", "drake"], "artist": "drake", "lyrics": "When a good thing goes bad it's not the end of the world\nIt's just the end of a world that you had with one girl\nAnd she's the reason it happened, but she's overreacting\nAnd it's all because she don't want things to change\nSo cry if you need to, but I can't stay to watch you\nThat's the wrong thing to do\nTouch if you need to, but I can't stay to hold you\nThat's the wrong thing to do\nTalk if you need to, but I can't stay to hear you\nThat's the wrong thing to do\nCause you'll say you love me, and I'll end up lying\nAnd say I love you, too\nBut I need someone different\nYou know it, oh ho, you know it\nOh ho, you know it, we both know it\nI need someone different\nYou know it, oh ho, you know it\nOh ho, you know it, we both know it\nSomething's been missing\nYou know it, oh ho, she knows it\nOh ho, I know it, we all know it\nI need someone different\n(Oh ho, oh ho)\nWe live in a generation of not being in love\nAnd not being together\nBut we sure make it feel like we're together\nBecause we're scared to see each other with somebody else\nSo cry if you need to, but I can't stay to watch you\nThat's the wrong thing to do\nTouch if you need to, but I can't stay to hold you\nThat's the wrong thing to do\nTalk if you need to, but I can't stay to hear you\nThat's the wrong thing to do\nCause you'll say you love me, and I'll end up lying\nAnd say I love you, too\nBut I need someone different\nYou know it, oh ho, you know it\nOh ho, you know it, we both know it\nI need someone different\nYou know it, oh ho, you know it\nOh ho, you know it, we both know it\nSomething's been missing\nYou know it, oh ho, she knows it\nOh ho, I know it, we all know it\nI need someone different\n(Oh ho, oh ho)\n"}, {"title": "The Real Her", "year": "2011", "album": "Take Care ", "writers": ["andré 3000", "40", "drake", "lil wayne"], "artist": "drake", "lyrics": "People around you\nShould really have nothing to say\nMe, I'm just proud of the fact\nThat you've done it your way\nAnd the weekend's here, started it right\nEven if you only get part of it right\nLive for today, plan for tomorrow\nParty tonight, party tonight\nDying to meet your girlfriends\nThat you said you might bring\nIf they're the ones that tell you\nThat you do the right thing, ooh\nHouston girls, love the way it goes down\nAtlanta girls, love the way it goes down\nVegas girls, love the way it goes down\nBut I gotta say\nOh, baby, oh baby, why is this so familiar?\nJust met her\nAlready feel like I know the real her\nYou musta done this before\nThis can't be your first time\nWe musta been here before\nIt's still fresh on my mind\nYou got that shit\nThat somebody would look for but won't find\nYou musta done this before\nThis can't be your first time\nThey keep telling me don't save you\nIf I ignore all that advice\nThen something isn't right\nThen who will I complain to?\nBut the weekend's here, started it right\nEven if I only get part of it right\nLive for today, plan for tomorrow\nParty tonight, party tonight\nYou got your guards up, I do too\nThere's things we might discover\nCause you got a past and I do too\nWe're perfect for each other\nHouston girls, love the way it goes down\nAtlanta girls, love the way it goes down\nVegas girls, love the way it goes down\nBut I gotta say\nOh, baby, oh baby, why is this so familiar?\nJust met her\nAlready feel like I know the real her\nYou musta done this before\nThis can't be your first time\nWe musta been here before\nIt's still fresh on my mind\nYou got that shit\nThat somebody would look for but won't find\nYou musta done this before\nThis can't be your first time\nYou musta done this before\nThis can't be your first time\nWe musta been here before\nIt's still fresh on my mind\nYou got that shit\nThat somebody would look for but won't find\nYou musta done this before\nThis can't be your first time\n"}, {"title": "Look What You’ve Done", "year": "2011", "album": "Take Care ", "writers": ["40", "chase n. cashe", "drake"], "artist": "drake", "lyrics": "It’s like ’09 in your basement\nAnd I’m in love with Nebby\nAnd I still love her but it fell through because I wasn’t ready\nAnd your back hurt and your neck hurt\nAnd you smoking heavy\nAnd I sit next to you and I lecture you\nBecause those are deadly\nAnd then you ash it and we argue\nAbout spending money on bullshit\nAnd you tell me I’m just like my father\nMy one button, you push it\nNow it's, \"Fuck you, I hate you, I'll move out in a heartbeat!\"\nAnd I leave out and you call me, you tell me that you sorry\nYou love me and I love you\nAnd your heart hurts, mine does too\nAnd it's just words and they cut deep\nBut it's our world, it's just us two\nI see painkillers on the kitchen counter\nI hate to see it all hurt so bad\nBut maybe I wouldn't have worked this hard\nIf you were healthy and it weren't so bad\nUh, maybe I should walk up the street\nAnd try and get a job at the bank\nCause leave it up to me, J, and Neeks\nWe'll probably end up robbing the bank\nThen Wayne calls up my phone\nConversation wasn't that long\nGets me a flight to Houston in the morning\nOh it's my time, yeah, it's on\nHe's thinking of signing me, I come home\nWe make a mixtape with 17 songs\nAnd almost get a Grammy off of that thing\nThey love your son—man, that boy gone\nYou get the operation you dreamed of\nAnd I finally send you to Rome\nI get to make good on my promise\nIt all worked out, girl, we shoulda known\nCause you deserve it\nIs this shit real? Should I pinch you?\nAfter all the things that we been through, I got you\nLook what you've done, look what you've done\nLook what you've done for me now\nYou knew that I was gonna be something\nWhen you're stressed out and you need something, I got you\nLook what you've done, look what you've done\nIt's like '06 in your backyard\nI'm in love with Jade\nAnd I'm still in love, 'cause when it's that real\nIs when it doesn't fade\nAnd my father living in Memphis now, he can't come this way\nOver some minor charges and child support\nThat just wasn't paid, damn\nBoo-hoo, sad story—black American dad story\nKnow that I'm your sister's kid\nBut it still don't explain the love that you have for me\nI remember sneaking in your pool after school dances\nDamn, your house felt like the Hamptons\nFor all of my summer romances\nI never really had no one like you man this all-new, shit\nMade the world I know bigger\nChanged the way that I viewed it\nHad all this fighting going on at the crib\nYou would calm me down when I lose it\nTold you I think I'm done acting\nI'm more in touch with the music\nYou said, either way, I'll be a star, I could go so far\nTalked to me, you got to me\nThen you’d toss the keys and loan me your car\nYeah, just a young kid in a drop top\nLexus hopin' that I don't get arrested\nJust another kid that's going through life\nSo worried that I won't be accepted\nBut I could do anything, you said that, and you meant that\nYou took me places, you spent that\nThey said no, we went back\nChecks bounced but we bounced back\nI put all the money in your accounts back\nAnd I thank you, I don't know where\nI'd really be without that, it worked out\nMan, you deserve it\nIs this shit real? Should I pinch you?\nAfter all the things that we been through, I got you\nLook what you've done, look what you've done\nLook what you've done for me now\nYou knew that I was gonna be something\nWhen you're stressed out and you need something, I got you\nLook what you've done, look what you've done\n"}, {"title": "HYFR", "year": "2011", "album": "Take Care ", "writers": ["kenza samir", "drake", "anthony palman", "t-minus"], "artist": "drake", "lyrics": "Gotta do what I gotta do, yeah\nAll my exes live in Texas like I'm George Strait\nOr they go to Georgia State where, tuition is handled\nBy some random nigga that live in Atlanta\nThat she only see when she feels obligated\nAdmitted it to me the first time we dated\nBut she was no angel, and we never waited\nI took her for sushi, she wanted to fuck\nSo we took it to go, told 'em don't even plate it\nAnd we never talk too much after I blew up\nJust only \"hello\" or a \"happy belated\"\nAnd I think I text her and told her I made it\nAnd that's when she text me and told me she prayed it\nAnd that's when I text her and told her I love her\nThen right after texted and told her I'm faded\nShe asked what have I learned since getting richer\nI learned workin' with the negatives could make for better pictures\nI learned Hennessy and enemies is one hell of a mixture\nEven though it's fucked up, girl I'm still fucking with ya\nDamn, is it the fall, time for me to revisit the past\nThere's women to call, there's albums to drop, there's liquor involved\nThere's stories to tell, we been through it all (Damn)\nInterviews are like confessions\nGet the fuck up out my dressing room, confusing me with questions like\nYeah, yeah, oh-yeah, oh-yeah\n\n"}, {"title": "Practice", "year": "2011", "album": "Take Care ", "writers": ["the weeknd", "adrian x", "40", "drake"], "artist": "drake", "lyrics": "Yeah, Cash money shit\nCash money shit\nI can tell that money's got you working\nWe've been talking for so long\nNow we're finally here in person\nI taste pain and regret in your sweat\nYou've been waiting for me, oh-ho\nI can tell that you been practicing\nI can tell that you been practicing\nAll those other men were practice, they were practice\nYeah, for me, for me, for me, for me\nGirl you look good, won't you back that ass up\nYou a fine motherfucker, won't you back that ass up\nCall me big daddy, won't you back that ass up\nGirl who is you playing with, back that ass up\nYou working with some ass yeah, you bad yeah\nGirl you working with some ass yeah, you bad yeah\nGirl you working with some ass yeah, you bad yeah\nMake a nigga spend his cash yeah, his last yeah\nHoes frown when you passed yeah, they mad yeah\nCouple thousand on your bag yeah, fuck yeah\nI'm a Big Tymer nigga yeah, money flipper yeah\nGet it understood yeah, it's all good yeah\nGirl I know it's real 'cause I've been around it\nYou only want what's real you just never found it\nDon't give them no more chances, ooh girl they had their turn\nEverything for a reason, there's things you had to learn from them\nBut when I get you to myself\nYou know what's going down, what's going down, oh\nGirl you look good, won't you back that ass up\nYou a fine motherfucker, won't you back that ass up\nCall me big daddy, won't you back that ass up\nGirl who is you playing with, back that ass up\nYou working with some ass yeah, you bad yeah\nGirl you working with some ass yeah, you bad yeah\nYeah, I know he messed up\nBut let a real nigga make it right\nLet a real nigga make it right, you deserve that much\nLet me put something in your life\nLet me put something in your life, put something in your life\nYou telling me it's only been a couple other people that you've been with\nI'ma trust you, I'ma give you the benefit of the doubt, and I'ma love you\nYou can even call me daddy, give you someone to look up to\nAll my girls from the 504 need to drop it right now\nNeed to drop it right now\nAll my girls from the 504 need to drop it right now\nNeed to drop it right now\nAll my girls from the 504 need to drop it right now\nNeed to drop it right now\nAll my girls from the 504 need to drop it right now\nNeed to drop it right now, oh\nAfter you back it up then stop\nAfter you back it up then stop\nBabygirl, after you back it up then stop\nAfter you back it up then stop\nI can tell that money's got you working\nThat your body's so wet\nAnd we're finally here in person\nI taste pain and regret in your sweat\nYou've been waiting for me, oh-ho\nI can tell that you been practicing\nI can tell that you been practicing\nAll those other men were practice, they were practice\nYeah, for me, for me, for me, for me\n\n"}, {"title": "The Ride", "year": "2011", "album": "Take Care ", "writers": ["the weeknd", "doc mckinney", "anthony palman", "drake"], "artist": "drake", "lyrics": "I hate when, I hate when people say they feel me man\nI hate that shit\nIt’ll be a long time before y'all feel me, if ever\nFor real\nYou won’t feel me 'till everybody\nSay they love you, but it’s not love\nAnd your suit is oxblood\nAnd the girl you fucking hates you\nAnd your friends faded off shots of\nWhat you ordered to forget about the game that you on top of\nYour famous girlfriend's ass keep getting thicker than a plot does\nAnd when you forget it, that's when she pop up\nAnd you got a drop but you ride around with the top up\nOr get three SUVs for niggas dressed like refugees\nAnd deal with the questions about all your excessive needs\nAnd you do dinners at French Laundry in Napa Valley\nScallops and glasses of Dolce, that shit's right up your alley\nYou see a girl and you ask about her\nBitches smiling at you, it must be happy hour\nThey put the cloth across your lap soon as you sat down\nIt’s feeling like you own every place you choose to be at now\nWalking through airport security with your hat down\nInstead of getting a pat down, they just keep on\nSaying that they feel you, nigga\nYou won't feel me til you want it so bad you tell yourself you’re in it\nAnd tell the world around you that your paperwork is finished\nAnd steal your mother's debit cards so you maintain an image\nAnd ride around in overpriced rental cars that ain't tinted\nYou need a minute? You got it\nYou know it's real when your latest nights are your greatest nights\nThe sun is up when you get home, that's just a way of life\nApartment 1503: some couches and paintings\nWhen you record with two others that want the same things\nIt start to feel better than home feels\nAnd so you up there every night, you swear you getting close\nThat champagne money was for gas and phone bills\nBut shit, you bout to spend it on what matters most\nYou drop a couple songs in hopes that you could be the nigga\nAnd come out every night to let the city see they nigga\nTelling stories that nobody relate to\nAnd even though they hate you\nThey just keep on telling you they feel you, nigga\nI haven't been inside Terminal 1 and 3 in so long\nI’m driving right up to it now\nMake sure you got your coat on\nThat runway can be cold especially after summer's rolled on\nAnd all you knew is alcohol and city lights and slow songs\nFor four months out the year, it's got you asking whats good at home\nWhat's good at home?\nThe same hoes are still at it, I shoulda known\nMy young niggas popping M’s and sipping dirty jones\nProblem children that all be repping October's Own\nBrand new girl and she still growing\nBrand new titties, stitches still showing\nYeah, and she just praying that it heals good\nI’m bout to fuck and I’m just praying that it feels good\nI really don’t know much but, shit, I know a secret\nThey say more money more problems, my nigga don’t believe it\nI mean, sure, there’s some bills and taxes I’m still evading\nBut I blew six million on myself and I feel amazing\nYoung money maker, season ticket holder\nSeason switching over\nI come through them bitches\nStill scorching as if I didn’t notice\nYou niggas getting older, I see no threat in Yoda\nI’m out here messing over the lives of these niggas\nThat couldn’t fuck with my freshman floater (flow ta)\nLook at that fucking chip on your nephew's shoulder\nMy sophomore, I was all for it, they all saw it\nMy juniors and senior will only get meaner\nTake care, nigga\n"}, {"title": "The Motto", "year": "2011", "album": "Take Care ", "writers": ["lil wayne", "drake", "t-minus"], "artist": "drake", "lyrics": "I'm the fuckin' man, y'all don't get it, do ya?\nType of money, everybody acting like they knew ya\nGo Uptown, New York City, bitch\nThem Spanish girls love me like I'm Aventura\nTell Uncle Luke I'm out in Miami, too\nClubbing hard, fucking women, there ain't much to do\nWrist bling, got a condo up in Biscayne\nStill getting brain from a thang, ain't shit changed\nHow you feel, how you feel, how you feel?\n25, sitting on 25 mill', uh\nI'm in the building and I'm feeling myself\nRest in peace, Mac Dre, I'ma do it for the Bay\nOkay, getting paid, we'll holler whenever that stop\nMy team good, we don't really need a mascot\nTell Tune, \"Light one, pass it like a relay\"\nYMCMB, you niggas more YMCA\nMe, Franny, and Mally Mall at the crib-o\nShout goes out to Niko, J and Chubbs, shouts to Gibbo\nWe got Santa Margherita by the liter\nShe know even if I'm fucking with her, I don't really need her\nAww, that's how you feel, man? That's really how you feel?\n'Cause the pimpin' ice cold, all these bitches wanna chill\nI mean maybe she won't but then again maybe she will\nI can almost guarantee she know the deal, real nigga, what's up?\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em 'cause the money in the way, real nigga, what's up?\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em 'cause the money in the way, real nigga, what's up?\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em 'cause the money in the way, real nigga, what's up?\n\n"}, {"title": "Hate Sleeping Alone", "year": "2011", "album": "Take Care ", "writers": ["40", "anthony palman", "drake"], "artist": "drake", "lyrics": "She says, \"Kiss me like you miss me\nFuck me like you hate me\nAnd when you’re fuckin' someone else\nJust fuck her like she ain't me\"\nDamn, those words are scary\nThose words are scary, Virgin Mary\nI just tell her to spare me\nI was in love two years ago and gave the baggage to my ex\nIt’s all for her to carry, bags she deserve to carry\nI hate that ho, I make it so hard just to talk, don’t I?\nI get off topic, don’t I? I get it poppin’, don’t I?\nI’ll end up stoppin', won’t I? And by the time I end up stoppin'\nYou’ll be rockin' one of the rings that you pointed out\nWhile shoppin' with a nigga, don’t lie\nShe’s losin' it right now\n'Cause if I wasn't who I am, she would've been movin' in by now\nBut instead we're movin' slow, I guess she's used to it by now\nAnd she gives me all her trust and I'm abusin' it right now\nBut this money comin' in is just confusin' shit right now\nYou just told me I ain't shit, I guess I'm provin' it right now\nI say I'd rather be with you, but you are not around\nSo I'ma call somebody up and see if they be down\n'Cause I hate sleepin' alone, I hate sleepin' alone\nHalf the time we don't end up fucking, I don't ask her for nothing\nYou leave me in the morning, I don't see her for months\nBut I just hate sleepin' alone, I hate sleepin' alone\nSo she’s here and we're both so gone\nHotel to hotel, girl, I could use your company\nFull name and birthday, I book a flight and you come to me\nBut she don't want a weekend, she wants all of me or none of me\nIf she can't work with all of me, then she says she done with me\nYou say that you over me, you always end up under me\nYou know how it goes: don't be crazy, don't play dumb with me\nDon't start with yo' shit, I put you back in your place\nShe tells me, \"I bet you won't, you won't say that to my face\"\nAnd hangs up, yeah, how dare you tell me it's tougher for you?\nLike I don't hear about the niggas you fucking with too?\nAnd whoever I be with, they got nothing on you\nThat's just something to do when there's nothing to do\nYeah, but she's losing it right now\nShe has choices she should make\nI think she's choosing it right now\nOne more chance to make it right, I think I'm using it right now\nYou just said I never learn, I guess I'm proving it right now\nI say I'd rather be with you, but you are not around\nSo I'ma call somebody up and see if they be down\n'Cause I hate sleepin' alone, I hate sleepin' alone\nHalf the time we don't end up fucking, I don't ask her for nothing\nYou leave me in the morning, I don't see her for months\nBut I just hate sleepin' alone, I hate sleepin' alone\nSo she’s here and we're both so gone\nOh, oh-oh\nShe is here and we're so gone\nOh\nOh, oh, oh\n\n"}, {"title": "The Motto (Remix)", "year": "2011", "album": "Take Care ", "writers": ["mally mall", "lil wayne", "drake", "t-minus"], "artist": "drake", "lyrics": "I'm the fuckin' man, y'all don't get it, do ya?\nType of money, everybody actin' like they knew ya\nGo Uptown, New York City, bitch\nThem Spanish girls love me like I'm Aventura\nTell Uncle Luke, \"I'm out in Miami, too\"\nClubbin' hard, fuckin' women, there ain't much to do\nWrist bling, got a condo up in Biscayne\nStill gettin' brain from a thang, ain't shit changed\nHow you feel how you feel how you feel?\n25, sitting on 25 mill\nI'm in the building and I'm feeling myself\nRest in peace, Mac Dre, I'm-a do it for the Bay\nOkay, getting paid, we'll holler whenever that stop\nMy team good, we don't really need a mascot\nTell Tune, \"Light one, pass it like a relay\"\nYMCMB, you niggas more YMCA\nMe, Franny, and Mally Mall at the crib-o\nShout goes out to Niko, J and Chubbs, shouts to Gibbo\nWe got Santa Margherita by the liter\nShe know even if I'm fuckin' with her, I don't really need her, aw\nThat's how you feel, man? That's really how you feel?\nCause the pimpin' ice cold, all these bitches wanna chill\nI mean maybe she won't but then again maybe she will\nI can almost guarantee she know the deal, real nigga, what's up?\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin' on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em cause the money in the way, real nigga, what's up?\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin' on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em cause the money in the way, real nigga, what's up?\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin' on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em cause the money in the way, real nigga, what's up?\n\n"}]