[{"title": "Fireworks", "year": "2010", "album": "Thank Me Later ", "writers": ["alicia keys", "boi-1da", "crada", "drake"], "artist": "drake", "lyrics": "Money just changed everything\nI wonder how life without it would go\nFrom the concrete who knew that a flower would grow\nLooking down from the top and it's crowded below\nMy fifteen minutes started an hour ago\nTruth over fame, you know I respect the blatant shit\nWhen I hear 'em talking, I just don't know what to make of it\nHate is so familiar to me, I'm slowly embracing it\nDoesn't come natural, bear with me, it could take a bit\nYeah and my dreams are who I'm racing with\nBut you can see I'm pacing it so that I'm always chasing it\nWayne put me right here, that's who I get the paper with\nI hope that my success never alters our relationship\nYeah, this life is something I would die for\nOctober's Own but it's looking like July 4\nI just wish they'd let you try it first\nThis time I'm really going off, fireworks\nOh, today it begins\nI've missed them before\nBut won't miss them again\nI keep having the same dream\nAnd I think that I just realized what it means\nI'm just such a gentleman, you should give it up for me\nLook at how I'm placing all my napkins and my cutlery\nI could tell it wasn't love, I just thought you'd fuck with me\nWho could've predicted Lucky Strike would have you stuck with me\nDamn, I kept my wits about me luckily\nWhat happened between us that night? It always seems to trouble me\nNow all of a sudden, these gossip rags want to cover me\nAnd you making it seem like it happened that way because of me\nBut I was curious\nAnd I'll never forget it, baby, what an experience\nYou could've been the one but it wasn't that serious\nThere was smoke in the air before, that was me clearing it\nThat felt good, all in all, I learned a lesson from it though\nYou never see it coming, you just get to see it go\nYeah, I should've looked up in the sky at first\nNow I can see it in her eyes, fireworks\nOh, today it begins\nI've missed them before\nBut won't miss them again\nI keep having the same dream\nAnd I think that I just realized what it means\nEverything's the same but it feels different\nMy dad called me up knowing that I still listen\nAnd he's still got his foot out, guilt tripping\nIt's been years though, I just learn to deal with it\nFor real, me and my realtor, we built up a better rapport\nGot my mother in a place with some better decor\nShe searched the entire city, I let her explore\nAnd now she's saying she's more lonely than ever before\nHow many of our parents marriages lasted?\nI was only 5, I bet I barely reacted\nI'm flying back home for the Heritage Classic\nSearching for that feeling, tell me where is the magic\nLet's stay together 'til we're ghosts\nI want to witness love, I never seen it close\nYeah, but I guess I gotta find it first\nThat's why I'm really going off, fireworks\nOh, today it begins\nI've missed them before\nBut won't miss them again\nI keep having the same dream\nAnd I think that I just realized what it means\n"}, {"title": "Karaoke", "year": "2010", "album": "Thank Me Later ", "writers": ["40", "francis and the lights", "drake"], "artist": "drake", "lyrics": "Things have been so crazy and hectic\nI shoulda gotten back by now\nBut you know how much I wanted to make it\nIt's probably better anyhow\nSo if you gotta go\nIf there's anything I should know\nIf the spotlight makes you nervous\nIf you're looking for a purpose\nYou put the tea in the kettle and light it\nPut your hand on the metal and feel it\nBut do you even feel it anymore?\nI remember when you thought I was joking\nNow I'm off singing karaoke\nFurther than I've ever been\nSo if you gotta go\nIf there's any way I can help\nIsn't it ironic that the girl I want to marry is a wedding planner\nThat tells me my life is too much and then moves to Atlanta\nDamn, of all the places you could go\nI just thought you'd choose somewhere\nThat had somebody that you know\nI'm always up too late, I worry 'bout you there alone\nIn that place you call your home, warm nights and cold Patron\nI hope you don't get known for nothing crazy\nCause no man ever wants to hear those stories bout his lady\nI know they say the first love is the sweetest\nBut that first cut is the deepest\nI tried to keep us together, you were busy keeping secrets\nSecrets you were telling everybody but me\nDon't be fooled by the money, I'm still just young and unlucky\nI'm surprised you couldn't tell\nI was only trying to get ahead\nI was only trying to get ahead\nBut the spotlight makes you nervous\nAnd you're looking for a purpose\nI was only trying to get ahead\nI was only trying to get ahead\nBut the spotlight makes you nervous\n\n"}, {"title": "The Resistance", "year": "2010", "album": "Thank Me Later ", "writers": ["boi-1da", "40", "oliver el-khatib", "drake"], "artist": "drake", "lyrics": "Yesterday when we were getting high\nYou were invited, you woulda liked it\nI-I- I know you all too well\nI said that we could kiss the past goodbye\nBut you weren't excited\nThere's no way to fight it\nYou can stay but shawty here I go\nShould I spend a weekend in Vegas?\nI'm living inside a moment, not taking pictures to save it\nI mean, how could I forget? My memory's never faded\nI can't relate to these haters, my enemies never made it\nI am still here with who I started with\nThe game needed life, I put my heart in it\nI blew myself up, I'm on some martyr shit\nCarry the weight for my city like a cargo ship\nI'm 23 with a money tree\nGrowing more too, I just planted a hundred seeds\nIt's ironic cause my mother was a florist\nAnd that's how she met my pops\nAnd now my garden is enormous\n\"It's happening, Penny Lane, just like you said!\"\nI avoided the coke game and went with Sprite instead\nUh-huh, that's word to the millions that they putting up\nI'm trying to do better than good enough\nWhat am I afraid of?\nThis is supposed to be what dreams are made of\nBut people I don't have the time to hang with\nAlways look at me and say the same shit\nThey say \"You promised me you would never change\"\n\"You promised me you would never change\"\nAm I wrong for making light of my situation? Clap on?\nWhen 40 got some shit for me to snap on, now that I'm on\nI don't really want to worry about getting back on\nI'm just trying to stay on, get my fucking buffet on\nI heard they just moved my grandmother to a nursing home\nAnd I be acting like I don't know how to work a phone\nBut hit \"redial\", you'll see that I just called\nSome chick I met at the mall that I barely know at all and\nPlus this woman that I messed with unprotected\nTexted saying she wished she would have kept it\nThe one that I'm laying next to just looked over and read it\nMan, I couldn't tell you where the fuck my head is\nI'm holding on by a thread\nIt's like I'm high right now, the guy right now\nAnd you could tell by looking in my eyes right now\nThat nothing really comes as a surprise right now\nCause we just having the time of our lives right now\nWhat am I afraid of?\nThis is supposed to be what dreams are made of\nBut people I don't have the time to hang with\nAlways look at me and say the same shit\nThey say \"You promised me you would never change\"\n\"You promised me you would never change\"\nI live by some advice this girl Lissa told me\nThe other day Lissa told me that she missed the old me\nWhich made me question when I went missing\nAnd when I started treating my friends different\nMaybe it was the fast paced switch up\nOr the two guns in my face during the stick up\nMaybe cause a girl I thought I trusted\nWas who set the whole shit up\nBut in fact I haven't seen them since they locked Big Rich up\nI know but same time I'm quick to forget\nI'm 'bout to roll me up a blunt with my list of regrets\nBurn it all, burn it all, I'm starting it fresh\nCause half the time I got it right I probably guessed\nDid I just trade free time for camera time?\nWill I blow all of this money baby, hammer time?\nYeah, I just need some closure\nAin't no turning back for me, I'm in it 'til it's over\n\n"}, {"title": "Over", "year": "2010", "album": "Thank Me Later ", "writers": ["nick brongers", "40", "boi-1da", "drake"], "artist": "drake", "lyrics": "Uh, uh\nYoung Money\nYeah, yeah, yeah\nI know way too many people here right now\nThat I didn't know last year—who the fuck are y'all?\nI swear it feels like the last few nights\nWe've been everywhere and back\nBut I just can't remember it all\nWhat am I doing? What am I doing?\nOh yeah, that's right—I'm doing me, I'm doing me\nI'm living life right now, man\nAnd this what I'ma do 'til it's over, 'til it's over\nBut it's far from over\nAlright, bottles on me, long as someone drink it\nNever drop the ball, fuck are y'all thinking?\nMaking sure the Young Money ship is never sinking\nAbout to set it off in this bitch, Jada Pinkett\nI shouldn't have drove, tell me how I'm getting home\nYou too fine to be laying down in bed alone\nI could teach you how to speak my language, Rosetta Stone\nI swear this life is like the sweetest thing I've ever known\nAbout to go thriller, Mike Jackson on these niggas\nAll I need's a fucking red jacket with some zippers\nSuper good smidoke, a package of the Swisher's\nI did it overnight, it couldn't happen any quicker\n\"Y'all know them? Well, fuck it, me either\"\nBut point the biggest skeptic out, I'll make him a believer\nIt wouldn't be the first time I done it, throwing hundreds\nWhen I should be throwing ones, bitch, I run it\nI know way too many people here right now\nThat I didn't know last year—who the fuck are y'all?\nI swear it feels like the last few nights\nWe've been everywhere and back\nBut I just can't remember it all\nWhat am I doing? What am I doing?\nOh yeah, that's right—I'm doing me, I'm doing me\nI'm living life right now, man\nAnd this what I'ma do 'til it's over, 'til it's over\nBut it's far from over\nOne thing 'bout music: when it hits, you feel no pain\nAnd I swear I got this shit that make these bitches go insane\nSo they tell me that they love me\nI know better than that, it's just game\nIt's just what comes with the fame\nAnd I'm ready for that, I'm just saying\nBut I really can't complain, everything is kosher\nTwo thumbs up, Ebert and Roeper\nI really can't see the end getting any closer\nBut I'll probably still be the man when everything is over\nSo I'm riding through the city with my high beams on\nCan you see me? Can you see me? Get your Visine on\nY'all just do not fit the picture: turn your widescreen on\nIf you thinking I'ma quit before I die, dream on\nMan they treat me like a legend, am I really this cold?\nI'm really too young to be feeling this old\nIt's about time you admit it, who you kidding?\nMan nobody's ever done it like I did it, uh\nI know way too many people here right now\nThat I didn't know last year—who the fuck are y'all?\nI swear it feels like the last few nights\nWe've been everywhere and back\nBut I just can't remember it all\nWhat am I doing? What am I doing?\nOh yeah, that's right—I'm doing me, I'm doing me\nI'm living life right now, man\nAnd this what I'ma do 'til it's over, 'til it's over\nBut it's far from over\nYeah, that's right—I'm doing me, I'm doing me\nI'm living life right now, man\nAnd this what I'ma do 'til it's over, 'til it's over\nBut it's far from over\n\n"}, {"title": "Show Me a Good Time", "year": "2010", "album": "Thank Me Later ", "writers": ["kanye west", "no i.d.", "jeff bhasker", "drake"], "artist": "drake", "lyrics": "How did I end up right here with you?\nAfter all the things that I've been through?\nIt's been one of those days you try and forget about\nTake a shot and let it out, let's get right\nNow that I'm here, baby\nShow me a good time (aw yeah, aw yeah)\nShow me a good time (aw yeah, aw yeah)\nShow me a good—show me a good\nShow me a good time (aw yeah, aw yeah)\nI live for the nights that I can't remember\nWith the people that I won't forget\nSpending all the money that I just worked my ass off for\nDoing things that I won't regret\nI've been waiting way too long, long, long, long\nTelling everybody that I know we about to be on, on, on, on\nI ain't trying to look like I lied to these niggas\nThat I came up with, that's my team\nNever would I let a woman come between\nWhat we doing right now, this our dream\nWu-Tang Clan, niggas want that cream\nI'm the Osiris to this shit right now\nGo-to guy for the hits right now\nWhatever you wanna drink girl, pick right now\nIf you can't hold your liquor, better quit right now\nHow did I end up right here with you?\nAfter all the things that I've been through?\nIt's been one of those days you try and forget about\nTake a shot and let it out, let's get right\nNow that I'm here, baby\nShow me a good time (aw yeah, aw yeah)\nShow me a good time (aw yeah, aw yeah)\nShow me a good—show me a good\nShow me a good time (aw yeah, aw yeah)\nYeah, uhh\nHow about you and all your morals\nIn that outfit that you borrowed?\nMake the most out of tonight\nAnd worry bout it all tomorrow\nUnderstand girl, we fam girl\nCan't get me right and not do Wayne\nCash Money, Young Money, pop champagne\nPresidential suite, girl: Barack Hussein\nTell me can we kick it like Ali Shaheed and Phife Dawg?\nPeople really hate it when a backpack rapper\nGet rich and start living that life, dawg\nFeels like when you get into that paper, hip hop hates you\nThey would do it just like I do it if they could\nIt's in our nature—young and rich and out of control\nOut in LA blowing clouds of the killa\nI came up in the underground though\nSo I'mma spend another $10,000 for Dilla\nCall me overrated or created or too jaded\nBecause anyway you put it, bitch, I made it—Yup!\nHow did I end up right here with you?\nAfter all the things that I've been through?\nIt's been one of those days you try and forget about\nTake a shot and let it out, let's get right\nNow that I'm here, baby\nShow me a good time (aw yeah, aw yeah)\nShow me a good time (aw yeah, aw yeah)\nShow me a good—show me a good\nShow me a good time (aw yeah, aw yeah)\n\n"}, {"title": "Up All Night", "year": "2010", "album": "Thank Me Later ", "writers": ["boi-1da", "drake", "nicki minaj", "matthew burnett"], "artist": "drake", "lyrics": "Kush rolled, glass full: I prefer the better things\nNiggas with no money act like money isn't everything\nI'm havin' a good time, they just trying to ruin it\nShout out to the fact that I'm the youngest nigga doing it\nCap on, brim bent, Denzel, every time\nShe ain't tryna pop that shit for pimp; okay, well nevermind\nI-I-I tried to told you, Drizzy still ain't nothin' nice\nBracelet saying \"you should quit\", cars saying \"fuck your life\"\nOkay now we outta here, toodles to you bitches\nAnd if you dolled up, I got the voodoo for you bitches (yeah)\nI'm busy gettin' rich, I don't want trouble\nI made enough for two niggas, boy: stunt double\nFame is like a drug that I've taken too much of\nBut I never ever trip, just peace, happiness and love\nI got money in these jeans, so they fit me kinda snug\nPlus the game is in my pocket, nigga this is what I does\nI'm about whatever man, fuck what they be talkin' about\nThey opinion doesn't count, we the only thing that matters\nAww, so we do it how we do it\nAll up in your face man, I hate to put you through it\nI be up all night, whole crew's in here\nCause I don't really know who I'ma lose this year\nAww, man I love my team\nMan I love my team, I would die for them niggas, aww\nI'm about whatever man, fuck what they be talkin' about\nThey opinion doesn't count, we the only thing that matters\nAww, so we do it how we do it\nAll up in your face man, I hate to put you through it\nI be up all night, whole crew's in here\nCause I don't really know who I'ma lose this year\nAww, man I love my team\nMan I love my team, I would die for them niggas, aww\nI'm about whatever man, fuck what they be talkin' about\nThey opinion doesn't count, we the only thing that matters\nAww, so we do it how we do it\nAll up in your face man, I hate to put you through it\nI be up all night, whole crew's in here\nCause I don't really know who I'ma lose this year\nAww, man I love my team\nMan I love my team, I would die for them niggas, aww\n\n"}, {"title": "Fancy", "year": "2010", "album": "Thank Me Later ", "writers": ["mary j. blige", "drake", "swizz beatz", "t.i."], "artist": "drake", "lyrics": "Uh, you getting ready so I know we gon' be here awhile\nIn the bathroom flat irons and nail files\nSpending hours in salons on your hairstyles\nIn the mall steady racking up the air miles\nHit the gym, step on the scales, stare at the number\nYou say you droppin' 10 pounds preparin' for summer\nAnd you don't do it for the man, men never notice\nYou just do it for yourself, you're the fucking coldest\nIntelligent too, ooh you're my sweetheart\nI've always liked my women book and street smart\nLong as they got a little class like half days\nAnd the confidence to overlook my past ways\nTime heals all and heels hurt to walk in\nBut they go with the clutch that you carry your lip gloss in\nAnd look, I really think nobody does it better\nI love the way that you put it together, uh\nUh, 5 and a half in boys, ass is off the hook\nCinderella 'bout to lose the glass off her foot\nAnd when I find it is when I find you\nAnd we can do the things we never got the time to\nBetter late than never but never late is better\nThey tell me time is money, well we'll spend it together\nI'm down for whatever, you just lead the way\nWe go to dinner you don't even look at me to pay\nMature women with more than me were the first to tempt me\nAnd Jason had this girl Tammy with a purple Bentley\nHow she got it I ain't never get to ask\nI just knew that she was fine like a ticket on the dash\nYeah, but shout out to the homeowners\nThe girls that got diplomas and enough money to loan us\nA little something extra, should we ever need it\nIf it sounds like you, then let me hear you repeat it\n"}, {"title": "Shut It Down", "year": "2010", "album": "Thank Me Later ", "writers": ["the-dream", "omen", "sidney “omen” brown", "drake"], "artist": "drake", "lyrics": "Hey, oh-oh\nThese girls ain't got nothing on you\nUh, say baby, I had to mention\nThat if you were a star, you'd be the one I'm searching for\nOther girls they, they got attention\nBut I just always feel like they're in need of something you got\nIt's obvious you're pretty\nHeard that you're a student working weekends in the city\nTryna take you out girl, hope you're not too busy\nAnd if there's nothing wrong, got this little song\nFor you to get ready to, put those fucking heels on and work it girl\nLet that mirror show you what you're doing\nPut that fucking dress on and work it kind of vicious\nLike somebody's taking pictures\nShut it down (Aye) down (Aye) down (Aye)\nYou would shut it down (Aye) down (Aye) down (Aye)\nYou'd be the baddest girl around (Aye) 'round (Aye) 'round (Aye)\nAnd they'd notice, they'd notice\nYou would shut it down (Aye) down (Aye) down (Aye)\nYou would shut it down (Aye) down (Aye) down (Aye)\nYou'd be the baddest girl around (Aye) 'round (Aye) 'round (Aye)\nAnd they'd notice, they'd notice\nYou would shut it—\nThe way I’m feeling, the things I say\nAll just happen, when you pass my way\nWhat can I do, to make you stay?\nI know it’s getting late, but girl, I don’t want you to leave\nYou tell me you’re just not the type, you wanna do this right\nAnd I’m not tryna say I don’t believe you\nBut I refuse to feel ashamed, and if you feel the same\nDoes waiting really make us better people?\nTake them fucking heels off, it’s worth it girl\nNothing is what I can picture you in\nSo take that fucking dress off, I swear you won’t forget me\nYou’ll be happy that you let me\nLay you down, down, down\nI’m tryna lay you down, down, down\nYou still the baddest girl around, 'round, 'round\nThey'd notice, they'd notice\nLet me lay you down, down, down\nTryna lay you down, down, down\nYou still the baddest girl around, 'round, 'round\nAnd they'd notice, they'd notice\nYou would shut it\n\n"}, {"title": "Unforgettable", "year": "2010", "album": "Thank Me Later ", "writers": ["static major", "drake", "r. kelly", "jeezy"], "artist": "drake", "lyrics": "Uhh, yeah\nThis is really one of my dumbest flows ever, I haven’t slept in days\nAnd me and my latest girl agreed to go our separate ways\nSo I’m single, thinkin' 'bout what we had and missin' you\nBut I ain't Santa, I got somethin' for these bad bitches too\nI mean paparazzi on me, tryin' not to get caught out\nThey always seem to catch me with the woman that I brought out\nBaby don’t hold on too long cause that’s how them stories start out\nAnd all the girls that played me eat your muthafuckin' heart out\nIt's Drizzy, always gone but never hard to find\nAnd since you can’t escape me, do I ever cross your mind?\nBecause all this shit is new to me, I’m learnin' to behave\nAnd still spendin' every dollar they encourage me to save\nBut I’m good, I know that niggas would kill for this lifestyle\nI’m lookin' forward to the memories of right now\nNever forgettin' from where I came\nAnd no matter where I’m headed, I promise to stay the same\nI'm just\n"}, {"title": "Light Up", "year": "2010", "album": "Thank Me Later ", "writers": ["tone mason", "40", "jay-z", "drake"], "artist": "drake", "lyrics": "Uh, I've been up for four days, gettin' money both ways\nDirty and clean, I could use a glass of cold Spades\nRolexes, chauffers and low fades\nI keep thinkin', how young can you die from old age?\nThey always tell me: \"Nobody's workin' as hard as you\"\nAnd even though I laugh it off, man, it's probably true\n'Cause while all of my closest friends out partyin'\nI'm just here makin' all the music that they party to\nBut party on, party on all night, nigga\nI got these new rappers nervous: prom night, nigga\nI grow tired of these fuckin' grown man liars\nStorytellers, they ain't even need a campfire\nUh, but I just want to tell the truth\nBefore one of these haters load a couple shells and shoot\nThe shit feel like when Fredro Starr\nWas in Sunset Park stuntin' hard in his yellow goose - yeah!\nAnd I'm a motherfuckin' missed target\nBut a target nonetheless, and I just started\nWas that directed at moi? Can't be\nThey must be talkin' to themselves, Hov: hands free\nYeah, and I'm just fillin' up this daily planner\nGettin' busy 'cause I'm a star: no spangled banner\nJealous dudes get to talkin' in they music\nAnd I just say I wrote it for your girlfriends: Kelsey Grammer\nYeah, that's what life becomes when you're doin' you\nWelcome to Hollywood, don't let this town ruin you\nAnd if you pillow-talkin' with the women that are screwin' you\nJust know that she gon' tell another nigga\nWhen she through with you\nDon't get impatient when it takes too long\nDrink it all, even when it tastes too strong\nYeah, I got to feel alive, even if it kills me\nPromise to always give you me, the real me\nWho would've thought I'd be caught in this life?\nLet's celebrate with a toast and get lost in tonight\nAnd make it all light up\nWait until the sun goes down\nWe gon' make this bitch light up\nEven when the sun goes down I'ma make it go\n\n"}, {"title": "Miss Me", "year": "2010", "album": "Thank Me Later ", "writers": ["doug edwards", "bun b", "drake", "dave richardson"], "artist": "drake", "lyrics": "Yeah, girl, it's on\nYou know what it is when I finally make it home\nI just hope that you miss me a little when I'm gone\nYeah I just hope that you miss me a little when I'm gone\nAnd you just tell me what you down for, anything you down for\nI know things have changed, know I used to be around more\nBut you should miss me a little when I'm gone\nI just hope that you miss me a little when I'm gone, gone, gone\nYeah, girl, it's on\nYou know what it is when I finally make it home\nI just hope that you miss me a little when I'm gone\nYeah I just hope that you miss me a little when I'm gone\nAnd you just tell me what you down for, anything you down for\nI know things have changed, know I used to be around more\nBut you should miss me a little when I'm gone\nI just hope that you miss me a little when I'm gone, gone, gone\nUh, yeah, forever in our hearts\nJJ, we love you boy—H-Town!\nI’m gone, I’m gone, when I’m gone\nI’m gone, I’m gone, when I’m gone\nI just hope that you miss me, miss me\nMiss me, miss me\nMiss me a little when I’m gone\nMiss me a little when I’m gone, gone, gone\nOh-whoa, oh-whoa, oh-whoa\n\n"}, {"title": "Cece’s Interlude", "year": "2010", "album": "Thank Me Later ", "writers": ["adrian x", "40", "drake"], "artist": "drake", "lyrics": "All night I've, been staring, can you tell I want you?\nCan't be too, wide open, there's nothing, I won't do\nOh, just thought you should know\nThat's when you start to laugh\nSaying I just want what I can't have\nWon't even give me a chance\nClaiming I'm just not as serious as you\nShorty if you only knew, this is serious\nI wish I, wasn't famous\nI wish I, was still in school\nSo that I could have you in my dorm room\nI would put it on you, crazy\nThat's when you start to laugh\nSaying I just want what I can't have\nWon't even give me a chance\nClaiming I'm just not as serious as you\nShorty if you only knew, this is serious\nUp all night\nUp all night\nUp all night\nUp all night\nUp all night\nUp all night\nUp all night\n\n"}, {"title": "Find Your Love", "year": "2010", "album": "Thank Me Later ", "writers": ["plain pat", "no i.d.", "jeff bhasker", "drake"], "artist": "drake", "lyrics": "I'm more than just an option (Hey, hey, hey)\nRefuse to be forgotten (Hey, hey, hey)\nI took a chance with my heart (Hey, hey, hey)\nAnd I feel it taking over\nI better find your loving, I better find your heart\nI better find your loving, I better find your heart\nI better find your loving, I better find your heart\nI bet if I give all my love then nothing's gonna tear us apart\nI'm more than just a number (Hey, hey, hey)\nI doubt you'll find another (Hey, hey, hey)\nSo every single summer (Hey, hey, hey)\nI'll be the one that you'll remember and—\nI better find your loving, I better find your heart\nI better find your loving, I better find your heart\nI better find your loving, I better find your heart\nI bet if I give all my love then nothing's gonna tear us apart\nIt's more than just a mission (Hey, hey, hey)\nYou hear, but you don't listen (Hey, hey, hey)\nYou better pay attention (Hey, hey, hey)\nAnd get what you've been missing\nI better find your loving, I better find your heart\nI better find your loving, I better find your heart\nI better find your loving, I better find your heart\nI bet if I give all my love then nothing's gonna tear us apart\nToo many times I've been wrong\nI guess being right takes too long\nI'm done waiting, there's nothing left to do\nBut give all I have to you and\nI better find your loving, I better find your heart\nI better find your loving\nI bet if I give all my love then nothing's gonna tear us apart\nI bet if I give all my love then nothing's gonna tear us apart\n\n"}, {"title": "Thank Me Now", "year": "2010", "album": "Thank Me Later ", "writers": ["timbaland", "drake"], "artist": "drake", "lyrics": "You could thank me now, go 'head\nThank me later, yeah I know what I said\nBut later doesn't always come so instead\nIt's okay, you could thank me now\nMahalo from the hardest act to follow\nLately I've been drinking like there's a message in a bottle\nAlohas to women with no ties to men\nThat I know well, that way there are no lies\nYou can thank me now for all the info I give to you niggas\nI'm on the brink of influential, I'm here for you niggas\nI guess a hit doesn't add up to a career for you niggas\nI must have been hard to watch, what a year for you niggas\nIt's December 31st and we in Miami just meditating\nYou got your resolutions, we just got reservations\nLiving out a dream it feels like I stayed up\nAnd we just want to party, Patron straight up\nFuck that old shit, I'm on new things\nOVO Clique, Red Wing Boot Gang\nYeah we want it all, half was never the agreement\nWho would have thought the route we'd chosen\nWould ever end up this scenic?\nI can relate to kids going straight to the league\nWhen they recognize that you got what it takes to succeed\nAnd that's around the time\nThat your idols become your rivals\nYou make friends with Mike\nBut got to A.I. him for your survival\nDamn, I swear sports and music are so synonymous\nCause we want to be them, and they want to be us\nSo on behalf of the demanded and the entertainment\nThat you take for granted, you can thank me now\nAnd oh my goodness you're welcome, you're welcome\nAt this point me is who I am trying to save myself from\nRappers hit me up and I never know what to tell them\nCause they think that I can help them\nGet back to where they fell from\nBut drink up, cause everyone here is good tonight\nExcept the niggas that I came with, they good for life\nThat's how you know it's going down\nIn case another chance never comes around\nYou could thank me now, go 'head\nThank me later, yeah I know what I said\nBut later doesn't always come so instead\nIt's okay, you could thank me now\nShallow nigga but deep enough to have gone swimming\nI think I'm spending all my time with the wrong women\nI think I'll have a chance at love and knowing me I'll miss it\nCause me dedicating my time just isn't realistic\nMan, the good girls went silent on me\nThey got a boyfriend, or left for college on me\nAnd all the bad ones I used to hit are friends now\nThat make me wish I had a little less mileage on me\nBut do I ever come up in discussion\nOver double pump lattes and low fat muffins?\nDo I? Or is missing what we had out of the question?\nI'm probably just the reason that you learned your lesson\nI got flows for the Marilyn Monroes\nWho was there before it all, I guess that's how it goes\nThey hear about your cons, but focus on your pros\nAnd love you for who you are from the bottom of their soul\nBut those same ones from your area will grow into women\nThat are ready to get married at hello\nBecause of what they allowed, where are they all now?\nI know they're somewhere watching\nSo I'm trying to make them proud\nSearching for the meaning, you'll find it next to me\nThey tell me I'm the hottest, guess we finally get to see\nI'm feeling like Nas, who am I to disagree?\nThey say the doors will open up\nSoon as you find the missing key\nThat's probably why I'm in this bitch shining\nJump up in the sky and put the stars into alignment\nI rep the ATF in case you need to be reminded\nAnd the bandwagon's full\nBut you can try and run behind it, I'm sorry\nPoolside drinking, Margarita rounds\nShout out to my city though I hardly be in town\nI'm the black sheep but Chris Farley wears the crown\nAnd I know life is just a game\nIn which the cards are facing down\nI'm in a world where things are taken, never given\nHow long they choose to love you will never be your decision\nAnd I'm aware that this could be the last time you listen\nSo while I'm still here in this position\nYou could thank me now, go 'head\nThank me later, yeah I know what I said\nBut later doesn't always come so instead\nIt's okay, you could thank me now\n\n"}, {"title": "9AM in Dallas", "year": "2010", "album": "Thank Me Later ", "writers": ["drake"], "artist": "drake", "lyrics": "These are my One St. Thomas flows\nMe, my niggas and some Madonna hoes\nThat look just like virgins but trust they down to go\nDiscussing life and all our common goals\nSmart kids that smoke weed, honor roll\nLook how the champagne diamonds glow\nFine dining pour another glass when the wine is low\nI'm in the crib stacking money from here to the ceiling\nWhatever it is I got, it's clearly appealing\nThese other rappers getting that inferior feeling\nI hope you feel it in your soul, spiritual healing\nTake a look at yourself, the mirror's revealing\nIf you ain't got it, you ain't got it the theory is brilliant\nPeople ask how music is going, I heard it pays\nI just came off making two million in 30 days\nDamn, \"I guess it does\" is what the message was\nSometimes I feel I be spending my money just because\nWith Weezy I'm just out here repping us\n'til I get to shake the hand of the man that's blessing us\nYeah, I know these niggas miss the mean lyrics\nKush got the room smelling like teen spirit\nI ask kindly if no one out here would bring defeat up\nUntil I lose, for now I'm the game's single leader\nI fly private so no one tells me to bring my seat up\nAnd book a suite where me and your favorite singer meet up\nWho you like, tell me who it is\nI'mma make sure that that woman is the next one on my list\nI should call it a night, but fuck it I can't resist\nThis one is for all the niggas from my city trying to diss\nWithout a response from me you really fail to exist\nAnd I love to see you fail, that feeling there is the shit\nI swear, pussy nigga get your bread up\nEnjoy the seat that the stewardess just forced your ass to let up\nWhy your scary ass looking down, pick ya head up\nNo one told you your disguise was the most ridiculous get-up?\nWith nose-plugs in now, I can smell the set-up\nSo you just wasting your time, you only making me better, yeah\nI try to tell them don't judge me because you heard stuff\nChase N. Cash that's my brother from the Surf Club\nDamn, that nigga always kept it so hood\nBack when we would smoke good at the Oakwoods\nAnd have girls fall through like coins in the couch\nNow we just fucking all the bitches they warned us about\nScared for the first time, everything just clicked\nWhat if I don't really do the numbers they predict?\nConsidering the fact that I'm the one that they just picked\nTo write a chapter in history, this shit has got me sick\nBut if I really do it don't expect to get a split\nCause this truly is some shit I don't expect for y'all to get\nI'm nervous but I'mma kill it cause they 'bout to let the realest team in\nThrowing up in the huddle nigga, Willie Beamen\nBut still throwing touchdown passes\nIn tortoise frame glasses, hopin' that someone catch it\nPeople say that old Drake, we startin' to miss it\nBut they need to be a little more specific\nIs this what y'all want? In my best Chris Tucker impression\nDucking your questions, fuck your suggestions\nMoney gets all of my love and affection\nCars all black like the cover of Essence\nI'm allergic to coming in second but I never sneeze\nY.M.O.E. nigga, yeah\nUh, yeah, this what yall want\nOctobers Very Own\nYoung Money\nATF\nThank me later in this bitch wasssup\nFree Weezy in this bitch wasup\nJune 15th in this bitch wasup\nNoel That’s it Ahhhhhh\n\n"}, {"title": "Thank Me Later [Booklet]", "year": "2010", "album": "Thank Me Later ", "writers": ["drake"], "artist": "drake", "lyrics": ""}]