[{"title": "Intro (2014 Forest Hills Drive)", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Do you wanna, do you wanna be\nDo you wanna, do you wanna be\nDo you wanna, do you wanna be, free\nDo you wanna, do you wanna be, happy\nDo you wanna, do you wanna be, happy\nDo you wanna be, happy\nDo you wanna, do you wanna be, happy\nI said do you wanna, do you wanna be, happy\nI said do you wanna, do you wanna be, free\nI said do you wanna, do you wanna be happy\nI said do you wanna, do you wanna be, free\nFree from pain, free from scars\nFree to sing, free from bars\nFree my dawgs, you're free to go\nBlock is hot, the streets is cold\nFree to love, to each his own\nFree from bills, free from pills\nYou roll it loud, the speakers blow\nLife get hard, you ease your soul\nIt cleanse ya mind, learn to fly\nThen reach the stars, you take the time\nTo look behind and say, \"Look where I came\nLook how far I done came\"\nThey say that dreams come true\nAnd when they do, that there's a beautiful thing\nNow do you wanna, do you wanna be happy?\nI said do you wanna, do you wanna be free\nI said do you wanna, do you wanna be\n\n"}, {"title": "January 28th", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["yumi matsutoya", "j. cole", "j cole", "kunihiko murai"], "artist": "j cole", "lyrics": "Rap tune\nCan I make a million dollars off a rap tune?\nCan I make a million dollars off a rap tune?\nI'm tryna make a million dollars off a rap tune\nYeah, look\nThe real is back, the ville is back\nFlow bananas, here, peel this back\nAnd what you'll find is, your highness\nCan paint a picture that is vivid enough to cure blindness\nCarolina's finest, you knew that already\nIn terms of the greatest, I proved that already\nAnd if you would like, I do it twice\nI just sharpen my blade, for a minute became lost in my ways\nThis for my niggas that was tossed in the graves\nEvery so often I fade deep in my thoughts\nAnd then get lost in the days\nWe used to play before your coffin was made\nJust got the call nigga got caught with a stray\nHope he's okay\nJust got paid what Cochran got paid to free OJ\nJust to share my life on the stage in front of strangers\nWho know a nigga far too well, and that's the danger\nKnow me better than I know myself\nI rip a page out my notebook in anger\nAnd let these thoughts linger, singing\nDon't give 'em too much you (Don't give 'em too much you)\nDon't let 'em take control (Don't let 'em take control)\nIt's one thing you do (It's one thing you do)\nDon't let 'em taint your soul (Don't let 'em taint your soul)\nIf you believe in God (If you believe in God)\nOne thing's for sure (One thing's for sure)\nIf you ain't aim too high (If you ain't aim too high)\nThen you aim too low (Then you aim too low)\nWhat's the price for a black man life?\nI check the toe tag, not one zero in sight\nI turn the TV on, not one hero in sight\nUnless he dribble or he fiddle with mics\nLook out the window 'cause tonight the city lit up with lights\nCameras and action\nMay no man alive come through and damage my faction\nI brought you niggas with me 'cause I  love you like my brothers\nAnd your mothers' like my mother\nThink we need a plan of action\nThe bigger we get the more likely egos collide, it's just physics\nPlease let's put our egos aside, you my niggas\nAnd should our worst tendencies turn us into enemies\nI hope that we remember these\nNights full of Hennessy\nWhen Hov around we switch up to that D'usse\nGotta show respect, one day we tryna stay where you stay\n'Cause we from where you from\nNot talkin' bout the slums\nI'm talkin' 'bout that mind state that keep a black nigga dumb\nKeep a black nigga dyin' by a black nigga gun\nAnd keep on listening to the frontin' ass rap niggas son\nYeah I said 'son'\nThis is New York's finest\nFor 11 winters straight I took on New York's climate\nLike show me New York's ladder\nI climb it and set the bar so high that you gotta get Obama to force the air force to find it\nNever mind it, you'll never reach that\nCole is the hypnotist, control the game whenever he snap\nThat's every track, nigga\nDon't give 'em too much you (Don't give 'em too much you)\nDon't let 'em take control (Don't let 'em take control)\nIt's one thing you do (It's one thing you do)\nDon't let 'em taint your soul (Don't let 'em taint your soul)\nIf you believe in God (If you believe in God)\nOne thing's for sure (One thing's for sure)\nIf you ain't aim too high (If you ain't aim too high)\nThen you aim too low (Then you aim too low)\nI ain't serve no pies, I ain't slang no dope\nI don't bring no lies, niggas sang my quotes\nI don't play no games, boy I ain't no joke\nLike the great Rakim, when I make my notes\nYou niggas might be L or you might be Kane\nOr you might be Slick Rick with 19 chains\nOr you might be Drizzy Drake or Kendrick Lamar\nBut check your birth date nigga, you ain't the god\nNah you ain't the god\nNigga, Cole the god (Cole the god, Cole the god)\nJanuary 28th\nMake a million dollars off a rap tune\nCan I make a million dollars off a rap tune?\n(*sound of baby laughing*)\nI'm tryna make a million dollars off a rap tune\nI wanna make a million dollars off a rap tune\nI'm gonna make a million dollars off a rap tune\n\n"}, {"title": "Wet Dreamz", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["roy c", "j. cole", "chaz wesley", "j cole"], "artist": "j cole", "lyrics": "Cole, Cole world, yeah\nLet me take y'all back, man\nAs I do so well\nWasn't nothin' like that\nMan, it wasn't nothin' like that first time, she was in my math class\nLong hair, brown skin with a fat ass\nSat beside me, used to laugh, had mad jokes\nThe teacher always got mad so we passed notes\nIt started off so innocent\nShe had a vibe and a nigga started diggin' it\nI was a youngin, straight crushin', tryna play the shit cool\nBut a nigga couldn't wait to get to school\n‘Cause when I seen them thighs on her\nAnd them hips on her and them lips on her\nGot me daydreamin', man, what\nI'm thinkin' how she rides on it, if she sits on it, if she licks on it\nMake it hard for me to stand up\nAs time goes by, attractions gettin' deep and\nWet dreamin', thinkin' that I'm smashin' but I'm sleepin'\nI want it bad, and I ain't never been obsessed before\nShe wrote a note that said, \"You ever had sex before?\"\nDamn…\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, nooo\nI ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nI wrote back and said\n\"Of course I had sex before,\" knowin' I was frontin'\nI said, \"I'm like a pro, baby,\" knowin' I was stuntin'\nBut if I told the truth, I knew that I'd get played out, son\nHadn't been in pussy since the day I came out one\nBut she don't know that, so she done wrote back and told me\n\"Oh, you a pro, homie? Well, I want you to show me\nMy mama gone for the weekend\nSo Saturday, baby, we can get to freakin'.\"\nThat's when my heart start racin' and my body start sweatin'\nBaby, you done woke my lil' man up\nI'm thinkin' how that body look naked when you layin' on the bed\nTeacher, please, don't make me stand up\nI wrote back like, \"Yeah, baby, sound like a plan.\"\nStill tryna play it cool, sound like the man\nBut I was scared to death, my nigga, my stomach turnin'\nTalkin' shit, knowin' damn well I was a virgin\nFuck…\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, nooo\nI ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nYou know that feelin' when you know\nYou finna bone for the first time?\nI'm hopin' that she won't notice it's my first time\nI'm hopin' that my shit is big enough to fuck with\nAnd most of all I'm prayin', \"God, don't let me bust quick!\"\nI'm watchin' pornos, tryna see just how to stroke right\nPractice puttin' condoms on—how it go, right?\nI'm in her crib, now a nigga palms sweatin'\nWith a pocket full of rubbers and an erection\nThat's when my hands start touchin'\nAnd her face start blushin' and a nigga roll over on top\nAnd then she get my pants unbuckled\nAnd her hands start rubbin' on me, ooh girl, don't stop\nIt's time for action\nPull out the condoms real smooth, yeah, just how I practiced\nBut right before I put it in, she flinched and grabbed it\nAnd said, \"I wanna get somethin' off my mental\nI can tell you're a pro, but baby, be gentle, ‘cause—\"\n‘Cause I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, nooo\nI ain't never did this before, no\nAnd I ain't never did this before, no\nAnd I ain't never did this before, no\n\n"}, {"title": "03' Adolescence", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "johnny burke", "jimmy van heusen", "j cole"], "artist": "j cole", "lyrics": "I grew up, a fucking screw up\nTie my shoe up, wish they was newer\nDamn, need something newer\nIn love with the baddest girl in the city, I wish I knew her\nI wish I wasn't so shy, I wish I was a bit more fly\nI wish that I could tell her how I really feel inside\nThat I'm the perfect nigga for her, but then maybe that's a lie\nShe like a certain type of nigga and it's clear I'm not that guy\nBall player, star player, I'm just watchin' from the side\nOn the bench, 'cause my lack of confidence won't let me fly\nI ain't grow up with my father, I ain't thinkin' 'bout that now\nFast forward four years or so from now I'll probably cry\nWhen I realize what I missed, but as of now my eyes are dry\n'Cause I'm trying to stay alive\nIn the city where too many niggas die\nDreamin' quiet trying to dodge a suit and tie\nWho am I?\nAyy, who am I? (Yeah)\nThings change, rearrange and so do I\nIt ain't always for the better, dawg, I can't lie\nI get high 'cause the lows can be so cold\nI might bend a little bit but I don't fold\nOne time for my mind and two for yours\nI got food for your thoughts to soothe your soul\nIf you see my tears fall just let me be\nMove along, nothing to see\nI always did shit the hard way\nMy nigga [inaudible] slangin' in the hallway\nBurnt CD's and trees like this was Broadway\nTimes Square, kept the dimes there in the locker\nSome Reggie Miller\nWith more brown hairs than Chewbacca\nWhispers that he got it for the low-low, sell a\nDime for a dub, them white boys ain't know no better\nBesides, what's twenty dollars to a nigga like that?\nHe tell his pops he need some lunch\nAnd he gon' get it right back\nI peep game\nGot home snatched my mama keychain\nTook her whip, the appeal, too ill to refrain\nI hit the boulevard pull up to my nigga front do'\nHis mama at home, she still let 'em hit the blunt though\nI told her hello, and sat with my nigga and laughed\nAnd talked about how we gon' smash all the bitches in class\nI complimented how I see him out here getting his cash\nAnd just asked, \"What a nigga gotta do to get that?\nPut me on,\" he just laughed when he seen I was sure\n17 years breathing his demeanor said more\nHe told me, \"Nigga, you know how you sound right now?\nIf you wasn’t my mans\nI would think that you a clown right now\nListen, you everything I wanna be that's why I fucks with you\nSo how you looking up to me when I look up to you?\nYou bout to go get a degree, I'ma be stuck with two choices:\nEither graduate to weight or selling number two\nFor what? A hundred bucks or two a week?\nDo you think that you would know what to do if you was me?\nI got, four brothers, one mother that don't love us\nIf they ain't want us why the fuck they never wore rubbers?\"\nI felt ashamed to have ever complained about my lack of gear\nAnd thought about how far we done came\nFrom trailer park to a front yard with trees in the sky\nThank you mama, dry your eyes, there ain't no reason to cry\nYou made a genius and I, ain't gon' take it for granted\nI ain't gon' settle for lesser, I ain't gon' take what they handed\nNah, I'm gon' take what they owe me\nAnd show you that I can fly\nAnd show old girl what she missing, the illest nigga alive\nAyy, who am I?\nThings change, rearrange and so do I\n(Ayy, who am I?)\nIt ain't always for the better, dawg, I can't lie\n(Who am I?)\nI get high 'cause the lows can be so cold\nI might bend a little bit but I don't fold\nOne time for my mind and two for yours\nI got food for your thoughts to soothe your soul\nIf you see my tears fall just let me be\nMove along, nothing to see\nI never felt better\n\n"}, {"title": "A Tale of 2 Citiez", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "vinylz", "j cole"], "artist": "j cole", "lyrics": "Since a youngin' always dreamed of gettin' rich\nLook at me my nigga\nFantasize about a white picket fence\nWith some trees my nigga\nUsed to want a Pathfinder with some tints\nThat's all I need my nigga\nThrow some 20's on that bitch and get it rinsed\nBut now I see my nigga\nThat the world's a lot bigger ever since\nPicked up the paper\nAnd they say my nigga Eddie caught a body, I'm convinced\nAnybody is a killer, all you gotta do is push 'em to the limits\nFuck being timid in the Civic\nPoliticin' with the pushers and the pimps\nI'm tryna write a story, can I get a glimpse?\nYeah, can I get a glimpse?\nLast night I had a bad dream\nThat I was trapped in this city\nThen I asked is that really such a bad thing?\nThey robbin' niggas on the daily\nCan you blame a nigga that ain't never had things?\nGuess not! (What's the value of a thing?)\nLast night they pulled up on my nigga at the light like—\nUgh, nice watch, run it\nHands in the air now, hands in the air, run it\nHands in the air now, hands in the air, run it\nHands in the air now, hands in the air\nHands in the air now, hands in the air\nSmall town nigga Hollywood dreams\nI know that everything that glitters ain't gold\nI know the shit ain't always good as it seems\nBut tell me till you get it how could you know?\nHow could you know? How could you know?\nListen up I'm about to go and get rich\nFuck with me my nigga\nWe gon' circle round the Ville and hit a lick\nCop some tree my nigga\nAnd some powder, bag it up and make it flip\nYou gon' see my nigga\nOne day we gon' graduate and cop a brick\nAnd that's the key my nigga\nListen up I'm 'bout to go and get rich\nStand back and watch if you want to nigga\nMe I want my pockets fat, a badder bitch\nTired of seein' niggas flaunt, I wanna flaunt too nigga\nWatch some rollers in a fuckin' Crown Vic\nTryna lock a nigga up, that's what they won't do nigga\nWanna know a funny thing about this shit?\nEven if you let em' kill your dream\nIt'll haunt you nigga, haunt you\nLast night I had a bad dream\nThat I was trapped in this city\nThen I asked is that really such a bad thing?\nI look around like—\nDo you wanna be another nigga, that ain't never had things?\nGuess not! (What's the value of a thing?)\nLast night we pulled up on a nigga at the light like\n(You know what the fuck it is nigga, run that shit!)\nUh, nice watch, run it\nHands in the air now, hands in the air, run it\nHands in the air now, hands in the air, run it\nHands in the air now, hands in the air\nHands in the air now, hands in the air\nFather forgive me for my childish ways\nI look outside and all the clouds are gray\nI need your hands to take me miles away\nYour wish is my command, my command, my command\nBut before you go I've got to warn you now\nWhatever goes up surely must come down\nAnd you'll get your piece, but know peace won't be found\nSo why just take me man, take me man, take me man\nYour wish is my command, my command, my command\n\n"}, {"title": "Fire Squad", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Nigga why you actin' like a ho?\nKnow that I'ma ride for ya, either way it go\nTell me, girl why you be stressin' me for time?\nWhen you tell me you love me, can't you see I'm tryna climb?\nDamn my nigga why you actin' like a bitch?\nIf you scared to take a chance, how the fuck we gon' get rich?\nCome here baby why you always insecure?\nHold on tight to a nigga and be sure\nAin't a way around it no more, I am the greatest\nA lotta niggas sat on the throne, I am the latest\nI am the bravest, go toe to toe with the giants\nI ain't afraid of you niggas, I'll end up fading you niggas\n'Fore it's all said and done, this nigga need medicine\nMy uzi, it weighed a ton, I need me a better gun\nIn fact I just might need two, cause niggas say they the one\nAnd I got something to prove\nForgive me lord here they come, BLAOOW\nNigga why you actin' like a ho?\nKnow that I'ma ride for ya, either way it go\nTell me, girl why you be stressin' me for time?\nWhen you tell me you love me, can't you see I'm tryna climb?\nDamn my nigga why you actin' like a bitch?\nIf you scared to take a chance, how the fuck we gon' get rich?\nCome here baby why you always insecure?\nHold on tight to a nigga and be sure\nMy inhibition's fighting my intuition\nPremature premonition, showing me the demolition\nOf these phony niggas, so ahead of my time\nEven when I rhyme about the future I be reminiscing\nYou want the truth well come and listen\nI'm like that time you bagged a dime and checked ya phone and saw it was a number missing\nAs fate passes you by, half of you try\nThe other half of you fry, too high to actually fly\nOne day y'all have to decide, who you gon' be\nA scary nigga or a nigga that's gon' rule like me\nKeep it true like me, Cole you might be\nLike the new Ice Cube, meets the new Ice-T\nMeets 2 Live Crew, meets the new Spike Lee\nMeets Bruce like Wayne, meets Bruce like Lee\nMeets '02 Lil Wayne, in a new white tee\nMeets KD, ain't no nigga that can shoot like me!\nBLAOOOW!\nNigga why you actin' like a ho?\nKnow that I'ma ride for ya, either way it go\nTell me, girl why you be stressin' me for time?\nWhen you tell me you love me, can't you see I'm tryna climb?\nDamn my nigga why you actin' like a bitch?\nIf you scared to take a chance, how the fuck we gon' get rich?\nCome here baby why you always insecure?\nHold on tight to a nigga and be sure\n(Who's the king?)\nCame from the bottom nigga, with stains on my shirt\nWhat you expected from me, I came from the dirt\n(Who's the king?)\nMoney my motivator, the songs that I sing\nPicture a peasant passin' from pawn to a king\nYou tell me ya still love me, if so then let me go\nWill I return or will I burn, never know\nLook in my eyes and see the future\nBut don't sugar coat it\nListen...\nHistory repeats itself and that's just how it goes\nSame way that these rappers always bite each others flows\nSame thing that my nigga Elvis did with Rock n Roll\nJustin Timberlake, Eminem and then Macklemore\nWhile silly niggas argue over who gon' snatch the crown\nLook around, my nigga, white people have snatched the sound\nThis year I’ll prolly go to the awards dappered down\nWatch Iggy win a Grammy as I try to crack a smile\nI'm just playin', but all good jokes contain true shit\nSame rope you climb up on, they'll hang you with\nBut not Jermaine, my aim too sick\nI bang nigga, I came to bring the pain my brain too quick\nYou see how I maneuver this game, I ain't stupid\nI recognize that life is a dream, and I dream lucid\nAnd break the chains and change minds\nOne verse at a time, and claim 2-6\nAnd fuck it, if the shoe fits, who's the king?\nWe all kings\n(We all kings nigga)\nKings of ourselves first and foremost\n(True)\nWhile the people debate who's the king of this rap game\nHere comes lil' ol' Jermaine\nWith every ounce of strength in his veins\nTo snatch the crown from whoever y'all think has it\nBut rather than place it on his head as soon as he grabs it\nPoof, boom, paow, it's like magic\nWith a flash and a BANG the crown disintegrates\nAnd falls to the Earth from which it came\nIt's done\nAin't gonna be no more kings\nBe wary of any man that claims\nBecause deep down he clings onto the need for power\nThe reality, he's a coward\nUltimately he's scared to die\nAnd sometimes so am I\nBut when I'm in tune with the most high\nI realize, the fear lies in my lack of awareness of the other side\nToday I know that we are the same, are the same, you and I\nDifferent kind of skin, different set of eyes\nTwo different minds, but only one God\n(It's only one God nigga)\nIt's for all the kings\n'Cause I know deep down every poet just wanna be loved\n\n"}, {"title": "St. Tropez", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Roll up and smoke my sins away\nI'd like to go to St. Tropez\nMaybe I'll go, maybe I'll stay (Maybe I'll stay)\nShe asked me if I'm scared to fly\nTo tell the truth, I'm terrified\nI never been that high before\nVery bad reason not to go\nTerrible reason not to go\nHe's on his way, he's 'bout to get paid\nHe's on his way to Hollywood\nHe's on his way, he's 'bout to get paid\nHe's on his way to Hollywood\nShow him the way, he's 'bout to get paid\nHe's on his way to Hollywood\nHe's on his way, he's 'bout to get paid\nHe's on his way to Hollywood\nAy from the door I showed you my scars\nAnd I told you girl, \"I won't lie\"\nIf we at war, then this is a war that I can't afford, no I, I, I\nI wanted more but that was before\nLord knows I'm torn, so I–I cry (No I, I, I)\nFrom the corner of my eye, baby\nIt's been hard for me to smile\nLately, it's been hard for me to smile\nLately, it's been hard for me to smile\nLately, it's been hard for me to smile\nIf you won't take me in your home\nIf you won't take me in your home\nIf you won't take me in your home\nIf you won't take me in your home\nHe's on his way, he's 'bout to get paid\nHe's on his way to Hollywood\nHe's on his way, he's 'bout to get paid\nHe's on his way to Hollywood\nShow him the way, he's 'bout to get paid\nHe's on his way to Hollywood\nHe's on his way, he's 'bout to get paid\nHe's on his way to Hollywood\n\n"}, {"title": "G.O.M.D.", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Hollywood Cole, go\nAyy, Hollywood, ayy, Hollywood Cole, go\nMy nigga done went Hollywood\nYou wanna know just where I'm at? Well, let me tell you 'bout it\nI put my city on the map, but let me tell you 'bout it\nThey tryna say I can't come back, ayy, let me tell you 'bout it\nMan, fuck them niggas, I come back, ayy, let me tell you 'bout it\nI wanna tell you 'bout it: hands up, everybody run\nCole outside and he say he got a gun\nNiggas like, \"Man, that's what everybody said\"\nGo and pop the trunk and everybody dead\nEverybody scared of the nigga, aware that the nigga is better\nAll my bitches the pick of the litter, never bitter\nNiggas is fake, they anime\nMe I never hate, get cake like Anna Mae, whoa\nEat the cake bitch, eat the damn cake, uh\nFuck good, nigga, we demand great\nOrder Domino's and she take off all her clothes\nNigga you know how it goes, make the pizza man wait\nThe best kept secret\nEven Hov tried to keep it and I leaked the damn tape, uh\nRest in peace any nigga want beef\nSecret service couldn't keep the man safe\nI said, to the window, to the wall (To the wall)\nMy nigga ride when I call (I call)\nGot bitches all in my mind (My mind)\nFuck nigga blockin' my shine (My shine)\nI know the reason you feel the way\nI know just who you wan' be\nSo everyday I thank the man upstairs\nThat I ain't you and you ain't me\nGet off my dick, whoa\n(Get the fuck off my dick)\nGet off my dick, whoa\n(Get the fuck off my dick, nigga)\nGet off my dick, bitch, whoa\n(Get the fuck off my dick)\nGet off my dick, whoa\nMan, fuck them niggas, I come home and I don't tell nobody\nThey gettin' temporary dough and I don't tell nobody\nLord, will you tell me if I changed? I won't tell nobody\nI wanna go back to Jermaine, and I won't tell nobody\nThis is the part that the thugs skip!\nYoung nigga never had love\nYou know, foot massage, back rub shit\nBlowin' bubbles in the bathtub shit\nThat is until I met you\nTogether we done watch years go by\nSeen a river of your tears go by\nGot me thinkin' 'bout some kids, still I\nTell them hoes come through, the break up\nGet to know somebody and you really learn a lot about 'em\nWon’t be long before you start to doubt 'em\nTell yourself you better off without 'em\nThen in time you will find can't walk without 'em\nCan't talk without 'em, can't breathe without 'em\nCame here together, you can't leave without 'em\nSo you walk back in, make a scene about 'em\nOn your Amerie, it's just 1 Thing about 'em\nIt's called love, niggas don't sing about it no more\nDon't nobody sing about it no more, no more\nIt's called love, niggas don't sing about it no more\nDon't nobody sing about it no more\n(Nigga, I don't sing about this shit no more)\nBut every nigga in the club singin'\nTo the window, to the wall (To the wall)\nMy nigga ride when I call (I call)\nGot bitches all in my mind (My mind)\nFuck nigga blockin' my shine (My shine)\nI know the reason you feel the way\nI know just who you wan' be\nSo everyday I thank the man upstairs\nThat I ain't you and you ain't me\nGet off my dick\nBut every nigga in the club singin'\nSingin' this song, yeah\nGot all the bitches in the club singin'\nSingin' this song, yeah\nAnd all they mamas let their kids sing it\nSing this song, yeah\nThe baby mamas and the mistresses\nThis song, yeah, song, yeah\nSong, yeah, song-song, yeah\nThe make up\nThis shit is retarded, goddamn\nWhy every rich black nigga gotta be famous?\nWhy every broke black nigga gotta be brainless?\nUh, that's a stereotype\nDriven by some people up in Aerial Heights\nHere's a scenario:\nYoung Cole pockets is fat like Lil Terrio\nDreamville, give us a year we'll be on every show\nYeah, fuck nigga, I'm very sure, heh\nFuck the rest, I'm the best nigga out\nWhen I'm back home, I'm the best in the South\nWhen I'm in L.A., I'm the best in the West\nYou contest? You can test, I'ma stretch niggas out\nOoh, I'ma stretch niggas out\nThat go for all y'all if I left niggas out\nThis shit for everybody on my testicles\nPlease make sure you put the rest in your mouth, ho\n\n"}, {"title": "No Role Modelz", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "First things first: rest in peace Uncle Phil\nFor real, you the only father that I ever knew\nI get my bitch pregnant, I'ma be a better you\nProphecies that I made way back in the Ville, fulfilled\nListen, even back when we was broke, my team ill\nMartin Luther King woulda been on Dreamville\nTalk to a nigga\nOne time for my L.A. sisters\nOne time for my L.A. hoes\nLame niggas can't tell the difference\nOne time for a nigga who know\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nNo role models and I'm here right now\nNo role models to speak of\nSearchin' through my memory, my memory, I couldn't find one\nLast night I was gettin' my feet rubbed\nBy the baddest bitch, not Trina but I swear to God\nThis bitch'll make you call your girl up\nAnd tell her, \"Hey, what's good?\"\n\"Sorry I'm never comin' home, I'ma stay for good.\"\nThen hang the phone up and proceed to lay the wood\nI came fast like 9-1-1 in white neighborhoods\nAin't got no shame 'bout it\nShe think I'm spoiled and I'm rich 'cause I can have any bitch\nI got defensive and said, \"Nah, I was the same without it.\"\nBut then I thought back, back to a better me\nBefore I was a B-list celebrity\nBefore I started callin' bitches \"bitches\" so heavily\nBack when you could get a platinum plaque without no melody\nYou wasn't sweatin' me\nOne time for my L.A. sisters\nOne time for my L.A. hoes\nLame niggas can't tell the difference\nOne time for a nigga who know\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nI want a real love, dark skinned Aunt Viv love\nThat Jada and that Will love\nThat leave a toothbrush at your crib love\nAnd you ain't gotta wonder whether that's your kid love\nNigga, I don't want no bitch from reality shows\nOut-of-touch-with-reality hoes\nOut in Hollywood bringin' back five or six hoes\nFuck 'em then we kick 'em to the do'\nNigga, you know how it go\nShe deserved that, she a bird, it's a bird trap\nYou think if I didn't rap she would flirt back?\nTakin' off her skirt, let her wear my shirt 'fore she leave\nI'ma need my shirt back (Nigga, you know how it go)\nOne time for my L.A. sisters\nOne time for my L.A. hoes\nLame niggas can't tell the difference\nOne time for a nigga who know\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nFool me one time, shame on you\nFool me twice, can't put the blame on you\nFool me three times, fuck the peace sign\nLoad the chopper, let it rain on you\nFool me one time, shame on you\nFool me twice, can't put the blame on you\nFool me three times, fuck the peace sign\nLoad the chopper, let it rain on you\nMy only regret was too young for Lisa Bonet\nMy only regret was too young for Nia Long\nNow all I'm left with is hoes from reality shows\nHand her a script, the bitch probably couldn't read along\nMy only regret was too young for Sade Adu\nMy only regret, could never take Aaliyah home\nNow all I'm left with is hoes up in Greystone\nWith the stale face 'cause they know it's they song\nShe shallow but the pussy deep (she shallow, she shallow)\nShe shallow but the pussy deep (she shallow, she shallow)\nShe shallow but the pussy deep (she shallow, she shallow)\nShe shallow but the pussy deep (she shallow, she shallow)\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\nDon't save her, she don't wanna be saved\n\n"}, {"title": "Hello", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Hello, hello, hello\nHello, hello, hello\nAnd I thought about you today\nAnd I thought about the things you used to say\nAnd I thought about the things we did\nAnd I thought about your newest kid\nAnd damn that makes two now\nOh what do I do now?\nCause if we ever got together\nI'd have to be them niggas step-pops forever\nAnd well that ain't my thing cause I\nI ain't even got my own\nAnd I ain't really got no home\nNo place to put these things I own\nAnd I thought about the things you used to say\nAnd I thought about the games you used to play\nAnd I thought about that little kid\nAnd I thought about the things we did\nI always thought that we would be together\nI always knew that we would be together\nBut I don't wanna wait forever\nI don't wanna wait forever\nHello, hello, hello\nHello, hello, hello\nHello, hello?\nShit seem so sad when you look back\nShit seem so sad when you look back\nShit seem so sad when you look back\nShit seem so sad when you look back\nShit seem so sad when you look back\nShit seem so sad when you look back\nShit seem so sad when you look back\nShit seem so sad when you look back\nShit seem so sad when you look back\nEverything's so sad when you look back\nOn the rebound like a book back\nOn the rebound like a put back\nDon't just sit back, bitch get on it\nTime fly by way too quick, don't it\nReflection bring regrets don't it\nRejection makes you defensive\nSo you protect your pride with your reflexes\nBut life is a game with no reset on the end\nIt ain't no lookin' back, no, no, no, no\nIt ain't no lookin' back, no, no, no, no\nIt ain't no lookin' back, no, no, no, no\nIt's all good\nIt ain't no lookin' back, no, no, no, no\nIt ain't no lookin' back, no, no, no, no\nIt ain't no lookin' back, no, no, no, no\nIt's all good\nHello, hello, hello\nHello, hello, hello\nAnd I thought about you today\nAnd I thought about the things you used to say\nAnd I thought about the things we did\nAnd I thought about your newest kid\nAnd damn that makes two now\nOh what do I do now?\n\n"}, {"title": "Apparently", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Oh right, oh\nOh why na-da-da-da\nI keep my head high\nI got my wings to carry me\nI don't know freedom\nI want my dreams to rescue me\nI keep my faith strong\nI ask the Lord to follow me\nI've been unfaithful\nI don't know why you call on me\nThis is my canvas\nI'ma paint it how I want it baby, oh I\nThis is my canvas\nI'ma paint it, paint it, paint it, how I want it nigga\nFuck you cause there, there is no right or wrong, only a song\nI like to write alone, be in my zone\nThink back to Forest Hills, no perfect home\nBut the only thing like home I've ever known\nUntil they snatched it from my mama\nAnd foreclosed her on the loan\nI'm so sorry that I left you there to deal with that alone\nI was up in New York City chasing panties, getting dome\nHad no clue what you was going through\nHow could you be so strong?\nAnd how could I be so selfish? I know I can be so selfish\nI could tell by how I treat you with my girl, damn she so selfless\nBut she put up with my ways because she loves me like you do\nAnd though it don't always show I love her just like I love you\nAnd I need to treat you better\nWish you could live forever\nSo we could spend more time together\nI love you mama\nI keep my head high\nI got my wings to carry me\nI don't know freedom\nI want my dreams to rescue me\nI keep my faith strong\nI ask the Lord to follow me\nI've been unfaithful\nI don't know why you call on me\nE-e-eee, e-e, apparently\nYou believe in me, you believe in me\nE-e-eee, e-e, apparently\nYou believe in me, and I thank you for it, oh I\nAnother day, another rhyme, ho\nAnother day, another time zone\nToday, I woke up feeling horny so it's only right\nI got two bitches playing on my trombone\nKeep up, never sure where the words would take me\nNiggas eat em up, and regurgitate me\nShit trump tight never slurred it lazy\nGive a virgin the urge to rape me, nigga please\nBest friends really make great for enemies\nMy watch came, niggas can't wait for one of these\nI see you nigga, this ain't no Rolex, it's a AP nigga\nI'm hot, dog, catch up to me nigga—uh, couldn't resist\nAim for the stars and I shouldn't have missed\nBut I was riding on fumes so I stopped by the moon\nNow I'm sitting on the hood of this bitch\nLike, \"Thanks for the view\", waiting on thanks from a few\nCause without me you wouldn't exist\nYou know that shit, gave you the blueprint, don't forget\nCole is your phone on zero percent\nGoing off, now niggas showing off\nNiggas swear they hard but they flowing soft\nI'm taking off like \"boing!\" on a big ass Boeing\nGetting head like a coin toss, too easy\nI keep my head high\nI got my wings to carry me\nI don't know freedom\nI want my dreams to rescue me\nI keep my faith strong\nI ask the Lord to follow me\nI've been unfaithful\nI don't know why you call on me\nE-e-eee, e-e, apparently\nYou believe in me, you believe in me\nE-e-eee, e-e, apparently\nYou believe in me, and I thank you for it, oh I\n\n"}, {"title": "Love Yourz", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Love yours\nLove yours\nNo such thing\nNo such thing as a life that's better than yours\nNo such thing as a life that's better than yours (Love yours)\nNo such thing as a life that's better than yours\nNo such thing, no such thing\nHeart beatin' fast, let a nigga know that he alive\nFake niggas, mad snakes\nSnakes in the grass let a nigga know that he arrived\nDon't be sleepin' on your level\n'Cause it's beauty in the struggle, nigga (Beauty, beauty)\nGoes for all y'all\nIt's beauty in the struggle, nigga (Beauty, beauty)\nLet me explain, yeah\nIt's beauty in the struggle, ugliness in the success\nHear my words or listen to my signal of distress\nI grew up in the city and know sometimes we had less\nCompared to some of my niggas\nDown the block, man, we were blessed\nAnd life can't be no fairytale, no once upon a time\nBut I be goddamned if a nigga don't be tryin'\nSo tell me, Momma please, why you be drinkin' all the time?\nDoes all the pain he brought you still linger in your mind?\n'Cause pain still lingers on mine\nOn the road to riches, listen, this is what you'll find\nThe good news is, nigga, you came a long way\nThe bad news is, nigga, you went the wrong way\nThink being broke was better\nNo such thing as a life that's better than yours\nNo such thing as a life that's better than yours\n(think being broke was better)\nNo such thing as a life that's better than yours\nNo such thing, no such thing\nFor what's money without happiness?\nOr hard times without the people you love?\nThough I'm not sure what's 'bout to happen next\nI ask for strength from the Lord up above\n'Cause I've been strong so far\nBut I can feel my grip loosenin'\nQuick, do somethin' before you lose it for good\nGet it back and use it for good\nAnd touch the people how you did like before\nI'm tired of livin' with demons 'cause they always invitin' more\nThink being broke was better\nNow I don't mean that phrase with no disrespect\nTo all my niggas out there livin' in debt\nCashin' minimal checks, turn on the TV see a nigga Rolex\nAnd fantasize about a life with no stress\nI mean this shit sincerely\nAnd as a nigga who was once in your shoes\nLivin' with nothin' to lose, I hope one day you hear me\nAlways gon' be a bigger house somewhere, but nigga feel me\nLong as the people in that motherfucker love you dearly\nAlways gon' be a whip that's better than the one you got\nAlways gon' be some clothes that's fresher than the ones you rock\nAlways gon' be a bitch that's badder out there on the tours\nBut you ain't never gon' be happy 'til you love yours\nNo such thing as a life that's better than yours (Love yours)\nNo such thing as a life that's better than yours (Love yours)\nNo such thing as a life that's better than yours (Love yours)\nNo such thing, no such thing\nHeart beatin' fast, let a nigga know that he alive\nFake niggas, mad snakes\nSnakes in the grass let a nigga know that he arrived\n\n"}, {"title": "Note to Self", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j. cole", "ron gilmore", "j cole"], "artist": "j cole", "lyrics": "And wherever we go\nAnd whatever we do\nAnd whatever we see\nAnd whoever we be\nIt don't matter, it don't matter\nI don't mind cause you don't matter\nI don't mind cause I don't matter\n(And don't shit matter)\nYou'll see in the end\nI've got a feeling that there's somethin' more\nSomething that holds us together\nSomething that holds us together\nThe strangest feeling but I can't be sure\nSomething that's old as forever\nSomething that's old as forever\nLove, love, love, love\nAnd wherever we go\nAnd whatever we do\nAnd whatever we see\nAnd whoever we be\nIt don't matter, it don't matter\nI don't mind cause you don't matter\nI don't mind cause I don't matter\n(And don't shit matter)\nYou'll see in the end\nLove, love, love, love\n\n"}, {"title": "2014 Forest Hills Drive [Booklet]", "year": "2014", "album": "2014 Forest Hills Drive ", "writers": ["j cole"], "artist": "j cole", "lyrics": ""}]