[{"title": "Like A Star", "year": "2011", "album": "Any Given Sunday #1 ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Baby girl, roll down the window\nI love to see your hair float when the wind blow\nEven if the money been slow\nAyy, to you it don't matter, 'cause you're still gon' ride with me\nYou're still gon' ride with me\nI say you still gon' ride with me\nI know you're still gon' ride with me, hey\nWelcome to the life of a nice brother\nLight skind-ed, black father, white mother\nTried to be a player, found out I'm a slight lover\nCome from Carolina, I'm fly, I'm a Wright Brother\nWent away to school looking for the right lover\nYou know, someone that you could cut and never worry 'bout a rubber\nShe had a man, I be damned, think I might love her\nThought about her ass for the whole damn Summer\nMan I even memorized her whole damn number\nThis is my semester dog, I'm coming to arrest her\nY'all you know, handcuff her, her ex man, fuck him\nOh nah don't be appalled man, that nigga was a dog\nSo it's me now, and she be everywhere I be now\nI wonder, should I tell her what her fella wanna be now?\nThe dreams I been dreaming and them things I wanna see now\nDo that make you wanna leave or would you still hold me down?\nBaby girl, roll down the window\nI love to see your hair float when the wind blow\nEven if the money been slow\nAyy, to you it don't matter, 'cause you're still gon' ride with me\nYou're still gon' ride with me\nI say you still gon' ride with me\nI know you're still gon' ride with me, hey\n(Just like a star)\nCause baby girl you shine (just like a star)\nAnd we gon' do it big (just like a star)\nAnd maybe get a crib (just like a star)\n'Ey maybe we can live (just like a star)\nHey, for you I always had an admiration\nWe lost touch but you never left my imagination\nCongratulations on your graduation\nOh now it's time to hit the real world, filled with all them résumés and applications\nMan, but ain't nobody calling you back\nYou say it's cause you a woman and even more cause you black, imagine that\nThe weight of everything on your plate\nYou got the world on your back baby, if you can relate, man I feel for you\n'Ey has this world got too real for you?\nYour old friends say you changed but I still know you\nYou that same old girl I used to take home from school\nTryna look cool, forgot I had the brake on, damn\nTime passed and you done grew up\nAnd yeah, it's just like I told you baby look I done blew up\nBut the money and this little bit of fame ain't changed me\nSo holla when you need me, I bet you you'll get the same me\nBaby girl, roll down the window\nI love to see your hair float when the wind blow\nEven if the money been slow\nAyy, to you it don't matter, 'cause you're still gon' ride with me\nYou're still gon' ride with me\nI say you still gon' ride with me\nI know you're still gon' ride with me, hey\n(Just like a star)\nCause baby girl you shine (just like a star)\nAnd we gon' do it big (just like a star)\nAnd maybe get a crib (just like a star)\n'Ey maybe we can live (just like a star)\nJust like a star that's in my sky\nJust like an angel off my page\nYou have appeard to my life\nIt feels like we never be the same\nDamn and it's been, way too long\nCan't find the words to write this song\nHey, uh, still I wonder why\nBut it ain't what I do\nHey, we do it all the time\nGoin' out my mind\nMan, damn\nBaby girl, roll down the window\nI love to see your hair float when the wind blow\nEven if the money been slow\nAyy, to you it don't matter, 'cause you're still gon' ride with me\nYou're still gon' ride with me\nI say you still gon' ride with me\nI know you're still gon' ride with me, hey\n\nJust like a star\nJust like a star\nJust like a star\nJust like a star\n\n"}, {"title": "Knock On Wood (Freestyle)", "year": "2011", "album": "Any Given Sunday #1 ", "writers": ["j. cole", "dj hot day", "j cole"], "artist": "j cole", "lyrics": "Cole, Cole, Cole, Cole, and on the count of three, baby girl\nCole, Cole, Cole, Cole, and on the count of three, baby girl\nCole, Cole, Cole, Cole, Cole, hey\nAnd on the count of three, Blow up, Blow up\nYeah, and that I will, nigga, that I will\nI keep a checklist of rappers that I'mma kill\nI used to play the bleachers before I had a deal\nNow a nigga gettin burnt, just imagine how that feel\nHmm, ill, fantastic\nFlip rhymes, flip beats, nigga, \"Jam\"nastics\nYour style hot now, but they just can't last with\nSomething like the rap sand-castle\nGone with the tide, I'm here for the seasons\nBend yo' ass over bitch I'm here for a reason\nCold breezin', flow freezin'\nThis ain't spittin' ho, I'm sneezin'\nUsed to hit South Beach, stay at the Parisian\nNo fun nigga, low funds was the reason\nOld school bed that the hoes got pleased in\nNow them Lowes doors, is what I throw keys in\nMan, talk about a come up\nNiggas see me in the street they talk about 'The Come Up'\nOr talk about 'The Warm Up'\nOr \"Nigga, when your album drop?\"\nAnd why these lil' rappers like to run their mouth alot?\nAnd J. Cole, are you really from the south or not?\nI see your jeans, man them thangs, must have cost a lot\nAye do you get a chance to hang out with the boss a lot?\nEven them hating niggas like you at the barbershop\nCole.. Yeah, that's my muhfucking name\nNigga couldn't even watch the All Star game\nHad to do the whole Valentines Day thang\nGotta play the game, so my lady won't complain\nThree or four days, I be back on a plane\nDo a couple shows, where the people know my name\nLook man, the crowd full of pretty young dames\nIf you gonna do dirt, then you can't leave a stain, man!\nTiger Woods y'all\nHe like them white girls, I like them hoods y'all\nShe got her head straight, she got a good job\nShe give the best brain, she got them good jaw\nI got that good game, that's cause I'm good, y'all\nAnd J. Cole the lil' engine that could, y'all\nAnd yeah I'm coming for the top, like I should, y'all\nAnd bitch I never fall off, knock on wood, y'all\nCole\n\n"}, {"title": "Pity", "year": "2011", "album": "Any Given Sunday #1 ", "writers": ["voli contra", "omen", "j. cole", "j cole"], "artist": "j cole", "lyrics": "Is this the life that You chose for me?\nIs this the life that You chose for me?\nIs this the dice that was rolled for me?\nI won't cry about it, I won't cry about it\nIs this the life that You chose for me, Lord?\nIs this the life that You chose for me?\nIs this the dice that You rolled for me?\nYeah, yeah\nThis is The Ville, home of the fast-lifers\nWhere we get high and don't come down, we gas prices\nMan, I wonder how hard to live my past life was\n'Cause this one hard, I could show you my scars, I ain't cryin' though\nAyy, save that pity for the next man\nOr that girl getting beatdown by her ex-man\nAyy, hold your head, mama, I know you wish that nigga dead, mama\nIf I can find a way to kill him, I won't have nar' drama\nDamn mama, tell me who you love\nThis one is for the boy that see his mama on drugs\nI feel your pain, boy, and just know I been through the same, boy\nThat lady need you more than ever, don't be ashamed, boy\n'Cause when it rained, boy, that was your umbrella\nThe one that changed your pissy sheets when you was a young fella\nAnd now she in the bedroom on her knees\nStaring at the sky, screaming \"Lord, please!\" Tell me now:\nIs this the life that You chose for me?\nIs this the life that You chose for me?\nIs this the dice that You rolled for me?\nI won't cry about it, I won't cry about it\nIs this the life that You chose for me, Lord?\nIs this the life that You chose for me?\nIs this the dice that was rolled for me?\nI won't cry about it, I won't cry about it\nHey, I can't cry about it\nNuh, gotta be strong, can't cry about it\nHey, uh\nIs this the life that You chose for me?\nIs this the life that You chose for me?\nIs this the dice that You rolled for me?\nI won't cry about it, I won't cry about it\nIs this the life that You chose for me, Lord?\nIs this the life that You chose for me?\nIs this the dice that was rolled for me?\nYeah!\n\n"}, {"title": "How High", "year": "2011", "album": "Any Given Sunday #1 ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "What's love\nGot to do, got to do with it? (Yeah)\nI get a lil taste then I’m through with it\nThen I send her right back to you with it (Ha ha), hey, how high?\n(Hey) What's love (How high?)\nGot to do, got to do with it? (How high?)\nI get a lil taste then I’m through with it (How high?)\nYeah, I send her right back to you with it\nVisionary, play your position, no missionary\nBut yet I pack Gospel in the quotes I spoke\nYou listening to the most high like the Pope on dope\nNow picture that, my poetry’s deep, now fish for that\nOnly real niggas catch something, phoney niggas fail\nShit you gotta feel like it’s only read in braille\nBoth did the crime but his homie didn’t tell\nSo he fucking bitches while he sitting lonely in a cell\n\"Thinking well, what the hell I been on\nThey gave a nigga five then they threw another ten on\nBy the time I’m back in the streets like a bachelor\nI gotta play the clubs with the old ass women\"\nLife is a movie, pick your own role\nClimb your own ladder or you dig your own hole\nYou sit around crying, that's like sitting round dying\nYou wanna touch the sky? Bitch, you figure out flying\nNigga, how high? So high that I could touch the sky\nHow sick? So sick that I could fuck yo’ bitch\nNigga please, my squad stack plenty of G’s\nAnd if your girl like to smoke we got plenty of trees\nHow high? So high that I could touch the sky\nHow sick? So sick that I could fuck yo’ bitch\nNigga please, my squad stack plenty of G’s\nAnd if your girl like to smoke we got plenty of trees\nHey, as the troubles of the world unfurl\nMy niggas hit the trees like squirrels\nTryna get a nut with your girl, think I need to quit tryin'\n‘Fore some nigga out there try to hit mine\nKarma for the Kama Sutra\nA lot calmer when the ganja’s through ya\nYou need ya armour cause them niggas out here tryna shoot ya\nKinda crucial, police piranha, gon snatch you out that Honda\nFor stashing that marijuana\nYes, ya honour, I feel ashamed\nI broke the law but look I’ll never smoke or steal again\nIn your courtroom wylin’, I don’t mean to keep smiling\nBut right now I’m high enough to probably steal a plane\nMan, just look at me, what if I couldn’t read?\nWould you throw the book at me\nWhat if I’m feeling sad, am I supposed to look happy\nIt’s been a long time coming\nTell my nigga roll me up something\nNigga how high? so high that I could touch the sky\nHow sick? so sick that I could fuck yo’ bitch\nNigga please, my squad stack plenty of G’s\nAnd if your girl like to smoke we got plenty of trees\nNo I dont smoke, maybe once in a blue\nWhen the tension gets thick then there’s nothing to do\nThrough the windows of my soul, open the blind\nMy eyes get shut but I open my mind\n\nHow high? la la la la\nHow high? hey hey hey\nHow high? yeah yeah yeah yeah\nHow high? la la la la\nIs that a shot that you threw little man?\nI understand, you frustrated career ain't going how you planned\nMake it worse, your friends, now when they talk rap\nAll you hear is “J Cole this” and “J Cole that”\nIt must be hard for your pride just to take all that\nI know your weak heart gotta break off that\nBoy, look, Cole World this is your worst fear\nI’m burning you niggas and I’m only in first gear\nI’m serving you niggas this is only the first beer\n12 months from now, you’ll be having the worst year\nNo tears for the haters, I’m still counting money\nCole ain't dropping, thats real fucking funny\nGrade A dummy, sleeping on a nigga raps\nSomething like a mummy\nBut I’mma wake yo’ ass up\nSomething like your mommy on school day\nI smoke two l’s with ya girl this is Cool J\nHow high?\nHow high?\nHow high? yeah\nHow high? yeah\n\nWhats love got to do, got to do with it\nI get a little taste then I’m through with it\nYeah I send it right back to you with it\n\n"}, {"title": "Unabomber", "year": "2011", "album": "Any Given Sunday #1 ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah\nFresh off the mother fucking broadcast\nAnd I'm here, fuego nigga\nYeah, hey, uh, it's happening fast\nYeah, uh\nI told niggas on the low, they ain't hear it though\nBoy that man in the mirror is a miracle\nHey wipe your face, momma told you no more tears would flow\nWe eating better than we was a few years ago\nSent you Western Union on my pay day, a week later it's mayday\nSo you returned the favor, we stayed afloat like some sailors\nBill collectors blowing us up, they couldn't fade us\nBitch I made straight A's, go ahead, and try to degrade us, haters\nBut this one's funny: man one year later I was on them phones\nCollecting money, a lesson from me: everybody's got a story dog\nUnfortunately learned I can't do nothing for you dog\nI'm trying to run the whole game like a morning jog\nWith hits like a porno blog\nNot hopping out the shower to make ten dollars an hour\nAin't judging though, to each his own\nYou pay your bills and raise your kids inside a decent home\nMore power to you\nBut a message to you fuck niggas\nI hope your kids grow up and never wanna fuck with you\nThis punk nigga knocked up two hoes at the same time\nAnd told this nigga they was lying dog, they ain't mine\nThat's cold blooded but ain't nothing new\nSame old, fuck it though, what's up with you?\nIf you made it this far listening without skipping\nThen I gotta show love, don't worry I'm just venting\nThe late night thoughts of a nigga on a mission\nAnd I rock my girl to sleep in missionary position\nTuck that ass in and then I went and grabbed a pen\nAnd now you have it, words flowing like magic, it's truly accurate\nYou niggas posing like some hoes up in a beauty pageant!\nNobody touching me, it's like I got the cooties rapping\nRemember when we called niggas African booty scratchers?\nYeah that was random, but man so is life\nYou grab your needle, grab your thread, and hope you sew it right\nI find myself fiending for a spot to go at night\nWith the liquor flowing steady and the hoes polite\nThe fast lane makes me reminisce on slower life\nThe unabomber, bitch I'm blowing up overnight (BOOM!)\nHey, yo, it's happening fast (Fast)\nI say it's happening fast (Fast)\nAll the drama that I had to get past\nWill it last? Or will it pass? (Pass)\nJust as quick as it came (Came)\nHoes knowing my name (Name)\nDog, welcome to fame\nI pray to God we don't change (Change)\nBut even if you don't\nMost niggas look at you strange\nBut I guess I can't complain (Hey)\nHey man it's happening fast (Fast)\nI say it's happening fast (Fast)\nI say it's happening fast (Fast)\n\n"}]