[{"title": "Villuminati", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": ""}, {"title": "Kerney Sermon (Skit)", "year": "2013", "album": "Born Sinner ", "writers": ["kerney sermon", "j cole"], "artist": "j cole", "lyrics": "I'm just thankful\n18 years of suffering gone just like that\nYou've been suffering 18 years yourself\nYou've been going through pure hell but it can be over just that fast\nThis is pastor Kerney Thomas and I literally have tens of thousands across the country\nThat were hurting for God to heal them\nAnd God could work a miracle for them\nAll you gotta do is either log on to our website\nOr you can dial the toll-free number\nAnd place your order right there\nFor the Personal Prayer Package\nI want you quickly, to place that order right now\nFor the Personal Prayer Package\nPick up the telephone right now\nI said pick up the phone right now\nYou're past due a miracle\n\n"}, {"title": "LAnd of the Snakes", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, uh-huh\nThis the shit I used to roll down Lewis Street with\nLord, know some hoes from the past\nLike, \"Damn Cole, wish I knew that you would be rich\"\nWell, shoulda asked\nIt's funny how these niggas on some real \"be cool with me\" shit\nI bag two bitches like it's two of me, bitch\nThis the shit I used to roll down Lewis Street with\nFinally got my own bedroom in this bitch\nNo more sleeping in my brother room\nLike, \"Man, I might as well be sleeping in my mother room\"\n'Cause how I'm supposed to sneak hoes with my bro here?\nPlus she gon' find out I been rocking all his old gear\nThis his flow here, this is no fair, this is so pure\nThis is so clear, this is one breath, this is no air\nAin't no wedding but I do the most here\nI'm the President, you the co-chair\nYou the player, yeah, I'm the coach here, nigga, I coast here\nThis weather got me set up on this West Coast, yeah\nAvoiding the snakes, AKs, and coke, yeah\nGet my dick wet but I never let it soak there\nMan, I been thinkin' 'bout movin' out\nWhat? Country boy in the city\nOf New York nine years, ran that shit like Diddy\nRiding through South Side Queens like Fiddy\nNothing's impossible\nAnd all you lame niggas show me what not to do\nI met a real bad bitch in the club tonight\nShe told me, \"Watch the snakes 'cause they watching you\"\nI told her, \"Awww baby don't start!\nI ain't looking for the way to your heart!\"\nShe said, \"You 'bout to miss church\" while she riding me\nI like my sundaes with a cherry on top\nMake that ass drop (drop, drop)\nHey make that ass drop (drop, drop)\nHey make that ass drop (drop, drop)\nHey make that ass drop (drop, drop, drop)\nNow if you only had one wish is it devious?\n'Cause you already know who your genie is\nAin't get a cover now your mag on my penis\nLike damn, he turned out to be a genius\nDamn, real shit nigga, no Pixar\nYou niggas soft like Meagan Good's lips are\nMy kicks hard, my whip hard\nI came out the womb with my dick hard\nBack when I was playing Stomp the Yard\nIt'd be a bunch of niggas up on campus talking hard\nDon't get exposed to these hoes boy, knock it off\nI seen your mama in the Benz when she dropped you off\nDamn, now who more thorough than me?\nI paint a picture of my pain for the world to see\nCould paint a picture of the game but my girl would see\nGotta ask myself, \"What mean the world to me?\"\nMe, me\nNothing's impossible\nAnd all you lame niggas show me what not to do\nI met a real bad bitch in the club tonight\nShe told me, \"Watch the snakes 'cause they watching you\"\nI told her, \"Aw baby don't start!\nI ain't looking for the way to your heart!\"\nShe said, \"You bout to miss church\" while she riding me\nI like my sundaes with a cherry on top\nMake that ass drop (drop, drop)\nMake that ass drop\nHey make that ass drop (drop, drop)\nMake that ass drop\nHey make that ass drop (drop, drop)\nMake that ass drop\nHey make that ass drop\nMake that ass drop\nMake, hey, make that ass drop (drop)\nHey, you seen me in this every damn day (drop)\nIt got the dick hard as a rock (drop)\nAnd I can't control (Let it rock)\nHehe, control\nThis the shit I used to roll down Lewis Street wit'\nYeah\nThis the shit I used to roll down Lewis Street wit'\nA little Fayettenam nigga out in Beverly Hills\nThat's when I ran into this chick I went to college with\nYeah, back when a nigga was on scholarship\nWas in a rush but I still stopped to holla, shit\nThat's the least I owed her 'cause see I tried to hit\nOn the first night, and nah, I ain't proud of it\nI boned her in my dorm room and kicked her out of it\nAnd I never called back, how thoughtfulless\nNow I'm standing in the streets tryna politic with her\nIn her mind she calling me a misogynist, nigga\nOn some Bobby Brown shit, my prerogative, nigga\nIs to hit and never commit\nNot realizing when I hit she never forgets\nSo every time I ignore the telephone call\nSaying I'll hit her back knowing I'm never gon' call, she was hurting\nNow she's staring dead in my face, she was smirking\nLike, \"Yeah, I remember and nah you ain't worth shit, nigga\nYou ain't worth shit, nigga\"\nHm, this the shit I used to roll down Lewis Street with\n\n"}, {"title": "Power Trip", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "\n"}, {"title": "Mo Money (Interlude)", "year": "2013", "album": "Born Sinner ", "writers": ["jake one", "j. cole", "j cole"], "artist": "j cole", "lyrics": "Mo Money, yeah\nMo Money, Blow Money, Show Money\nParty Money, Side Ho Money, Dope Money\nNew Clothes money from shit that I wrote money\nSo much money I don't know who stole from me\nHard to keep track I'm used to having no money\nStill broke compared to niggas with old money\nI mean the type of niggas that laugh at Hov money\nBillionaires with petroleum and coal money\nProbably kill they selves if they had Cole money\nTalk shit and I'mma see you like you owe money\nI'm wrapping up the album, fourth quarter I'm so money\nI'm overseas looking for trees to grow money\nPeter Pop off, robbing people for hope money\nProstitutes collecting that \"let me stroke\" money\nPut up a couple dollars for the liquor store money\nUsed to dread the strip club cause I couldn't throw money\nNow the strippers give a nigga the throat for no money\nHow mama gonna teach you how to save your money\nWhen she barely on the boat, got stay afloat money\nBlacks always broke cause we don't know money\nSpend it 'fore we get it and could never hold money\nNo wallets, nah, nigga we'd rather fold money\nMoney control niggas, white man control money\nLaughing like \"yeah yeah my nigga get your money\"\n\n"}, {"title": "Trouble", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "(I said) Set it off on my left, set it off on my right\n(I said) Liquor all on my breath, bitches all in my sight\n(I said) Real niggas tryna fuck, fuck niggas wanna fight\n(I said) Gun shots into the air, but I ain't scared for my life\n(I said)\nTroubles of this, troubles of this world\nTroubles of this, troubles of this world\nYeah, god flow\nPaint a picture like a young Pablo, Picasso\nNiggas say \"Live fast, die young,\" so I drive slow\nAnd pray I die old\nIn the drop with the top low\nMet a bad bitch from Chicago, my hat wasn't cocked, yo\nKept it straight, shit, cause y'all know\nAnd if not, you'll learn how them niggas in the Chi go\nI ain't fuck her, but I'm thinking 'bout it\nMy niggas say why you gotta think about it?\nThe bitch want too much, hit my phone too much\nIf I gotta be frank about it\nAin't worth the stress\nFirst the text, then the draws, see first is sex\nThen it's calls cause the bird's obsessed\nWant flowers, cards, and the purses next\nNah, bitch can't get a dollar\nCole on Twitter, bitch can't get a follow\nCan get a nut, heard \"Can't Get Enough\"\nNow she fuck a nigga thinking that she may have hit the lotto\nNo way, Jose\nCould write a book called, \"The Things Hoes Say\"\nShow a lot of love to my sisters though\nBut these bitches so predictable\nI'm in trouble\nTroubles of this, troubles of this world\nGetting to the promised land\nYou don't want problems, I promise, man\nTroubles of this, troubles of this world\nI take it to the promised land\nYou don't want problems, I promise, man\nSet it off on my left, set it off on my right\n(I said) Liquor all on my breath, bitches all in my sight\n(I said) Real niggas tryna fuck, fuck niggas wanna fight\n(I said) Gun shots into the air, but I ain't scared for my life\n(I said)\nAnd I'm going back to school\nOnly for the hoes and a class or two\nYoung bad bitch made the pastor drool\nEverybody sweat her like Catholic school\nSat next to her in the back of the class\nCheated off her test and I'm grabbing her ass\nShe like \"Don't you know this shit already?\"\n\"Nigga, ain't you rich already?\"\nYeah, but I got dumb as shit\nHanging 'round these rappers 'cause they dumb as shit\nBut I'm back on track, jump shot wasn't that good\nCouldn't sell crack but I rap good\nThat's one stereotype\nKnow a lot of niggas that'll marry your type\nBad bitch with a degree, I let 'em scoop ya\nI'm Koopa, I never been the Mario type\nNo saving hoes\nI ain't fooled cause a lot of cool bitches that a nigga went to school with is major hoes\nAnd they mans don't know, they mans don't know, fo' sho\nHad a nigga baby, little mans don’t know\nMama, was a freak, got it in on the low\n12 years later when my song come on, he ask\n\"Mama, did you fuck J. Cole?\"\nWhoa\nTroubles of this, troubles of this world\nGetting to the promised land\nYou don't want problems, I promise, man\nTroubles of this, troubles of this world\nI take it to the promised land\nYou don't want problems, I promise, man\nSet it off on my left, set it off on my right\n(I said) Liquor all on my breath, bitches all in my sight\n(I said) Real niggas tryna fuck, fuck niggas wanna fight\n(I said) Gun shots into the air, but I ain't scared for my life\n(I said)\n\n"}, {"title": "Runaway", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah\nGimme my space, Lord, ain't enough time to chase\nAll these dreams, nah mean? I got no time to wait\nLove my girl, but I told her straight up, \"Don't wait up\"\nStumble home late, I'm drunk, we fucked and made up\nUsed to living free as a bird, but now I'm laid up\nFeelin' like a nigga got handcuffs on\nHow the fuck did my life become a damn love song?\nShe ride for a nigga and she stand up for him\nBut a nigga wan' be a nigga, be a nigga\nRide through the streets with freaks and real niggas\nShe'll never understand what it's like to be a man\nKnowin' when you look inside yourself you see a nigga\nAnd you don't wan' let her down\nBut you too young for the settle down\nAnd maybe you can thug it out, learn what is love about\nWhen you can't live with her and you can't live without\nAw shit, goddamn, I think the devil got his hands on me\nStripper saying, \"Baby, won't you throw them bands on me?\"\nAnd I came to spend\nShe pop a molly, let the motherfuckin' games begin\nI'm running away\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\nDesperately\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\nWhen it's all said and done everybody dies\nIn this life ain't no happy endings\nOnly pure beginnings followed by years of sinning and fake repentance\nThe preacher say we were made in image of Lord\nTo which I replied: \"Are you sure?\nEven a murderer? Even a whore?\nEven a nigga running through bitches on tour\nWith a good girl at home folding clothes and shit?\"\nShe losin' faith in him and he knows the shit, like, \"What the fuck is a break?\nDon't know how much I can take no more\nI give you all I got 'til it ain't no more\nNo more tears, it's been ten long years\nDamn near, I don't know if I can wait no more\"\nAnd who can blame her, you complain about\nEvery time you out, you come back she poutin'\nSleeping back to back, this is whack, we 'bout\nTo go platinum and I'm in the crib acting out\nMy childhood fantasies of wife and home\nBut it's a whole lot of actresses I'd like to bone\nAnd despite the rumors you hold out\nOn account of your guilt and she has got to spend her nights alone\nAnd she ride or die like Eve and 'em\nMake home-cooked meals every evenin'\nAnd even in your lowest days\nWhen you're no longer Superman, at least you know you got Lois Lane\nBut you\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\nDesperately\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\nYeah\nUnbelievable, seen evil that not even Knievel know\nAt age three I knew this world was three below\nListen, even though my ego low, achieved the unachievable\nImagine if my confidence was halfway decent yo\nThis just in, fucked more bitches than Bieber though\nStill I keep it low, got my niggas on the need to know\nBasis, my manager back in the days was racist\nI was a young boy, passing skates and tucking laces\nOld perverted white man who told me, \"Jermaine\nIt's all pink on the inside, fuck what color they face is\"\nWise words from an indecent man\nMade me reflect on the times when we was three-fifths of them\nIn chains and powerless, brave souls reduced to cowardice\nSlaving in the baking sun for hours just\nTo see the master creep into the shack where your lady at\nNine months later got a baby, that's\nNot quite what you expected, but you\nRefuse to neglect it, 'cause you\nKnow your wifey loves you, thus you refuse to accept it\nThat’s the type of shit that turned my granny light-skinned\nRich white men rule the nation still\nOnly difference is we all slaves now, the chains concealed\nIn our thoughts, if I follow my heart to save myself\nCould I run away from fifty-mill like Dave Chappelle?\nYou know\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\nDesperately\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\n\n"}, {"title": "She Knows", "year": "2013", "album": "Born Sinner ", "writers": ["madeline mckenna", "dmx", "j cole", "ryan mattos"], "artist": "j cole", "lyrics": "Damned if I do\nDamned if I don't\nYou know I got a girl back home\nYou got a man what you want, what you want\nWhat these bitches want from a nigga?\nOn some DMX shit\nI know them other niggas love tricking\nOn some BMX shit\nBut not me\nNow I'm sure you done heard about me\nA black star, Mos Def, Kweli\nGood so them bad hoes try me, they try me\nThis is Martin Luther King in the club\nGetting dubs, with a bad bitch in his ear\nSayin' that she down for whatever\nIn the back of his mind is Coretta\nAnd she knows\nShe knows\nAnd I know she knows\nAnd I know she knows\nAnd deep down she knows\nShe knows\nAnd I know she knows\nAnd I know she knows\nWell all right\nOh I\nOh I-I-I\nI can't be what you want from me, well all right\nOh I\nOh I-I-I\nI can’t be what you want from me, well all right\nDamned if I do (shit)\nDamned if I don't\nI'm passing up on bad hoes\nTrying to be the man that she want, what she want?\nWhat she—what she want from a nigga?\nTo put a ring on it\nGot a bitch on my dick right now\nAnd she just want to sing on it\nGot me up so high\nTry and get a piece of that apple pie\nI be up so high\nTry and get a piece of that apple pie\nDancehall vibes with my pants on fire\n'Cause I told her I was sleep\n'Cause I creep with this pretty young thing that I chose\nShe could be doing the same thing I suppose\nAnd she knows\nShe knows\nAnd I know she knows\nAnd I know she knows\nAnd deep down she knows\nShe knows\nAnd I know she knows\nAnd I know she knows\nWell all right\nOh I\nOh I-I-I\nI can't be what you want from me, well all right\nOh I\nOh I-I-I\nI can’t be what you want from me, well all right\nNiggas say turn up, hoes say turn up\nOnly bad thing 'bout a star is they burn up\nNiggas say turn up, hoes say turn up\nOnly bad thing 'bout a star is they burn up\nRest in peace to Aaliyah\nRest in peace to Left Eye (Left Eye)\nMichael Jackson, I'll see ya\nJust as soon as I die (I die)\nGot me up so high\nTry and get a piece of that apple pie\nI be up so high\nTry and get a piece of that apple pie\nGot me up so high\nTry and get a piece of that apple pie\nI be up so high\nTry and get a piece of that apple pie\nWell all right\nOh I\nOh I-I-I\nI can't be what you want from me, well all right\nOh I\nOh I-I-I\nI can't be what you want from me, well all right\n\n"}, {"title": "Rich Niggaz", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "telepopmusik", "j cole"], "artist": "j cole", "lyrics": "Ayo, ayo, ayo, ah, ayo, ah\nAyo, ayo, ayo, ah\nYeah\nI hate rich niggas, god damn it\n'Cause I ain't never had a lot, damn it\nWho you had to kill? Who you had to rob?\nWho you had to fuck just to make it to the top, damn it?\nOr maybe that's daddy money, escalator, no ladder money\nEscalade, new Caddy money\nWorst fear going broke cause I'm bad with money\nCrooked smile nigga, momma never had the money, damn\nI ain't tripping\nNigga Jordan; I ain't Pippen, yeah\nUp the steps, I ain't slipping\nTears, blood, sweat, and I ain't cripping\nHere's a song you can sing along with\nWhen you down on some let you know you ain't alone shit\nWhen your momma ain't at home cause she got a second job\nDelivering pizzas, you think she out here getting robbed\nPlease God watch her I know how niggas do\nHalf cracker but a nigga too\nTalking all that shit 'bout your step-pops\nHow he was a dog, now look at you\nI ain't bad as that nigga, plus dawg, I'm a grown man now\nI ain't mad at that nigga\nBut if a plane crashed and it only killed his lame ass\nI'd be glad it's that nigga, nigga\nDid Kay dirty now it's back to broke\nRefund checks, used that to float\nMomma gets depressed, falls in love with the next maniac\nOn crack, use that to cope\nMake a nigga smoke a whole sack of dope\nWriting rhymes, tryna bring back the hope\nTry to ride the storm out and crashed the boat\nCould've drowned, but I grabbed the rope\nAnd there go you, and there go you, and there go you\nSelling me dreams and telling me things you knew\nAnd there go you, and there go you, and there go you\nSelling me dreams and telling me things you knew\nSing, you got what I want, I got what you need\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\nYou got what I want, I got what you need\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\nI hate rich niggas, god damn it\n'Cause I ain't never had a lot, damn it\nNiggas can't front on the flows you got\nBut every fucking verse how much dough you got\nHomie, don't quit now\nHear my shit and tried to switch now\nKnow you felt the shit just now, know you felt the shit just now\nAin't there more to you? Don't it ever get boring to you?\nI realize deep down you a coward getting high off of power, fuck it more to you\nSaw through you and it made me ashamed that I played the game\nNot for mo' money like Damon Wayans\nWanted the respect but it came with fame\nI just wanted love but this ain't the same\nI took a train down memory lane\nAnd watched little Jermaine do his thing before he made a name\nIt's like Sony signed Basquiat\nHe gave it all he got, and now a nigga don't paint the same, damn\nI guess he can't complain\nAll the money that be raining in\nSpend a hundred thou for the chain again\nThink of old school niggas like Dana Dane\nProbably kill for another claim to fame, my brain the same\nYeah, nigga, at least he ain't insane\nAt least he ain't insane\nYou ain't crazy, motherfucker, you just afraid of change\nThat's new, maybe that's true\nBut listen here I got a bigger fear\nOf one day that I become you\nWhen I become lost and I become heartless\nAnd numb from all the Ménages\nJust one bitch don't feel the same no more\nAnd Henny don't really kill the pain no more\nNow I'm Cobain with a shotgun aimed at my brain\nCause I can't maintain no more\nTad bit extreme I know\nMoney can't save your soul\nBut there go you\nAnd there go you, and there go you, and there go you\nSelling me dreams and telling me things you knew\nAnd there go you, and there go you, and there go you\nSelling me dreams and telling me things you knew\nSing, you got what I want, I got what you need\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\nYou got what I want, I got what you need\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\n\n"}, {"title": "Where’s Jermaine (Skit)", "year": "2013", "album": "Born Sinner ", "writers": ["alvin fields", "j cole"], "artist": "j cole", "lyrics": "Now hol' on, hol' on, hol' up\nHas anybody seen Jermaine? (No)\nJermaine\nWhere's Jermaine Cole?\nHe does this all the time...\n\n"}, {"title": "Forbidden Fruit", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "ronnie foster", "j cole"], "artist": "j cole", "lyrics": ""}, {"title": "Chaining Day", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Ayy\nCole World\nForreal\nLook at me, pathetic nigga, this chain that I bought\nYou mix greed, pain and fame, this is heinous result\nLet these words be the colors, I'm just paintin' my heart\nI'm knee-deep in the game and it ain't what I thought\nCopped a Range Rover, my girl got the Mercedes\nIced out crazy, I wanna shine like Baby\nCompared to that nigga I ain't even got a bib yet\nTruth be told I ain't even bought a crib yet\nThis is everything they told a nigga not to do\nImage is everything I see, it got a lot to do\nWith the way people perceive, and what they believe\nMoney short so this jewelry is like a weave\nMeant to deceive and hear niggas say: \"I see you\"\nNow bitches wanna fuck you and niggas wanna be you\nAnd police wanna stop you, frisk you wonder what he do\nIf a hater snatch your chain, I bet it still won't free you\n'Cause I be right back grinding 'til I cop another\nI sit and think about all this shit I coulda copped my mother\nMy partner said that's just the game my nigga\nSwear I heard my jeweler say, \"Here go your chain my nigga\"\nThis is chaining day\nI need you to love me (Chaining day), love me (Ohh my chaining day)\nI need you to love me (My chaining day), love me\nMy last piece, I swear\nMy guilt heavy as this piece I wear (Love me, love me, hey hey)\nThey even iced out Jesus' hair\nMy last piece, I swear (Love me, love me)\nThey even iced out Jesus' hair\nIce on this white Jesus seem a little unholy\nThe real strange thing about this iced out Roley\nIt's the same shit a broke black nigga get gassed at\nSame shit a rich white motherfucka laugh at\nWell laugh on white man, I ain't paid as you\nBut I bet your rims ain't the same age as you\nAnd I ain't got no investment portfolio\nBut my black and white diamonds shinin' like a Oreo\nI know back home a nigga sick today\nHe rock a chain and he always got some shit to say\nEven back when I was broke I knew his shit was fake\nHe'd prolly sneeze too hard and his shit could break\nBut hey, you know the sayin', \"Fake it 'til you make it\"\nMe, I did the opposite, made it then I faked it\nAnd acted like I gave a fuck, money I was savin' up\nTo buy a crib that's gated 'til hundred racks, I gave it up\nFor what\nI need you to love me (Chaining day), love me (Ohh, my chaining day)\nI need you to love me (My chaining day), love me\nMy last piece, I swear\nMy guilt heavy as this piece I wear (Love me, love me, hey hey)\nThey even iced out Jesus' hair\nMy last piece, I swear (Love me, love me)\nLord, this is the last time (hehe)\nTold my accountant, \"It's the last time\nI swear this is the last time\nI know that I said that shit last time\nBut this the last time\"\nMama I swear this is the last time\nSo don't take my chains from me\nThis the last time\n'Cause I chose this slavery\nThis is the last time\nDon't take my chains from me\nThis is the last time\n'Cause I love this slavery\nI need you to love me, love me, love me\nI need you to love me, love me, love me\nI need you to love me, love me, love me\nI need you to love me, love me, love me\nI need you to love me, love me, love me\nI need you to love me, love me, love me\nI need you to love me, love me, love me\nI said this is my last time\n\n"}, {"title": "Ain’t That Some Shit (Interlude)", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Okay, I lied\nUh-huh\nMotherfuckers tryna say I can't come to the hood—true lie\nSee, I would, but I'm out in Dubai\nWhen I get back I'ma roll through that\nSnatch yo' bitch, give yo' niggas dap\nThe hood gon' ballistic\nCole was here and you missed it\nThat nigga walk like Obama man\nShook yo momma hand and then kissed it\nThis pimp shit, this pimp shit\nCole hard, you limp dick\nMy flow hard, no wimp shit\nPut in that work, no temp shit\nYa bitch wearin' that lipstick\nGave this dick a french kiss\nThat nigga so wack when the bitch came back\nHe kissed her hoping that it get him sick, ha\nAin't that some shit\nWell paid for this rapping shit\nVille made it to the map and shit\nNiggas move 'caine like Kappa shit\nCan't map this shit\nFrom no bed springs in my mattresses\nTo fuckin' these bad little actresses\nI'm bad as shit, ha\nI got that work\nSay what? My flow\nSay what? My bitches\nSay what? You Cole\nSay what? I said\nSay what?\nAin't that some shit\nWell paid for this rap and shit\nSay what?\nAin't that some shit\nWell paid for this rap and shit\nSay what?\nAin't that some shit\nWell paid for this rap and shit\nSay what?\nAin't that some shit, bitch\nBounce, bounce, bounce, bounce\n(Bounce) bounce\n(Bounce) bounce\n(Bounce) bounce\nFlow, flow, flow, flow\nFlow tight, put a nigga in a headlock\nFuck hoes out of wedlock, make her bed rock\nRed hot, so they got red dots\nPullin' that trigger nigga better be a head shot\nMoney long like dread locks shit\nSo if you send shots then you bet not miss\nFor a couple G's, send a couple G's\nFuck copping pleas, Met Lock shit (testify)\nI gotta testify\nCame through humble so it's best if I\nExplain the newer shit, rockin' jewel shit\nGot the full clip, cock and pull shit\nStop the bullshit watch the flow\nHow you gon' stop the unstoppable?\nKeep niggas on they toes, no Dr. Scholls\nIt's the Roc bitch, rock and roll\nI got that work\nSay what? My flow\nSay what? My bitches\nSay what? You Cole\nSay what? I said\nSay what?\nAin't that some shit\nWell paid for this rap and shit\nSay what?\nAin't that some shit\nWell paid for this rap and shit\nSay what?\nAin't that some shit\nWell paid for this rap and shit\nSay what?\nAin't that some shit, bitch\nBounce, bounce, bounce, bounce\n(Bounce) bounce\n(Bounce) bounce\n(Bounce) bounce\nMy nigga Syience killed this motherfucking beat\n\n"}, {"title": "Crooked Smile", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "meleni smith", "j cole"], "artist": "j cole", "lyrics": "\n"}, {"title": "Let Nas Down", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "elite", "j cole"], "artist": "j cole", "lyrics": "Freedom or jail, clips inserted, a baby's bein' born\nSame time my man is murdered; the beginning and end\nAs far as rap go, it's only natural, I explain\nMy plateau, and also what defines my name\nYeah, long live the idols, may they never be your rivals\n'Pac was like Jesus, Nas wrote the Bible\nNow what you 'bout to hear is a tale of glory and sin\nNo I.D. my mentor, now let the story begin\nI used to print out Nas' raps and tape 'em up on my wall\nMy niggas thought they was words, but it was pictures I saw\nAnd since I wanted to draw, I used to read them in awe\nThen he dropped Stillmatic, rocked the cleanest velour\nFast forward, who'd a thought that I would meet him on tour\nI'm earnin' stripes now, a nigga got Adidas galore\nBackstage I shook his hand, let 'em know that he's the man\nWhen he said he was a fan it was too hard to understand\nNo time to soak up the moment though ‘cause I was in a jam\nHov askin' where's the record that the radio could play\nAnd I was strikin' out for months, 9th inning, feelin' fear\nJeter under pressure, made the biggest hit of my career\nBut at first, that wasn't clear, niggas had no idea\nDion called me when it dropped, sounded sad but sincere\nTold me Nas heard your single and he hate that shit\nSaid, \"You the one, yo, why you make that shit?\"\nI can't believe I let Nas down\nDamn, my heart sunk to my stomach\nI can't believe I let Nas down\nI got defensive on the phone\nResentment was in my tone, fuck it\nLong live the idols, may they never be your rivals\n'Pac was like Jesus, Nas wrote the Bible\nNow what you're 'bout to hear's a tale of glory and sin\nNo I.D. my mentor, now let the story begin\nI couldn't help but think that maybe I had made a mistake\nI mean, you made \"You Owe Me\"\nDog, I thought that you could relate\nBut while I shot up the charts\nYou mean tellin' me that I was not up to par\nWhen I followed my heart\nGranted, my heart was tainted\nBy my mind that kept on sayin'\n\"Where's the hits?\" You ain't got none\nYou know Jay'll never put your album out without none\nAnd, dog, you know how come\nLabels are archaic, formulaic with they outcome\nThey don't know, they just study the charts\nMe, I studied the shows, the fans, study they hearts\nI had a feelin' I was killin', and this music we were spillin' out\nWould change lives forever, fuck the label, put it out\nFriday Night Lights blew, that was classic number two\nNow it seemed as if the Nas comparisons was comin' true\nStill no release date from the label, are they insane?\nGucc told me play the game to change the game\nBut on the way I let Nas down\nI got no one to blame\nI'm ashamed, I let Nas down\nBut this is God's plan, you can never understand, fuck it\nLong live the idols, may they never be your rivals\n'Pac was like Jesus, Nas wrote the Bible\nNow what you're 'bout to hear's a tale of glory and sin\nNo I.D. my mentor, now let the story begin\nI always believed in the bigger picture\nIf I could get them niggas to listen outside my core\nThen I can open the door\nReintroduce them to honesty, show 'em that they need more\nThe difference between the pretenders and the Kendrick Lamars\nAnd so, I took the fall\nLike the son of the Lord on the cross\nDyin' for that fake shit you niggas bought\nFor the past decade\nIf I should pass, please let this be my last essay\nTherefore I write from the heart\nApologies to OG's for sacrificin' my art\nBut I'm here for a greater purpose\nI knew right from the start\nI'm just a man of the people, not above but equal\nAnd for the greater good I walk amongst the evil\nDon't cry, Mama, this the life I choose myself\nJust pray along the way that I don't lose myself\nThis is for the nigga that said that Hip-Hop was dead\nI went to Hell to resurrect it\nHow could you fail to respect it?\nLetting Nas down, I got the phone call\nQuietly I mourned, dog, I let Nas down\nYeah, and on this flight\nMay I never lose sight, fuck it\nLong live the idols, may they never be your rivals\n'Pac was like Jesus, Nas wrote the Bible\nNow what you just heard's a tale of glory and sin\nNo I.D. my mentor, now let the story begin\n\n"}, {"title": "Born Sinner", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "james fauntleroy", "j cole"], "artist": "j cole", "lyrics": ""}, {"title": "Born Sinner [Booklet]", "year": "2013", "album": "Born Sinner ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": ""}]