[{"title": "The Climb Back", "year": "2020", "album": "Lewis Street ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Are you doin' this work to facilitate growth or to become famous?\nWhich is more important?\nGetting or letting go?\nYou can do anything, anything you can do (You can do anything)\nYou can do anything, anything you can do (You can do anything)\nEverything come back around full circle\nWhy do lies sound pleasant, but the truth hurtful?\nEverybody gotta cry once in a while\nBut how long will it take 'fore you smile?\nThis is that come-back-to-life shit\nMy niggas pick me up and we gon' light the city up as if the sun had the night shift\nAnd paint the town red for my nigga found dead too soon (Bitch, I'm back out...)\nYeah\nTo the left of that decimal, I need seven figures to play the joint\nTurn up your decibels, peep how I decimate a joint\nCheck out my projects like them workers that Section 8 appoints\nAnd you'll see how I flipped like exclamation points\nMy niggas shoot first as if they never played the point, more two guards\nEnough straps to fill four U-Hauls\nMore death than World War II caused\nAround these parts we pour the brown just to drown these thoughts\nOf black corpses in county morgues, Lord, those images hauntin'\nI ain't been asleep yet, it's ten in the mornin'\nI'm sendin' a warnin', a problem with me is like the BET Hip-Hop Awards\nI'm startin' to see you niggas don't want it\nI'm sick of this flauntin', from niggas I know for sure ain't got mo' dough than Cole\nTrash rappers, ass backwards, tryna go toe-to-toe\nWe laugh at ya, staff strapped up on top the totem pole to blast at ya\nBassmasters, look how they tote a pole\nGotta know the ropes and the protocol\nOr they gon' for sure blow your clothes half off like a promo code\nMade a lil' tune called \"Foldin Clothes,\" and a nigga still ain't known to fold under pressure\nWell, you know what Cole do\nMake a diamond, they just rhymin', me, I'm quotin' gold\nOne phone call get you canceled like a homophobe in this PC culture\nAddress me as the G.O.A.T. like they call Chief Keef Sosa\nIn my sectional like a fuckin' three-piece sofa\nI'm known as the chosen one\nAnother dead body lay frozen, that's how it go sometimes\nWhen niggas weighin' coke and not the pros and cons\nWell, I ain't with that sleepin' underground like a gopher, so I go for mines\nEverything come back around full circle (Nigga, gotta go for mines)\nWhy do lies sound pleasant, but the truth hurtful? (Yeah)\nEverybody gotta cry once in a while\nBut how long will it take 'fore you smile?\nThis is that come-back-to-life shit\nMy niggas pick me up and we gon' light the city up as if the sun had the night shift\nAnd paint the town red for my nigga found dead too soon\nNow I know why they call it blue moon (Yeah)\nSurvival at all costs, every day, niggas get logged off\nBodies get hauled off\nPassin' a funeral procession while holdin' my breath in the car, I thought\nAt times, it be feelin' the devil be winnin' but do that mean God lost?\nJust got off the phone with my nigga, he back in the kennel, my dog lost\nI brought him 'round close to me before but he\nBecame addicted to clout and all the hoes we'd meet\nI slowly peeped jealousy on his breath whenever he spoke to me\nLike on the low, he feelin' that in my shoes is where he supposed to be\nI tried to ignore the signs, but they're in the back of my mind\nIt felt like lettin' a nigga come sleep on your couch and he eatin' up all yo' groceries\nMy nigga repeated this quote to me, I felt its potency\nSaid, \"Most of these niggas gon' hang themselves, just give 'em the rope and see\"\nShit, I heeded that, and what got showed to me\nWas screamin' that, some niggas, you gotta leave 'em back\nUnfortunately we seen the trap\nNiggas be on that demon clock resultantly\nThey fiend to clap as often as the Genius app misquotin' me, uh\nMeanwhile, I see that yo' diamonds is glistenin'\nI'm glad that you shinin', but need I remind you my niggas is dimin' and nickelin'?\nScrapin' up whatever coin they can find, the pettiest crime, they committin' it\nJust to get by for a limited time, the steepest of mountains, they tryin' to climb\nI'm here tryna find the derivative, you niggas don't feel me\nYou see the clout, you don't see the real me\nIf I was sick, you niggas wouldn't heal me\nTherefore I'm healin' myself, gettin' in tune with my God\nSlowly revealin' myself, buildin' my wealth\nA nigga touch mine, I'ma kill 'em myself, trust me\nEverything come back around full circle\nWhy do lies sound pleasant, but the truth hurtful?\nEverybody gotta cry once in a while\nBut how long will it take 'fore you smile?\nThis is that come-back-to-life shit\nMy niggas pick me up and we gon' light the city up as if the sun had the night shift\nAnd paint the town red for my nigga found dead too soon\nNow I know why they call it blue moon (Yeah)\nBitch, I'm back outside, nigga\nI'm back outside\nI'm back outside\nBitch, I'm back outside\nEverybody mentions suicide prevention\nMan, they even made a hotline\nTo call up when there's tension, but I got a question\nWhat about a fuckin' homicide?\nNeed a number for my niggas to call\nWhenever there's a urge to get triggers involved\nNeed a number for my niggas to call\nWhenever there's a urge to get triggers involved\n\n"}, {"title": "Lion King on Ice", "year": "2020", "album": "Lewis Street ", "writers": ["t-minus", "j. cole", "j cole"], "artist": "j cole", "lyrics": "Your every kiss, your every touch\nI got blood on my hands, I ain't gon' lie\nI got mud on my shoes, I ain't gon' lie\nI got real, real big plans, I ain't gon' lie\nGot a whole lot to prove, I ain't gon' lie\nI got blood on my hands, I ain't gon' lie\nI got mud on my shoes, I ain't gon' lie\nI got real, real big plans, I ain't gon' lie\nGot a whole lot to prove, uh\nSip from the bottle for shit that we bottlin' in\nGoin' live, but we not on the 'Gram\nThis the land of supply and demand\nWhere my young niggas choppin' up grams\nAnd them choppers won't pry from they hands\nPackin' lead like they got a exam\nIf it's beef, my niggas look just like homewreckers\nThey got they eye on your mans\nI pray to God that it jam\nToo many done died in these parts\nSo we gotta be smart if we tryna see August\nSome niggas won't make it past summer regardless\nI'm tryin' my hardest to stack my deposits\nThese niggas be lookin' at me like I got it\nDeep down inside, though, I still feel as broke\nAs that nigga who just graduated from college\nScrapin' up change that got left in my pockets\nI'm tryna make nickels turn into a dollar\nRidin' the train, way too shy to go holler\nJust watched her get off at her stop, I'm a coward\nFuck it, though, you got a way bigger target\nI'ma do it so big, they won't know what to call it\nSound like a whole Lambo' truck in my stomach\nBitch, I ain't hungry, this feeling is starving\nGotta move mama from out them apartments\nGotta put 'Ville on the map, we forgotten\nGotta hit hoes you hang up in your locker\nGotta get rich, 'cause my granny picked cotton\nGotta make hits, 'cause if not, then I'm floppin'\nGotta stay me in the process\nNiggas dissed me, it was nonsense\nI sat 'em down like his father\nMy nigga asked, \"Why you bother?\nWe should've caught him and mobbed him\"\nI said, \"We gotta move smarter\"\nDon't wan' be the reason for one more sad song\nI tried to warn niggas they wouldn't last long\nI hope that you see how they came and they went\nThey shots never hit, but they made they attempts\nMay have a good year like that name on the blimp\nBut you know what it takes to be poppin' this long?\nDedication on another level niggas never seen in they life\nCelebratin' all your first downs like they touchdowns bring a price\nYoung Simba had the bustdown, yeah, the Lion King on ice\nNiggas wanted me to look the part, had to stop takin' advice\nPut the jewelry to the side, had to find me, had to find God\nHalf the time, we be pacifyin', what they expect from us?\nBut that's treacherous, that shows less of us\nI need y'all to see every part of me\nEvery scar and every artery\nEvery story that I can recall, then I can fall\nI got blood on my hands, I ain't gon' lie\nI got mud on my shoes, I ain't gon' lie\nI got real, real big plans, I ain't gon' lie\nGot a whole lot to prove, I ain't gon' lie\nI got blood on my hands, I ain't gon' lie\nI got mud on my shoes, I ain't gon' lie\nI got real, real big plans, I ain't gon' lie\nGot a whole lot to prove, I ain't gon' lie (Uh)\nLately, I reflect on the times a nigga was low\nI got it up off the floor, I'm stronger than ever before\nI'm stronger than ever before just like I planned to be\nThey wanna see me fold, it ain't no thang to me\nThoughts when I was broke, if only I could be\nPockets holdin' hope, it ain't no thang to me\nAt night, I hit my knees, I prayed for better days\nThen found a better me, I got my head on straight\nUp, up, and away, just ridin' my wave, I ain't never gon' say nothin'\nNigga throw a shot my way, I just jot down names, ain't never gon' say nothin'\nKnow you be stressin', hate only block your blessin', I'm never gon' say nothin'\nQuit all that flexin', niggas live check to check, I'm never gon' say nothin'\nKnow that it's destined\n\n"}]