[{"title": "Intro (The Come Up Vol. 1)", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Ladies and gentlemen, I present to you the story of a young man who left everyone and everything he loved to chase his dream. A lil' nigga from North Carolina, Fayetnam to be exact. Packed up all his shit and moved to the big city of dreams, where he ain't know a motherfuckin' soul, and he ain't have a motherfuckin' thing, just a dollar and a dream.\n\nThis mixtape is provided partly in part by, Dreamville Records. Straight out the Ville where anything's possible. All-terrain music, that's Carolina's finest boy. And by any means, when ain't shit handed to you, you gotta take it. Without further ado ladies and gentlemen I proudly present to you, J. Cole, The Come Up.\n\n"}, {"title": "Simba", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Straight out The Ville and I made it\nLike a villain I'm hated\nI see 'em grillin', I ate it though\nFinna blow inflatable, that's undebatable, uh\nI'm givin' niggas food for thought, the flow is catered, yo\nI'm never faded though\nHaters wanna see me broke, but me and the dough related, ho\nIt's like my only son, where I go, he come\nNiggas dumb to be braggin' bout that stupid shit\nNah I don't stunt on niggas, I show'em how to do this shit\nI'm somethin' like the light-skin version\nOf the very same baby that The Virgin Mary raised\nThat's word to everything\nNigga life a scary game but I'm playin'\nYou sucka niggas lie in everything that ya sayin'\nShame on y'all, you tryna ball with the game on pause\nA nigga pull the thing on y'all, y'all stain y'all draws\nFuck you niggas, but this ain't raw dog\nI got protection, lethal weapons, and they aim on y'all\nI'm like the man on mars; I'm high as hell\nWatch me blow like I exhale, I excel in this rap shit\nCause y'all spittin' that wack shit\nAnd every nigga suddenly be rappin' bout that trap shit\nSo while you niggas copy cat the cats that made classics\nI just massacre the streets, I'm a master of the beats and the rhymes\nI'm rappin' for the freaks and the dimes\nAnd I shine like a mothafuckin' diamond\nYou shine like a mothafuckin' dime\nThat's word to my mom\nI don't mind if you niggas hate\nJust know you hatin' on that nigga, nigga get it straight\nI'm spittin' hungry like ain't shit up on my dinner plate\nThe kind a flow that make a nigga hyper-ventilate (ugh)\nSee let me demonstrate\nI grew up with nothin', it hurt me to see my mother poor\nThe only pops a nigga ever seen around was Huxtable\nAnd so the muscle flow is something you can't get no muzzle for\nLook how the buzz will grow\nBallin' 'til the buzzer blow\nMan I'm hungry, does it show?\nAin't nothin' funny, fuck a joke\nI'm gettin' money til my pockets need a tummy tuck\nI hope you niggas woke now, impermanentely\nSend you to hell, you meet the devil, sign a permanent lease\nWord on the streets is I'm the prince nigga, check the splendor\nAnd I can't wait to be the King, nigga: young simba\nWord on the streets is I'm the Prince nigga, check the splendor\nAnd I can't wait to be the king, nigga: young simba\n\n"}, {"title": "I’m the Man", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "He gonna have the nerve to fucking tell me niggas from the south can’t spit?\nBitch I’ll smack your dumb ass\n(Fayettenam what up? Carolina what up?)\nStupid ass mother fuckers (New York, what up? Queens)\nI'ma quit talking shit and about show y’all\nI told y’all niggas that I’m getting my bread and going home\nI'ma show you all stupid ass motherfuckers (Coming soon, nigga)\nDumb ass niggas\nThe heir to the throne\nSouth nigga bred to the bone\nBut haters say he fled from his home (Please)\nNow picture that, I was 18 with million dollar dreams (Yeah)\nMoved to Jamaica Queens, like Prince Akeem\nBut ain’t looking for no queen, (nah)\nCame to get my c.r.e.a.m. (yup)\nCity on my back, I just lift my wings, I’m fly\nYou niggas on my dick, why lie?\nThought them niggas from the south couldn’t spit, voilà\nI’m here. humble out of respect, not fear\nSo please be clear, nigga please beware\nI’m a motherfucking monster, B.S. me? (Nah)\nNo, my hand game like fucking PSP\nNow pop the champagne, money is coming soon\nMy dick do the damn thing, honey it’s cumming soon\nShe jerking, bend her over, now she hurting\nLiving reckless got me thinking of death, look how she flirting\nWell, fuck that bitch, man a nigga tryna breathe (Yeah)\nSome of these niggas be tryna dick her down and leave\nRest in peace, y'all boys living too fast\nCaught up in the cash, and got shot up in a flash\nVille niggas don’t play\nWhen it comes to that money, think real niggas won’t spray?\nMid-day when it’s sunny, they kill niggas broad day\nOn some old new jack shit\nThis rap shit is like tag nigga you not it, so run\nHa ha ah\nI’m the man, ha ha ha, yeah, hey\nI’m the man\nI’m the man, (I told y'all niggas)\nI’m the man\nYeah, uh\nThey say I act like I’m the man, 'cause motherfucker I am\nNiggas study my style, I should be giving exams\nDamn boy I'm so flamboyant with the ensemble\nPolo jacket, polo tee, what a fine combo\nAnd I’m the man, now understand a nigga bossin’ (Yeah)\nScheming on that drop top CL but it’s costing (Yeah)\nLong term plans for the fam, we’ll be golfing\nNever catch a nigga double-crossing, unless i’m flossing (Woo)\nIn the streets niggas peaceful until you force em'\nTo quarter back them bullet passes, you could Randy Moss ‘em\nGoddamn you niggas got handled\nNiggas only publishing, my style got sampled\nSo I switched like a thick bitch with some heels on\nI seen a nigga get popped, I feel for ‘em\nI know who did it, but you think I’m finna squeal on him?\nShout out to R.J. Hill I would kill for him\nThat’s word, nigga observe my genius\nE&J sipping got a nigga straight leaning\nMy DNA dripping while your girl stay drinking (Haha)\nI told y’all I’m the man, what the fuck y'all niggas thinking?\nHa ha ah\nI’m the man, ha ha ha, yeah, hey\nI’m the man\nI’m the man, (I told y'all niggas)\nI’m the man\nYea\nFirst and foremost, Fayettenam what’s good?\nCarolina, what up? Bull city, Raleigh, Charlotte, Salem\nGreensboro, Wilmington, nigga\nEverywhere dog, I’m reppin' from long distance, man\nI told y’all boy, I’m bout to get this money and come home right quick\nY’all niggas still see me tho, you think I’m still there; you ain’t even know I’m gone\nBack so much, nigga\nI hear you all little niggas talking, nigga\nPrince of the city, nigga\nPrince of the south, nigga, holla at me\nYa know? Heir to the throne, bitch\n\n"}, {"title": "School Daze", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah...\nTake ya'll back... to them school days, yeah\nFayettenam, what up, man?\nWe came a long way from stick and move\nNiggas skipping school, just to scrap over bullshit\nNigga if you lose, it's a wrap, them hoes clowning\nIt goes down in the lunch room\nI'm tryna spit this game nigga, fuck food\nBust moves to the hallway\nMy niggas posted on the wall, always\nAin't thinking about class, dog, my ass tryna parle\nIf we had this shit our way\nWe be standing here all day\nBut look the principal's coming, give pounds then we all escape\nAll late to class with fake passes\nLiving life in the fast lane, but ain't passing\nThey dreaming, tryna be the next Jay-Z and Dame Dashes\nI ain't even open my book and it's time to change classes\nWalk straight past my ex and don't speak\nIt's all good, I'll probably have a new ex by next week\nI just think, the shit we did was silly, yo, I know that\nBut what I wouldn't give to go back\nYeah, back in the days when I was young, I'm not a kid anymore\nBut some days I sit and wish I was a kid again\nYeah, I sit and wish I was a kid again\nYeah, I sit and wish\nYo, I walk another nigga girl to her class, with my hand on her ass\nIf he say 'what up' later, I just laugh\nReal sneaky yo, gotta keep it low\nUp in math, let my nigga read this real freaky note Kiki wrote, yea\nHooping up in P.E. you can't see me on this gym flo'\nBut damn Vanessa booty looking sick up in them gym shorts\nUh, we bag 'em up, ya'll niggas gonna have to wait\nSo they passing hate like, 'Damn I can't wait 'til they graduate.'\nBut some of my niggas will probably never make it\nThe S.A.T. shit man I doubt they ever take it, cause\nInstead of tryna send a nigga to a tutor\nThem guidance counselors tryna introduce us to recruiters, it's a set-up\nMomma cut the light on, time to get up\nMake sure the shirt matching the forces then I head out\nAt the time I thought this shit was so whack\nBut what I wouldn't give to go back\nYeah, hey\nYeah, back in the days when I was young, I'm not a kid anymore\nBut some days I sit and wish I was a kid again\nYeah, I sit and wish I was a kid again\nYeah, I sit and wish\nI'm a little grown, but still reminisce\nClose your eyes nigga, you remember this?\nFriday night football game, something I'll forever miss\nAfter parties in the gym, grinding underneath the rim\nYou forgot your school I.D? Fuck, nigga, you ain't gettin' in\nIn the hallways acting like some hoodlums\nSee that scrap? Naw, damn I always miss the good ones\nThem rumors spreading fast with that he say she say\nTwenty people on the phone cause everybody did three-way\nMan we played them girls for the fools, but\nWasn't no ladies like them ladies from other schools\nCause seeing them same old chicks got tired quick\nShe was just fucking my boy, now she all on my dick, gossip, damn\nAnother chick pregnant, another nigga gone\nI reminisce on all the chicks a nigga never bone\nPardon me ya'll I'm just flipping through some Kodaks\nSitting, wishing I could go back\nYeah, back in the days when I was young, I'm not a kid anymore\nBut some days I sit and wish I was a kid again\nYeah, I sit and wish I was a kid again\nYeah, I sit and wish\nYeah, this shit is dedicated to all my niggas man\nR.J., Mike Shaw, Jim Brown, yeah\nB. Nasty, Big Joe, Smitty, what's good? Yeah\nTerry Sanford High School, E. Smith\nClass of 2003, that's me\nI know y'all remember this\n\n"}, {"title": "Dolla and A Dream", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "For all my ville niggas man\nAll my Carolina niggas man, (lights off and shit)\nAll my real niggas, no matter where you come from\nA dolla and a dream, thats all a nigga got\nSo if its about that cream, then I'm all up in the spot\nI was raised in the F-A-Y (why), a nigga never gave me nothing?\nPops left me, I ain't never cry, baby, fuck him, that's life\nAnd trust me I'm living, look what a nigga made out\nThe shit that I was given, look what a nigga came out\nMomma sewing patches on my holes\nMan, our hoes couldn't put this flame out\nStraight up, I got my back against the brick wall\nI'm from a world where niggas never pop no Cristal, it was pistols\nYou pass through, you better pray them bullets missed y'all\nI thank the Lord, He let a nigga make it this far\nA lot niggas don't, a lot of moms weep\nI gotta carry on, all the weight is on me\nYou never know when a nigga might try to harm me\nRest In Peace that nigga John Lee, I pour liquor, homie\nIt's foul, but yo the world keeps spinning\nGotta keep winning, get up off this cheap linen\nNigga I'mma eat, even if it means sinning\nNiggas want beef, I'mma sink my teeth in 'em\nPause, I go harder, I am all about a dollar\nYou niggas street smart? I'm a motherfucking scholar\nSo trust me, I ain't stopping 'til my money is long\nSo much dough, them hoes will think I'm rocking money cologne\nHave a model at the crib waiting, \"Honey, I'm home.\"\nCooking greens for a nigga, give 'em plenty, a dome\nIt's funny, we dream about money so much its like we almost got it\nUntil we reach up in our pockets, its time to face reality\nThe ville is a trap nigga now\nAnd if you ain't focused you gonna be here for awhile, yeah\nMy nigga Mike rolling with me, riding shotgun\nType a nigga know about every car, but don't got one\nThat's hunger, no wonder niggas fucking with the evils\nPosted on the corner, selling crack like its legal\nBut who am I to judge how a nigga get his paper?\nThis money coming soon, dog, I'm tryna get my cake up\nI guess I gotta wake up these niggas myself\nAn E&J sipper, but my shit is top shelf\nYoung J, the rawest shit you niggas ever heard of\nA journalist nigga, call me the Fayetteville Observer\n\nYou know the routine, man\nFayettnam\nReal niggas can relate\nAnd Ville niggas can relate, man\nMy niggas know about the struggle, man\nWhat you know about your momma sewing patches on your holes, nigga?\nI had the light blue jeans with the green patches, haha, oh shit\nI was in like first grade man, I swear\nIt was like the Sixes came out, the Jordan Sixes\nThem shit was so fly man, I wanted them so bad\nDarryl what up man?\nMy nigga Darryl had them shits on in class yo\nI wanted that shit so bad\nI begged my mom for that shit, you know\nBut she couldn't afford it, yo, she gave me\nGot me some Reeboks black tops, ahaha\nBut that was all good tho, cuz uh\nThe year after that I had, I had some, some no name shits\nSome all black shits, haha\nThem shits had metal, metal shoelace buckles and shit, you know?\nBut you know back then niggas didn't\nNiggas ain't even know he was broke man, no worries and shit\nBut uh, times have changed man, I got bills\nMy mom is in debt, what you know about that?\nCollege loans and shit, nigga\nGotta get this money, ma\n\n"}, {"title": "Throw It Up", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah yeah, uh yeah\nYeah yeah\nCarolina, nigga\nFayettenam, nigga\nYeah\nIf you a down south nigga, throw it up, (and)\nIf you an east coast nigga, throw it up, (yeah)\nIf you a west coast nigga, throw it up, (ay)\nIf you a mid-west nigga, throw it up, (ay)\nIf you a Fayettenam nigga, throw it up, (yeah)\nIf you a ATL nigga, throw it up\nNew York to L.A. niggas, throw it up\nYeah, Chi-town throw it up (yeah)\nIf you a down south nigga, throw it up, (and)\nIf you an east coast nigga, throw it up, (yeah)\nIf you a west coast nigga, throw it up, (ay)\nIf you a mid-west nigga, throw it up, (ay)\nIf you a Fayettenam nigga, throw it up, (yeah)\nIf you a ATL nigga, throw it up\nNew York to L.A. niggas, throw it up\nYeah, Chi-town throw it up (yeah)\nThrow it up nigga!\nThrow throw it, throw it up!\nYeah!\n\n"}, {"title": "Quote Me", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "J. Cole\nHaha uh\nYeah, uh\nYeah, Yo\nBear with a nigga man\nGotta a little head cold, ya know?\nI'll still kill it nigga\nShow y'all niggas how it do\nReal Quick\nUh You know what they say;\nThe window to the soul is in the eyes\nSo disrespect a nigga, I will close a nigga blinds\nYeah who can hold us? Super focused\nShoot them hoes with the Super Soakers\nI got 'em so wet\nFuck that Moet, I'm Hennessy drinking\nWonder what my enemies' thinking\nNervous? nigga, please\nI'm finna be caking with dough-\nSo much bread, its like a nigga be baking\nWatch so cold, it's like the shit will need blankets\nMoney coming soon, tell my niggas be patient\nWe gonna replace those whips with some sicker ones\nWe gonna erase them chicks for some thicker ones\nHit and run, bigger funds\nBut still can't forget to pour liquor\nAs I reminisce on them niggas that couldn't come\nRest in peace, can't control another man's destiny\nSo I do what's best for me\nI know you fake niggas well, ain't no test to me\nOn my plate is a meal, ain't no recipe for that\nSo nigga chill or the tec will speak, \"Blaaat!\"\nThem niggas will put you chest to feet\nI'm talking reckless\nWhat you expect nigga, I'm flexing\nY'all dyslexic, got a nigga twisted\nNever shot a nigga, I don't gotta get convicted\nCause if I say the word, your whole squad is getting lifted\nWhat up then? Niggas ain't saying nothing? Shut up then!\nWouldn't last a minute in the city I grew up in\nWhere I got my swag, cool as the breeze is\nChip on my shoulder, I walk like I'm Jesus\nAbout that paper, we could give a fuck if you believe us\nLooking for model divas that barely speak English\nFuck 'em while we rich, cuz when we broke, they gonna leave us\nWe earn stripes, looking like zebras\nY'all looking like Adidas\nWe do it for the streets, cuz they need us\nGot beef? Come meet us\nOk I thought so\nY'all niggas are so mad cuz I floss so bad on bitches\nAnd with this stroke, I'm Picasso\nMake her stomach feel the fossil\nNow she yelling out God so much thought I had her singing gospel\nShit, shout out to my apostles\nYa know me\nNicest nigga in the south\nYea you can quote me!\nWooo Shit!\nHaha\nOoooh Shit, mother fucker!\nHahaha\nOohh Shit\nAnd I'm sick bitch, holla at me!\nYou know!\nFuck boy!!\n\n"}, {"title": "College Boy", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "It's hard to picture a nigga not getting money\nJ. Cole living bummy? Hahaha that shit is funny\nI’m focused on that cash, I just laugh at them bastards\nEligible bachelor, finna get my Bachelor’s\nAnd if this rap shit don’t work, I’m going for my Master’s\nStill scouting hoes on the first day of classes\nKeep up with the asses, keep up with the grades\nA nigga straight A’s like the Braves\nShe got me in her dorm room, talking bout her room ain’t clean\nAnd she wanna fuck, but wait until her roommate leaves\nNow I could give a damn if her roommate seeing\nCuz if the girl get excited, she’s invited. (haha)\nIf it's alright with you, yea, shit, then it's alright with me\nIf it's alright with you baby girl, then it's alright with me, (uh)\nAnd if it's alright with you shawty, then it's alright with me\nHey and if it's alright with you, (yea, yea) then shit, it's alright with me\nYeah, uh, I hate to brag, well naw, I don’t, the big man on campus\nI gotta chick in every class that give a nigga glances\nAnd if your ass is dumb you won’t even get a chance\nCuz I gotta chick in every class that give a nigga answers, yea\nAnd if I hit ya shorty, keep it on the low\nThis shit just like highschool, people wanna know\nI see you haters mad, but I ain’t mad at y’all niggas\nWe get ass like them basketball niggas, I’m ballin’\nGot a sidekick so them hoes don’t be callin’!\nHit me on aim, ay what’s your screen name?\nWhen I start typing in, a nigga’s got some mean game, yea\nAnd when I whip it out, shit she gonna think she seeing things, but\nBack in Carolina I miss home badly, (yea)\nIt’s funny hoes I couldn’t have is tryna bag me\nBut I’m in the Jeep with this freaky ass Aggy\nShe said she want it from the back, gladly\nIf it's alright with you, yea, shit, then it's alright with me\nIf it's alright with you baby girl, then it's alright with me, (uh)\nAnd if it's alright with you shawty, then it's alright with me\nHey and if it's alright with you, (yea, yea) then shit, it's alright with me\nI’m skipping class just to get some ass, living fast\nAnd college with no sleep nigga, my jabs quick as Zab's\nSo kill that old college gangsta shit we dont believe\nYou mad cuz your girl on Facebook poking me, so uh\nYou know the G, I hit her up like “Hello Elle\nI see you looking right the other day, LOL\nSo, what’s good with you?”\nShe hit me right back like “Shit, what’s good with you?”\nYou know I like that, so of course I write back\nHit her with some nice chat\nSame night she in my room, lights off I strike that\nYea I put game right, but that’s your wife, nigga take her\nI bust then I kick her ass out to write a paper, yea (hahaha)\nA nigga doing homework, drinking like a fish\nIt ain’t a weekend that I’m sober\nFighting hangovers on my way to my internship\nAnd I forgot to study for my midterm, shit!\nHahahaha, wooo!\nAy, this is straight through, nigga\nNo, no fucking, no double takes\nThis is straight through the whole shit nigga\nCheck it out man, tryna tell y’all niggas man\nCollege is a good look\nA real good look, my nigga\nFor more reasons than one, man\nKnow they try to keep us out of that shit though\nThat shit like extra expensive\nI got scholarships though, so you know I’m not sweating that\nI feel for my niggas that couldn’t make it man\nAy Mike we in there baby, hahaah\nAy they can’t, they can’t keep us out the G my nigga, you know\nThen we all make it, nah, we ain’t all make it\nShout out to my niggas, man\nAll my niggas, yo\nWhether you graduated or not\nWhether you made it to college or not, nigga\nFayettenam, yeah, yeah\nClass of 2007 man\nHolla at me\nI’m going to grad school though, you know?\n\n"}, {"title": "Split You Up", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, hahaha\nYeah, uh\nYeah, uh\nReal niggas can relate, yeah\nHahaha, Ville niggas can relate, man\nYeah, yeah, uh\nI see you looking at me hard shawty, what it's gonna be?\nBut you right next to your man, don't let him run up on me\n'Cause I see him tryna grill, better take his ass home\nBefore I lay his ass out, then I take ya ass home\nI even gon' front man a nigga tryna cut\nI ain't tryna take his place, I just want to hit you up\nWhen that nigga ain't around I just want to pick you up\nBring you back to the crib, sip a little liquor up\nThen I give you a massage, get you wet, get you up\nThen I give you what you want, if it's clean I lick it up\nNow you can do me, if it's right my shit is up\nFace down on your stomach, take that ass and lift it up\nThen I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n'Cause I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\nI be that nigga on the side when you feel you want to creep\nWhen you in the bed alone why ya man run the street\nAll you got to do is dial, let the phone ring twice\nBaby girl I love your style, I won't even think twice\nI ain't even gonna front, man a nigga tryna beat\nI ain't tryna wife you up, though you is a dime piece\nI just love the way you ride like a certified freak\nHow you throw it right back, got a niggas thighs weak\nSo just hit me when you want it, you know how to find me\nGot no times for no games, you know how the grind be\nBut-I'm a make the time if you bout' it dial me\nI'm a make you say my name like a caller ID\nThen I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n'Cause I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\nGive you money to get ya hair did-he can do that!\nPay for dinner and a movie-yea he can do that!\nWork you out in the bed-maybe he can do that\nBut I know you much rather call me to do that\nAnd girl I'm with it! Haha, yea\nI'm so with it, babygirl I'm so with it!\nSo let me hit it!\nThen I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n'Cause I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n\n"}, {"title": "Plain", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": ""}, {"title": "The Come Up", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "I'm on The Come Up\nChill nigga, don't run up\nA yellow nigga, finna rise and shine like the sun up\nMy mind on that paper, I ain't trying to wife the slut up\nI'm dying for this cake and I ain't trying to wipe a crumb up\nThey ride with the gun up, kill you and light the blunt up\nUh, don't shed a tear if a nigga might get done up\nBut, just say a prayer if a nigga might confront us\nCause his life is summed up, the medics wipe his lungs up\nYou coming to the 'Ville? You need to get a license from us\nCity on my back, I feel like I'm holding Big Pun up\nNo pain no gain, my nigga, I just numb up\nI blow brains, Cobain a nigga if he jump up\nWith no shame, don't blame a nigga if you shot up\nThis is cocaine on flame, baking soda and water\nAnd if you feel that then I guess I sell crack, get it?\nFall back, man, a nigga feeling crazy\nShitting on niggas like a nigga was still a baby\nCarolina nigga shout-out to the 'Ville that raised me\nSo many hoes whipped, you would've thought we still in slavery\nAnd niggas still sleepin' they feelin' lazy\nUh, a killer maybe, you make me I will\nCheat me on my scrilla, I send you to meet Dilla\nFrom them NC streets where the beef they deliver\nAnd the clip is on E cause your chest got a fill up\nWhile a nigga like me is just getting head like a pillow\nBread like gorillas getting bred\nSo long as my momma and my niggas getting fed\nFuck what a nigga said, man, I'm Fayettenam bombing\nCause hatred is flattery you bitch niggas is charmin'\nWho the fuck you harmin'? Boy, ya'll niggas is charmin'\nAnd I'm armed and waiting for a target\nYou fucking with the best like Carmen\nAw shit, pardon a nigga for departing\nI'm just getting green like a yard or a garden\nA nigga finna blow while you niggas is false alarmin'\nAnd just think, man, I was raised on ramen -- chicken noodle soup\nNow I'm filet mignon-in'\nI promised my momma I was coming to make this money\nAnd I swear I'm going to kill the nigga that try to take it from me\nYeah, that's real talk, nigga\nIt's J. Cole, nigga\nTherapist whatever the fuck you wanna call him, it don't matter\nYou know, I'll make y'all niggas understand man\nI know you can't believe yourself right now\nYou thinkin' this niggas from the south, hahaha\nHe can't spit, how the fuck is he so good?\nOpen your eyes motherfucker, can you see? Niggas on top\nYup, we on top\n\n"}, {"title": "Mighty Crazy", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "You niggas gotta be outta your rabbit ass mind\nA savage over this cabbage\nYou really think I'm finna let your faggot ass shine? (No)\nWhipping niggas like big body Cadillacs\nI'm on my grind, yo, bonafide honcho\nI could see through you niggas with cataracts, blindfolds\nMatter of fact, I'm so bomb, niggas scatter that\nNiggas that, Niggas so rat, Niggas better act pronto\nMy whole state in a reign, better pack ponchos, y'all know\nShit is real in the ville, you could die slow or quick\nSurvival's a bitch\nBut everybody don't meet her, so tuck the nine yo\nWherever y'all roll, niggas allergic to 5-0\nGod knows I don't put up no facade, no\nNo fraud, niggas scheming like Sideshow Bob\nKeep my eyes so wide, nothing otherwise\nDisrespect me, you could watch your mother sigh\nFrom the other side, punk-ass nigga\nJump and get lumped fast, throw you in the trunk\nBlast pop while I pump gas\nSkunk ass niggas is trash, you need a sponge bath\nMy niggas will ride all day like a fun pass\nThat's some New York shit, I'm from the south, though\nDon't never disrespect me out yo mouth, ho\nI got major clout though, y'all niggas dissin' me is doubtful\nYou talk shit? Watch your life fade like the outro\n\n"}, {"title": "Dead Presidents", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Let me try this\nUh, Yeah\nMoney coming soon\nI'm out for Presidents to represent me\nOmen what up nigga?\nYea niggaaaa, yea, uh\nGimmie my money, man, why else would a nigga be grinding? (right)\nOut for them diamonds, dog, how else could a nigga be shining?(true)\nI'm glowing, knowing that the flow intact\nGet this record deal, I swear to God, my first 'mil I'm blowing that! (haha)\nLike fuck it I know I'll grow it back, shit, it's nothing\nFunny how blacks spend dough on mad shit for stuntin,'(yea)\nBut shit, that's all we know man, thats how a niggas raised (true)\nYou learn bout two things: getting pussy, getting paid. (uh)\nAnd you should be gettin' laid by the time you in ninth grade\nSo niggas lying on they dick and hoes giving nice brain, yea\nIn class dreamin' bout having these nice things, (uh)\nAnd then you look around and wonder why you strugglin'\nBut them whites ain't. (hmmm)\nI brush it off like, \"fuck it, it's motivation,\"(yea)\nSome niggas gotta walk through life, some niggas roller skating,)\nSome niggas bypassing steps, some niggas chose to take 'em. (yea)\nAnd for that fortune, man, some niggas sold their soul to Satan\nBut fuck it man, I ain't hatin,' I gotta go for mines\nMy little God-sister pregnant now, I put in overtime\nOn my grind, yea, just like the nigga making Folgers\nI'm focused, on my bite, like a cobra, I'm tryna get my Oprah on\nThese hoes is crying cuz I won't pay 'em attention, (nah)\nTime is money, bitch, and a nigga payin tuition, (ahaha)\nReal niggas hustle by using their intuition, (yup)\nWhile these fake niggas ain't into doing, they into wishin,'\n\nYeah\nUh\nI'm out for Presidents to represent me\nI'm talking Benjamins, nigga\nGrants nigga\nFrom Washingtons, man\nTired of those\nYeah!\nTill I'm rich, ain't no reason to settle nigga\nIts greed that make a nigga wink at the devil to get that cheese\nYou niggas couldn't think at my level, even with trees\nYou couldn't get this deep with a shovel, now nigga, please\nI'm chasing G's tryna throw some diamonds on them freeze\nSick shit, sneeze on some thousand-dollar sleeves\nEase to the top and I'm not finna leave till I'm hot\nBut my watch gotta breeze, a south nigga\nBoy, I'm shining without the diamonds in my mouth\nOut grindin' while you reclining on your couch\nI'm climbing, you haters blinded by the doubt\nMy niggas riding is devout, so talking violence out yo' mouth\nAnd you gonna find what I'm about, nigga!\nFar from a slouch, nigga, I ain't gonna parlé with y’all\nI’ll probably hit ya, my hand game like Bobby Fisher\nBut check, them checks is all a nigga thinking\nFor them Presidents, I’ll treat a nigga like Lincoln\n\n"}, {"title": "Lil Ghetto Nigga", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, uh\nUh, yea\nYea, uh\nFayettenam, nigga\nHahaah uh\nCarolina, nigga\nYeah, Yea, let's bring it in\nYea, this is for my niggas in the struggle\nYea, this is for my niggas in the struggle\nUh, uh, uh\nNothing but sweat, tears\nJust another perspective\nYeah\nYo, uh\nLifestyles of the young, black and genius\nSons strapped with guns packed in jeans\nAnd the blunts got my lungs black as Jesus, (yea)\nPlay where killers hung at and slung crack for leisure\nAnd tell a nigga run that get gun clap for sneakers\nYoung niggas emulate what's coming out the speakers\nSo everything we learn came from rappers, not teachers\nCause if we can't relate, then how the hell you gonna reach us?\nSurrounded by crooked cops and preachers, (yea) Who am I trusting?\nNo time to think about illegal when your stomachs touching\nBy any means, nigga, even if the gun is busting\nI see the world for what it is now\nI see the odds is looking slim for our kids now\nCause, uh, it wasn't set up for my people to rise, (yea)\nMy niggas slang, but I see the pain deep in they eyes\nNiggas living like they don't give a fuck\nAnd I don't blame 'em, it's a cold world, live it up! (live it up)\nThe things that I've seen, (seen)\nThe dreams that I dream, (dream)\nThe rain in my sky\nThe pain in my eyes\nBut know that it gets better baby\nHope that it gets better baby\nDon't let this world break you, (you) naw, naw\nDon't let them break you, (you)\nYea, uh\nI look up in the sky, see that ghetto bird circling\nAnd rollers on the block, my niggas on the curb, cursing them, (fuck)\nAnother day in the ville, do I stay in and chill? (no)\nOr go play in the field?\nHelp my mother paying these bills, you tell me, nigga!\nWe young, black, some strapped\nThem whites got they lunch pack for school, we had our guns packed\nAnd all a nigga wanna do is take his momma from that\nBut they'd rather lock us up and make sure we don't come back\nYou kill a nigga over beef and cheddar even better\nJust one less coon they won't have to arrest soon\nFuck a crooked cop three times\nBitch, I'm getting cake and ain't a nigga finna eat mine\nThat's why a nigga looking like a street sign, (yea)\nPosted on the corner 'til it's sleep time\nWake up and it's feeling like somebody hit the rewind, (why)\nCause them ghetto birds circulate, my niggas still cursin em\nAnother day in the city, my niggas say it with me, yea!\nThe things that I've seen, (seen)\nThe dreams that I dream, (dream)\nThe rain in my sky\nThe pain in my eyes\nBut know that it gets better baby\nHope that it get better baby\nDon't let this world break you, (you) naw, naw\nDon't let them break you, (you)\n\n"}, {"title": "Homecoming", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Uh, yeah\nUh, uh-huh\nYeah\nI'm I-95 cruising, the sun in my eyes\nHeaded south, dog, my mom ain't seen her son in awhile\nYea, I'll sure is\nCan't wait to see my niggas and fuck with my old chicks\nCan't wait to cruise the city, be catching them old grins\nSame niggas, same place, doing the same old shit\nYea, so nigga watch it!\nA nigga been in NY tryna get some bigger pockets\nYou still up in the ville, tryna make it in the trap\nI'm finna put us on the map; I told you I was coming back, Cuz\nYeah, so make way, the prince of the city, ain't a street I can't stay\nYou niggas is hatin,' just be happy I ain't changed\nBlunts rolled to the murk, we all want the same thing\nAnd that's- money to feed us, yup\nWe pray to God, but, we ain't tryna meet Him yet, haha!\nYea, If I never..\nNigga, man\nActually that is a bad idea, my nigga\n'Cause, uh\nNah nah nah\nNow I'ma always come home\nIts where a nigga was grown\nWhere a nigga was shown\nHow to scrap, yup\nShown how to mack, yup\nWhere my niggas sold a whole lot of crack, yup\nJuggling them hoes\nThere was a whole lot of that, yup\nMomma work to the bone, puttin' clothes on my back\nI'm comin' home to give everything I owe to her back, yea\nYeah, I swear they say, man\nYeah, yeah\nShout to the whole ville!\nOf course, so real!\nUh, If I never- if I never went home again\n\"Hello? Chill out nigga, what's up, boy?\nYeah, I just touched down man\nI'm over off Ramsey and shit\nAiight, well look\nI'm about to go check out my mom's man\nWhat's jumping for tonight?\nOh the Live? I'm in there, nigga\n\n"}, {"title": "Carolina On My Mind", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "curtis mayfield", "j cole"], "artist": "j cole", "lyrics": "Yea Yea, uh\nIt's Carolina, nigga\nYeah\nAy\nFayettenam\nYeah!\nListen, alive and still kickin nigga\nI survived the ville\nBut a lot will not, so they wield Glocks and Bonnevilles\nNiggas lying, still get high, they ride and kill\nMoney hungry, tryna find a meal\nCan't stay inside and chill\nLittle niggas thinking: 'fuck school, I'm finna sign a deal!'\nHunting hoes, trapping niggas\nLying like they on the pill\nPreachers say we blessed\nBut all we feel is stressed, tryna deal\nIf this liquor don't help, nigga, this marijuana will\nRoll up, I take a shot for them niggas behind the steel gates\nMy mind is still- racing, I'm tryna kill- snakes\nCause niggas is fake, but wait, time reveals so\nNevermind, that real shit is what I am tryna build\nIt's kinda ill how I'm giving y'all that Carolina feel\nA nigga so deep, you tryna find me dog, you gotta drill\nIt's kinda ill how I'm giving y'all that Carolina feel\nA nigga so deep, you tryna find me dog, you gotta drill\nYeah\nYo, Coming home, y'all\nListen\nAt any given time, got the city on my mind\nThe city on my mind\nThe city on my mind\nI'm riding round feeling like the city, it is mine\nThe city, it is mine\nThe city, it is mine\nAt any given time, Carolina on my mind\nCarolina on my mind\nCarolina on my mind\nSaid \"I feel ya pain nigga, but I'm tryna go for mine,\"\nI'm tryna go for mine\nI'm tryna go for mine\nHey\nAy, fuck them hoes, let them bunnies be\nPerfect vision I'm 20/20 for this money, G\nSee it's funny, you get that paper, then them honeys show\nCause they know we finna blow, like a runny nose\nMoney goes, the money come\nBarely twenty-one, I'm thinking big things\nMomma in the mansion with the fish tanks\nThe Carolina way\nIf you in college then you know the crime won't pay\nLest you find a way, fuck what them niggas is tryna say\nCause in Carolina- we thorough\nMy niggas hold it down all the way from Fayettenam to the G-boro\nAnd up in Winston, and Raleigh, did I mention?\nThe Bull City got them ol' fake niggas flinchin'\nTar heels state, either you shooting or you hoopin' yo\nNiggas can't wait for them Panthers to win the Superbowl\nSo shout out to them super cold niggas up in Charlotte\nNo matter the city, man, Carolina shine, regardless!\nYea\nYo, coming home nigga!\n"}, {"title": "Can’t Cry", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah\nNeed y’all niggas to feel me, yo\nFeel my pain\nSaid soft niggas can’t last hard times, yo\nBelieve that shit\nYeah, (Yeah) aye (Aye)\nReal niggas don’t cry\nLook, yo\nWas just a youngin’ with that fresh fade\nBird chest, legs skinny\nThat hoop dreaming had me tryna be the next Penny\nFresh pennies on my feet\nMomma paid for everything I’m wearing\nAt the fair staring at girls, not a care in the world\nAw nigga, but shit done changed since Maine was my nickname\nA little nigga chasing things, tryna kick game\nNow I’m a man worried about my fam\nLet me explain\nIt’s like my pockets stay broke, and if not them shit’s sprained\nAnd so I rap for my niggas trapped in the struggle\nYou feeling like the world’s on your back so you stumble\nIn the field like a quarterback get sacked, then you fumble\nJobs don’t call a nigga back, so it’s back to the hustle\nNiggas praying for they moms, the same time they moms pray for them\nAsk the Lord to stay with them, guide them on they way\nBut damn a nigga been a lost faith\nIt hurts on the usual\nThe only time you catch me up at church is a funeral (damn)\nSometimes sunshine turn to rain my nigga\nThe same ones you love will bring you pain, my nigga\nI don’t know if I’ll see tomorrow\nBut I won’t cry, no, I can’t cry\nAnd in this life times getting hard my nigga\nBut fuck that, I’m aiming for the stars, my nigga\nI won’t stop, try ‘til the day I die\nAnd I won’t cry, no, I can’t cry, no\n(ay, ay, ay, yea)\n(listen, yo)\nI sit back and watch the news every now and then\nEither get depressed or mad from watching the world just crash\nEven the weather’s bad\nIt be the same shit, got my brain twisted\nLike, “Damn it’s ’06 and niggas still up on that gang shit?” (that shit old, dawg)\nYesterday this kid got his whole frame split\nOnly seventeen, he was finna to graduate in like three weeks, some stupid niggas got him for his chain\nBut he fought back, they blasted him and left him on the pavement, uh (rest in peace)\nAnd now they telling me this little girl just got raped\nSome dude snatched her, she was standing at the bus stop\nWait, man she was eleven!\nWhat the fuck is up with this world?\nGot these grown niggas fucking with girls?\nPlus the cops harassing us\nEvery week be blasting us, on accident, or so they claim\nReporters sympathizing like they truly know the pain, (right)\nThey killed her only son\nNow she wanna blow her brains out\nChange the channel man, I can’t watch this shit\nSometimes sunshine turn to rain my nigga\nThe same ones you love will bring you pain, my nigga\nI don’t know if I’ll see tomorrow\nAnd I won’t cry, no, I can’t cry\nAnd in this life times getting hard my nigga\nBut fuck that, I’m aiming for the stars, my nigga\nI won’t stop, try ‘til the day I die\nAnd I won’t cry, no, I can’t cry, no\nTake a ride through the city man, tell me what you witness\nPoverty, richness, crooked cops and misfits\nViolence, hatred, real devastation\nNeighborhoods looking like there’s still segregation\nWelfare, single mothers, no jobs\nTryna get a piece for yourself, but they hogging up the whole pie\nFiends in the street so high off of that crack shit\nThis nigga thirteen with a gat under his mattress (bang!)\nWhite folks got the road to success mapped and that’s all good\nBut why don’t blacks got that same atlas?\nI asked the same question a million ways\nAnd it seems like I done prayed for a million days\nBut still the ills remain, just bills and pain\nShootouts in project buildings, children slain\nSkies filled with rain and I just sit and wonder why\nIt's enough to make a nigga wanna cry, but I can’t though\nSometimes sunshine turn to rain my nigga\nThe same ones you love will bring you pain, my nigga\nI don’t know if I’ll see tomorrow\nAnd I won’t cry, no, I can’t cry\nAnd in this life times getting hard my nigga\nBut fuck that, I’m aiming for the stars, my nigga\nI won’t stop, try ‘til the day I die\nAnd I won’t cry, no, I can’t cry, no\nYeah, shit dedicated to my cousin Ricky man\nHoop dreams cut short man\nLearned he had a baby on the way\nNigga wasn’t even a senior in high school, though\nHold your head man\n\n"}, {"title": "Goin Off", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Fuck it, aye\nDo or Die, new arrival\nHolla at my niggas\nYou survive you's alive, yo\nNow either you follow me and ride, or you's a rival\nThe difference between you and I is you a model, you posing\nBut who am I though?\nThe mulatto out for that lotto\nMoney coming soon, the newest model\nYour crew is hollow\nThe type of niggas gobble dick, chew and swallow\nYour girl told me shoot in her face, she suicidal\nOh shucks, you niggas is closed, you fold up\nI'm from the Ville, niggas get killed over four bucks\nThank God we made it, my niggas, we grown up\nNow we crazy over that bread, call us the \"dough-nuts\" uh\nMore sluts once the money blows up\nBut them hoes stop if the dough drops\nI won't stop though, a chip off the ole' block\nI'm from a city where niggas hold blocks\nLeave you looking like old socks, damn\nCops patrol blocks, spotting on us\nThe boys is rotten, I know they want us\nProbably arrest a nigga, get a bonus\nYou kill a nigga, get promoted\nShit is crazy, girls getting babies before they get diplomas\nSo much I just go nuts\nNiggas telling me slow up\nNever that\nI'm tryna get where that cheddar at\nY'all don't hear me\nAlways somebody that don't want you getting cheese, yo\nThis whole bullshit is like Tom and Jerry\nI'm kinda very raw, niggas can't deny facts\nIf you black they sending you to jail or Iraq\nHonor is something you can't sell or buy back\nNiggas don't like bragging, they 9-11 fly cats\nHijack niggas, \"Get up out your whip nigga, strip!\nI want it all- ice on your wrists and the kicks, \"\nThis shit happens, I ain't just rapping, believe it yo\nThey got streets in the city police won't even go\nPeep it though, uh\nIt ain't no secret, niggas beefing cause my ego so big\nIt got me speaking like I'm diesel, like I'm devil, oh\nNiggas know my style though, I ain't tweaking, I am lethal though\nHave your daddy looking for you\nThis ain't Finding Nemo though\nLet me slow it down, dumb it down, y'all warned\nThe son came up out that womb, yo, a star is born\nIf real recognize real, y'all are foreign\nMy team run a play on your bitch and we all scoring, yea!\n\n"}, {"title": "Rags to Riches (At The Beep)", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Your call has been forwarded to an automated voice messaging system\nDJ OnPoint\nDamn, broke as a bad joke\nBut still I laugh though, frontin' tryna have hope\nIt's sad though, I'm tired of being broke as shit\nI'm seeing other niggas ball and I'm like 0 for 6\nAyy, man, I just graduated, good old college degree\nShit, my niggas drug dealing see more dollars than me\nI know my calling, it's in my blood to do this music thing\nWon't be that illest nigga that you never knew his name\nI'm looking at these fake A&R's like, \"You a lame\nThat boy a genius and you ain't even listen, man, you insane\"\nBut you'll see though, just what the hell a nigga 'bout to be though\nSo give me one year then play this back like TiVo\n'Cause boy I'm finna blow, I'm a motherfuckin' torpedo\nThe music's in my blood so watch these niggas turn mosquito, uh\nI play the villain and the hero, some grow man shit\nFeel like a goddamn kid, man I'm Pac and Big (What up?)\n\"Up\" is something that I can't give\nWon’t see me disappear like the old Aunt Viv'\n'Cause even on a slow jam, I'm so damn sick\nMan I even spread a virus to a program, quick\nI gotta focus on my flow and get some dough, man, shit\nNo dollars got me actin' like I got no damn sense\nBut peace to my broham's and to my ex-lady\nYeah we been complicatin' things with the sex lately\nMaybe I'm being selfish, but nah, I can't help it\n'Cause girl we go back like a throwback Celtic, Jersey\nRegardless of where God lead us\nJust know that I was Martin and you was my Gina, uh\nBut I'm through living in the past, Lord\nNo more thinking rewind, I'm more fast forward\nLess rear-view mirror and more dashboard\nI'm visualizin' cash and stamps on a passport\nThat CLS with a full tank of gas for it\nCop my mom a whip, nigga, and she ain't even ask for it\nWise enough to know that money can't buy you happiness or lovers\nBut it's gon' get my mama out the struggle\nWise enough to know that money can't buy you happiness or lovers\nBut it's gon' get my mama out the struggle\nSaid I'm wise enough to know that money can't buy you happiness or lovers\nBut it's gon' get my mama out the struggle, nigga\nI'd like to welcome ya'll to\nMy life, my life, my life, my life, in the sunshine... (Okay, in the sunshine)\nEverybody loves the sunshine\nThis is the come up, nigga, uh, sunshine\nAyo real quick man\nEverybody loves the sunshine\nY'all be a part of this experience man, The Come Up\nWhile we gettin' outta here, I just wanna give a few shout outs man\n(Sunshine) First and foremost man, my fam man, my mother my brother man\n(Folks get down in the sunshine) God nigga, yes God nigga\nFor real my brothers from another mothers man, RJ man\n(Sunshine) Mike Shaw, what it is man, Dreamville all day, we not\n(Folks get down in the sunshine) We callin’ that shit Fayettenam, nigga\nBut we also callin' that shit Dreamville\nNigga, you got a dream, you can get the fuck ‘bout outta yo situation, nigga\nShout out to By Any Mean, my nigga Ebro man\nThem two nice niggas, man\nAll the way, all terrain music all day\n(There’s trees and plants and flowers) It’s a beautiful life man\nFrom Rags to Riches, watch me man\n(There’s trees and plants and flowers) From Rags to Riches\n"}, {"title": "Get It", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Gotta get my groove back, you know?\nIt's been a little minute\nYeah\nYeah\nUh\nThis is for my niggas tryna make it\nWatch out for them evil ass niggas tryna take it, uh\nThey love to see a nigga dead, up in jail\nLiving in a world where we set up to fail\nBut I'ma get it, nigga, I'm finna to get it (Uh)\nI'ma get it, nigga, I'm finna to get it (Yeah)\nI'ma get it, nigga, I'm finna to get it (Yeah)\nI'ma get it, nigga, I'm gotta get it\nThis is for my niggas tryna make it\nWatch out for them evil ass niggas tryna take it, uh\nThey love to see a nigga dead, up in jail\nLiving in a world where we set up to fail\nBut I'ma get it, nigga, I'm finna to get it (Uh)\nI'ma get it, nigga, I'm finna to get it (Yeah)\nI'ma get it, nigga, I'm finna to get it (Yeah)\nI'ma get it, nigga, I'm gotta get it\nTell 'em Geppettos my niggas in ghettos with Scarface dreams\nOn the block with the hard hate, that's all they seen\nNiggas killing niggas in broad day on all they screens\nWatching cops loving car chase scenes\nNiggas arrested\nTreat us like roaches, the prison's nigga infested\nThey hate to see the day we ain't slain, niggas invested\nAll created equal looks like equal to a less than\nDepending on your race, or depending on your address, man\nI've been blessed, was given less and but still progress, man\nI hate to see the position my niggas left in\nSling dope or nigga you slave for minimum wage\nAshamed\nBut we living in the cage, so nigga get paid, shit\nHow could I tell a nigga not to hustle?\nYeah, it's a better life my nigga, but it's not for us though\nInstead they wanted us to break, they never wanted us to make it (Yeah)\nTo my niggas: smarten up until we smart enough to take it, nigga\n\n"}, {"title": "I Do My Thing", "year": "2007", "album": "The Come Up Vol. 1 Mixtape ", "writers": ["nervous reck", "j. cole", "j cole"], "artist": "j cole", "lyrics": "You got your feelings hurt?\nYou wanna talk about it?\nGuess what bitch, I don't wanna hear about it\nGuess what bitch, I don't wanna hear about it\nI do my thing and I don't care how you feel about it\nYou got your feelings hurt?\nYou wanna talk about it?\nGuess what bitch, I don't wanna hear about it\nGuess what bitch, I don't wanna hear about it\nI do my thing and I don't care how you feel about it\nYou got your feelings hurt?\nYou wanna talk about it?\nGuess what bitch, I don't wanna hear about it\nGuess what bitch, I don't wanna hear about it\nI do my thing and I don't care how you feel about it\nYou got your feelings hurt?\nYou wanna talk about it?\nGuess what bitch, I don't wanna hear about it\nGuess what bitch, I don't wanna hear about it\nI do my thing and I don't care how you feel about it\n\n"}]