[{"title": "Intro (The Warm Up)", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah\nYou ever prayed for something your whole life?\nI mean, all you dreamed about was this one thing\nI mean, you know it’s coming\nYou have faith and all that\nBut sometimes\nSometimes you second guess yourself\nThat’s human nature I suppose, second guessing\nWhen life seems to take you through more downs than ups\nSeems like it gives you more losses than wins\nBut do you stand tall and be bold\nOr do you fold?\nDo you believe?\nSee, me, I came a long way\nWay too far for me to stop now\nNot that I would stop anyways, but\nI’m so close, I can feel it\nCan you feel it?\nWarm Up\n\n"}, {"title": "Welcome", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah\nHey\nYeah, hey\nFayettenam, yeah\nBitch\nYeah, I'm sipping liquor for the pain, pouring liquor for the slain\nNothing else can do the trick like hard liquor to the brain\nFall victim to the game, all this money we spent\nIn my mind, tryna figure where this 20 G's went\nMaybe I should slow it down, maybe take the pace slow\nSecond thought, I think I need to speed it up and make mo'\nTime to build, Lego, in the Ville, laid low\nCounting days, still waiting on that shit I prayed for\nAm I ungrateful? Want it all so quick\nFeel a vibrate, hold up, I got a call, old bitch\nHow she get my new shit? Swear the city too small\nType of chick won't take her shirt off cause her titties too small\nI could give a damn, girl, lift up that pretty blue bra\nNow I'm in the deep, seeing just how pretty you are\nAnd that kitty go hard\nLord, I'm up in that\nGot the type of kitty cat that make a nigga double back\nType of shit that make a nigga wanna fall in love with that\nAt the door wit a towel on and nothin' under that\nSaying welcome\nHey, yeah\nYeah, welcome\nYeah, yeah\nI let these words flow out like water from a spout\nLike rain from the clouds, rush the pain from the crowd\nCause these words go deep from my soul when I speak\nThen the flows hit the souls of all those that I've reached\nIf I die 'fore I wake, hope my songs live on\nWill they miss me when I'm gone and if so, for how long?\nSo much shit is on my brain, try hard to maintain\nSit and analyze my thoughts, at times I wonder if I'm sane\nMan, it's hard to trust friends when the paranoia blends\nWith the marijuana, wonder will this high ever end?\nSwear I'll never smoke again, y'all niggas blow the weed\nLet me take another shot, man, this liquor's all I need\nJust to put me in the zone, so far away from home\nNobody truly know me, got me feelin' so alone\nThey wonder what's on my mind, what's lingerin' in my dome\nI tell 'em ain't nothin' wrong, I deal with it on my own\nI deal with it on my own\nYeah, I deal with it on my own, nigga\nYeah, oh, welcome\n\n"}, {"title": "Can I Live", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah\nPussy my passion, never been a fan of flashing\nProbably cause I never could\nSaid if I had it, never would\nThen I got my first little taste of paper and I splurged\nI guess it's just a nigga urge\nThis is The Boondocks\nI swear, yo, I’m like Huey mixed with Riley\nThursday I be tryna save the world, and then on Friday, I hit the club\nHoping that my dick get rubbed by some fat asses\nNiggas get to scrappin' then you hear the gats blasting, damn\nHope them niggas ain't got no problems with me\nMy momma told me to speak like you got a college degree\nYou see, I can, but I won’t cause I’m saying what I want\nPlus this slang that I speak don't change that I'm deep\nAs the throat on a certified freak, will she choke?\nAs we headed to the crib, yes, I let her give me head\nSo she won't 'member where I live,  my game is tight\nBaby, no need to bring pajamas, you ain't staying the night\nNo disrespect, I just say it polite\nI drop her off before I sleep, I be praying for life\nLike Hov said it, can I live?\nAy, dear Lord, can I live?\nHey, now am I living to get paid, just slaves for a wage, are we?\nI can't do no 9-to-5, told my momma sorry\nI can't do no suit and tie, no I want the glory\nIf you knew me, know my life is like a movie starring me\nPardon me, if it seems that I'm following my dreams\nI ain't reading off the script that they picked for me\nI ain't pissed, nah, couldn’t give a shit hardly\nI'll be shitting on them niggas that was shitting on me\nWill I live or will I die before they get to know me?\nIf I go, I know the ones that’s pouring liquor for me\nAnd I know them fake niggas really hating on me\nKnew that I was 'bout to blow, so they was waiting on me\nBut oh no, Lord\nYou see, I'm smarter than they know\nSo hold on, Lord, cause I ain't quite ready to go\nCan I live?\nSomebody told me that it's only one shot\nSo I'll be goddamned if I'm ever gonna stop\nPromise to my momma I'ma make it to the top\nSo I'ma keep climbing 'til my heartbeat drop\nLike the phone when she heard the news\nHer sister on the other line talking to her shoes\nThe only son, what a thing to lose\nMore blacks singing more blues\nMore niggas pouring more brews\nPoor dude, he was young like 21, straight up out that city that I'm from\nA real smart nigga, but his niggas, they was dumb\nHe ain't even get a chance to run\nBefore it landed in his lung\nGod, breathe nigga\nHis partner screaming “Don’t you fucking leave, nigga!”\nTook off his shirt, tryna stop the bleeding nigga, “Don’t you go!”\nBut his life fading slow\nDid I tell my mom I love her, do she know?\nDid I tell my baby sorry from before?\nWon't get to see my son grow\nLord, I ain't ready to go\nCan I live? Can I live? Dear Lord, Can I live?\nCan I live?\n\n"}, {"title": "Grown Simba", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, yeah\nYeah, uh\nNow I was dreaming 'bout a deal at the age of thirteen\nI was fiending for the mills, I ain't talking Burger King\nSome of my niggas in the Ville, all they did was serve fiends\nFuck scales, I had skills, all day rehearsing\nThem pretty boys had them gals, spent they time flirting\nAll they wanted was some waves like they fucking surfing\nHold up now, don’t get it twisted, I ain't hating, do your thing\nI was like a young Simba; couldn’t wait to be the king\nNow a nigga is the prince\nHopped over the fence where the grass way greener\nLook at shorty ass, way meaner\nSomething like Serena mixed with Trina, have you seen her?\nShe fine enough to be Ms. Howard, word to Adina\nMy money like a senior, watch it graduate\nNow it's time to eat, I’m letting all my niggas grab a plate\nGravitate to real shit, stay away from phonies\nThese niggas heard about me, now they acting like they know me\nKeep on saying “Where you going, nigga?” (Shit)\nIt ain't no telling (Huh, yeah)\n“Ay, where you going, nigga?” (Hey)\nIt ain't no telling (Yeah)\nThey keep on saying “Where you going, nigga?” (Going, nigga, ay)\nIt ain't no telling (Yeah)\nCan’t tell you where I’m going, just know I won't stop\nGoodbye to the bottom, hello to the top, uh\nPardon the interruption, a proper introduction is necessary\nWhen your shit is legendary, man\nGreedy niggas wouldn’t let me in the cafeteria'n\n'Cause they ain't believe, suddenly they Presbyterian\nThe hoes is librarians; they looking me up\nShe got to Jones like Marion, she licking me up\nThen we cut, look how she say my name\nI got her moaning \"J. Cole\", they used to say Jermaine\nI never change, I'm like a corpse in a coffin; six feet, shit's deep\nI was low, just a dollar and some hope fixed me\n'Cause I was broke, plus the weed that I would smoke would make it worser\nLord, please let my problems disappear like Ron Mercer\nI’m a star; Converses\nConversin' with them girls with them curves like cursive\nThey open like curtains\n'Cause my shit is unheard of like curses on the radio\nSame bitches used to play me though, now they yelling—\n“Where you going, nigga?” (Shit)\nIt ain't no telling (Huh, yeah)\n“Ay, where you going, nigga?” (Shit)\nIt ain't no telling (Yeah)\nThey keep on saying “Where you going, nigga?” (Going, nigga)\nIt ain't no telling (Yeah)\nI can’t tell you where I’m going, just know I won't stop\nGoodbye to the bottom, hello to the top, yeah\nYeah, I left the city for a minute, but it's still on my back\nTold my niggas \"Ay, I'm finna put the Ville on the map\nI'll be back, and I'm coming with a deal and a plaque.\"\n'Cause I'm ill, bitch, they couldn’t make a pill for the rap\nPouring liquor for my niggas that was killed, send 'em back\nCame home, shit is real, niggas still in the trap\nHold up now, don’t get it twisted, if you slang, do your thing\nMe, I'm like a young Simba; I can't wait to be the king\nWitness the dream\nStraight out that Carolina water, I was brought up\nIn the city where the skinny niggas tryna be the ballers\nAin't no fathers, but the skinny niggas tryna hit they daughters\nSneaking in her crib, but her momma never caught us\nWhat they taught us?\nMan, them bad bitches only want the ballers, the starters\nWe hooping, now the hoes wanna guard us\nUh, okay, so play D—know what I mean?\nAnd I, I, I'll put you on the team\nMan, this life is but a dream and I need a fast car\nBad broads, fast forward; passport\nI'm a fucking rap star\n“Ay, where you going, nigga?” (Shit)\nIt ain't no telling (Yeah)\nThey say this life is but a dream, well I need a fast car\nBad broads, fast forward; passport\nI'm a fucking rap star\n“Ay, where you going, nigga?” (Yeah)\nIt ain't no telling\n\n"}, {"title": "Just to Get By", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "\"That was the warm up, that was the warm up, baby\nAight, Elite, for real, one take, dawg, and I'm up outta here\nOne, yup, yeah.\"\nLord, please forgive me for my sinning\nI ain’t saying that I’m finished, but I’m praying in advance\nCause the way her eyes glance like they playing in my pants\nYeah, ball game\nI swear the hoes wasn’t in my plans when a nigga took the chance and came to the big city\nMy beat machine the only fucking thing I had with me\nLike Bobby had Whitney, we was cooking up crack\nBut them fifteen credits had a nigga off track\nPicture that, best rapper since Lil Wayne in classes\nThe best bachelor since Bruce Wayne with his bachelor’s\nBut mastered this rap shit\nYou hear the words coming from my lips bastards\nI never crack, I got that Chapstick\nI practiced till that shit made perfect and served it to the people on a silver platter\nNow where’s the ladder?\nCause either you gonna whine or you climb; I chose the latter\nKnow you haters is pissed, hold your bladder though\n‘Fore you get tossed like a forward lateral\nWe never tattle, let God handle that\nOr let the mob handle that\nNo Soprano, half black, half white; I’m a piano\nI’m an animal, my video on Discovery Channel\nI’m a beast when my shit hits the streets, these niggas cease to exist\nLike a beach in a tsunami,  you'll find me in the ‘Ville\nIn the state of NC\nBitch, if I ain’t back home, I’m up in NYC\n‘Bout that money prob-ly like a fucking robbery\nBut I ain’t jacking\nI’m chasing dreams sort of like jeans, boy, I ain’t slacking\nI’m chasing dreams sort of like jeans, boy, I ain’t slacking\nHey, take a hard look at my drive nigga, no hacking on my shit\nI’m straight smacking niggas, straight tagging niggas\nYo, I freestyle and fuck you niggas, ya’ll be wilding and I’m out\n\n"}, {"title": "Lights Please", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, I had this little bad thing, somethin' like them tens\nShe gave a nigga mad brain, somethin' like The Wiz\nBut, you see, the sad thing fuckin' with her is\nIs the chick ain't even have brains, dummy like a bitch\nSo I tried to show her about the world\nAnd about just who we really are\nAnd where we've come and how we still have to go really far\nLike, \"Baby, look at how we live broke on the boulevard\"\nBut all she ever want me to do is unhook her bra\nThen all I really want is for her to go down low\nBefore you know it, she wet enough to get drowned slow\nAnd all that deep shit I was previously down fo'\nReplaced by freak shit I am currently down fo'\nYou see I peeped it, pussy is power\nThat proud feelin' we get knowin' that pussy is ours\nAnd how it feels to feel that feelin'\nYou feelin' when you be drillin' that shit\nGot her sayin' you be killin' that shit\nAnd all the pain the world cause, she be healin' that shit\nAnd naw, that ain't your girl, dog\nBut you be feelin' that chick\nAnd you just wanna tell her everything she might need\nBut in the meantime it's lights, please\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\nSo now we in the hotel, mirrors on the ceilin'\nShe say she wanna blow L's, I hear her and I'm willin'\nBut every time I smoke, well, a nigga mind gone\nSo that every word I spoke, well, I'm tryna put her on\nBut she couldn't hear me\nI told her all about how we been livin' a lie\nAnd that they love to see us all go to prison or die\nLike, \"Baby, look at how they show us on the TV screen\"\nBut all she ever want me to do is unzip her jeans\nThen all I really want is for her to get on top\nBefore you know it, she workin', jerkin' it nonstop\nAnd all that next shit I was previously talkin'\nIs now that wet shit that I'm currently lost in\nAnd while that sweat drip, I am reminded\nAll the times my brother told me that pussy is blindin'\nI'm findin', the more I grow\nThe more y'all seem to stay the same\nDon't even know the rules, but yet y'all tryna play the game\nAnd ain't it shameful how niggas blame hoes for givin' birth\nTo a baby that took two to make?\nCoward nigga, you a fake\nHow you gonna look in your son's face and turn your back\nThen go start another family?\nDawg, what type of shit is that?\nShe said it's okay, rub my head and told me to relax\nLaid a nigga down proper, like she was recordin' tracks\nSaid \"I know you wanna change the world\nBut for the night, please\nJust reach over and hit the lights please\"\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\nLights please, ah-ah-ah\nLights please, ah-ah-ah\nLights please, ah-ah-ah\nLights please, turn off the lights\nLights, please\nAlright, if y'all niggas heard the first one, The Come Up and shit, then you would have heard part 1 of this joint right here. It's \"Dead Presidents\", you know classic nigga, that's classic Jay shit. So I did it, threw it on the first mixtape, this is about a year ago. We let niggas hear like you know the mixtape whatever, and there was always this one nigga that stuck out to me like a year ago. This nigga's like \"yo\". like I thought I did my thing on this shit, that was like two of my favorite verses that I did, but he was just like \"Yo\", like, \"Yo you didn't come right man. If you gon' come on Dead Presidents son, you gotta come, hard son, you gotta come harder than that son, you gotta come harder than that.\" I was like, man what you mean I came hard? But, that shit always stuck in my mind, so doing this next, you know, doing this The Warm Up I was like, damn, I gotta get on it again, I gotta do it again. Just almost like, just to prove to that nigga and kinda prove to myself that you I can, I can maybe get a little...\n\n"}, {"title": "Dead Presidents II", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, Fayettenam\nThese niggas is playing\nRussian Roulette with a full clip, foolish\nMy crew is foolless, no, we don't dance\nAll we do is stay two steps ahead\nMake the hoes get loose like a noose neck\nInstead while these dudes beg for head\nThey got the game twisted, heavy traffic in this rap shit\nLook how my lane shifted, elevated my game, lifted my name\nNow these lame niggas could never get it\nLike that bad bitch you wanted but could never hit it\nClever with it, my flow like a devil spit it and heaven sent it\nSo high, if I dropped I would fall for 11 minutes\nSo yeah, I operate on a higher plane, my thoughts take a higher train\nIt's dope, then you should know the suppliers name\nIt's J. Cole, set of horns and a halo\nAnd all these Jose Canseco's wanna text us like Waco\nIts hard to remain faithful niggas be throwing hate\nYo I'm in a league of my own so what the fuck would I play for?\nSome next niggas almost slid in but didn't fit in\nNaw I ain't Maury Povich but who the fuck is you kiddin?\nThese big wig niggas throwing their bid in\nTry not to show stress, I guess the flow is protested like a sit in\nI told my niggas we would get in\nBut that ain't even half the battle\nStay behind like a shadow or you catapult\nNow if I had a ladder or now even if I had a rope\nI'd climb that motherfucker to the top and never let it go!\nHeaven or hell, you choose, freedom or jail, you lose\nI can't stop, I'm as hot as the devils shoes\nOvercame a low life status to blow like Gladys\nAhead of my time like I live my whole life backwards\nI'm nothing like these ho-like rappers\nMy whole life practice to be the one\nWhat's it like to be LeBron\nThey calling you the saviour, so much pressure but you deal with it\nThe weight of the world on your shoulders but you still lift it\nIll with it for real, lil nigga from Ville that real niggas can feel\nNobody taught us how to cook still niggas a grill\nNo Foreman, try not to call them ladies bees but them hoes swarmin\nNow honey, aye is it destiny or is it money you're feelin\nHeard rumors of a deal and now you thinkin a million\nPardon my paranoid mind but I'm starin in the mirror livin in fear that things a never be the same\nNo one left for me to blame but myself cause I asked for this\nHeaded for fame but in my brain, hey can I last in this?\nAye five years I'll probably laugh at this\nTry not to let it wear me out like a bad bitch with fashion sense\nI keep it fresh while these wack niggas rehash and shit\nJackin styles you know, ski mask and shit\nI pass these niggas, they tryna do it how these other niggas did it\nI'm tryna live it how no other nigga ever lived it\n"}, {"title": "I Get Up", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "I woke up early in the morning, hoes blowing up my phone\nI ain't used to small talking when they know I'm tryna bone\nFuck 'em, I'll holla later, man, right now, my mind's elsewhere\nMy mom's healthcare, get her out this hell here\nA lot of niggas fail, frail niggas won't prevail here\nWe seen it all man, niggas can't even spell scared\nA Fresh Prince, but yo my city ain't no Bel-Air\nFuck if you would sell, I'm worry bout my welfares\nSo farewell to them broke days and bonjour to the most paid\nSoon as my dough straight, I throw the wifey in some Dolce\nAnd put some chains on my niggas like I own slaves\nI get up, look out the window, hope the sun shining\nDown on my niggas out there front lining\nI hit the streets and see them boys out there locking up some older head\nSo Goddamn homie, hold your head, and hold your head\nI get up, I see the clouds from my window\nI pray the sun gon' shine this way\nAnd where I go as the wind blow\nMomma, your son gon' find his way\nAnd if I gotta crawl, I'ma make to the end though\nAnd to the top I'ma climb my way\nAnd tell 'em I'ma rise, I'm on my—headed for the sky\nI'm on my way\nPaint a picture to show the deaf what it's like to listen\nAnd speak the words and tell a blind man what he missin'\nFor all my niggas doin' time man up in prison\nFelt you had to resort to crime, man fuck the system\nWe raisin' babies up in Hades where there ain't no hope\nAin't no fathers, don't take no scholarship to slang no dope\nPoliticians hollerin' bout problems but I ain't gon' vote\nHe talk about change, still we floatin' in the same ol' boat\nSo tell me how I'm supposed to feel when the President spoke\nWhen he ain't never had to struggle, ain't never been broke\nAin't even roll through the ghetto ain't neva been close\nTrustin' this government's like trustin' the devil in oath\nFor rebel with quotes, I get up\nLifestyle of the young, black and reckless\nA generation of niggas strapped and askin' questions like:\n\"Tell me why I ain't got shit?\"\nI let this liquor fill my liver with them toxics as I sip\nI get up, I see the clouds from my window\nI pray the sun gon' shine this way\nAnd where I go as the wind blow\nMomma, your son gon' find his way\nAnd if I gotta crawl, I'ma make to the end though\nAnd to the top I'ma climb my way\nAnd tell 'em I'ma rise, I'm on my—headed for the sky\nI'm on my way\nYeah, to all my niggas paper chasin', I pray for your patience\nJust keep the faith that you gon' make it one day you'll be cakin'\nTakin this shit one step at a time, that real shit is stuck on my mind\nBut to that bullshit I'm deaf and I'm blind\nDestined to shine I'mma find a way, cause hey\nDamn it, them jobs out there ain't tryna pay, I pray\nGranted nine to five is how you survive\nI ain't tryna survive, I'm tryna throw my Momma in rides\nI'mma provide for my seed I'm the soil\nI'll teach 'em bout' loyalty\nI'll teach 'em that his skin black like oil that's for royalty\nI'll show 'em all the things that my pops was never showin' me\nTreat 'em like a growin' tree with this poetry\nI get up and show the sons how to lead not to follow\nThe present is our gift but our seed's got tommorow\nSo please niggas raise your kids\nAnd help em' overcome that bull shit they daze us with\nI blaze the shit\nI get up, I see the clouds from my window\nI pray the sun gon' shine this way\nAnd where I go as the wind blow\nMomma, your son gon' find his way\nAnd if I gotta crawl, I'ma make to the end though\nAnd to the top I'ma climb my way\nAnd tell 'em I'ma rise, I'm on my—headed for the sky\nI'm on my way\nI get up, I see the clouds from my window\nI pray the sun gon' shine this way\nAnd where I go as the wind blow\nMomma, your son gon' find his way\nAnd if I gotta crawl, I'ma make to the end though\nAnd to the top I'ma climb my way\nAnd tell 'em I'ma rise, I'm on my—headed for the sky\nI'm on my way\n\n"}, {"title": "World is Empty", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, it's Cole, won't lie, won't stop 'til the race is won\nNiggas who be rapping how real they are\nUsually turn out to be the fakest ones\nCarolina, where I made it from\nCole world, no blanket, son\nGirls fast how Jamaicans run\nPuffing on the city where the Lakers from: L-A, L-A, la la\nSo high, everything is a “ha ha” for me\nDreaming of the days of a drop 500\nAnd a bad bitch that'll go to Popeyes for me\nYou can never tell me that I'm not hungry\nIf you ever felt what's inside my tummy\nMy mind wondering now, is my time running out?\nIs the Lord up top with a stop watch for me?\nHope not, hope not, hope not, hope not\n(My world is empty without you, babe)\nYeah, just trying to make it, my nigga\n(My world is empty without you)\nYeah, yeah\nA wise nigga told me don’t chase that cash\nFollow your heart, you’ll make that fast\nDoes a stripper love to shake that ass\nOr does she wish to erase that past?\nGot a nigga in her face, just gassed\nLike “baby girl, why you take this path?”\nStack in his hand, trynna make that last\nAll she thinking bout is how to take his last\nRub titties in his face and laugh\nGotta try not to look fake, in fact\nA little more money, like a few more 20’s\nWhen you let that nigga grab your naked ass\nOkay, he’s gone now, roll her eyes when he whispers in her ear\n“This ain't the life for you, baby, let me take you out of here cause...\"\n(My world is empty without you, babe)\nYeah, she like \"nigga, yeah right\"\n(My world is empty without you)\n\"You know how much motherfucking money I'm making?\"\nYeah, my niggas sit back, blowing the L\nOnly getting high cause we closer to hell\nNigga trying to live like Hova, but well\nWe broke and that dough coming slow as a snail\nHustle hard in the snow, in the hail\nHit the block like a postman with mail\nMy brother got knocked now they hold him in cells\nMy mom broke, but she posted the bail\nSomeway, somehow\nNigga feeling like the sun down even when the sun up\nHear the sound out the window of the gun bust\nAnd you wonder why niggas keep the gun tucked\nBut this how niggas was brung up\nA mother just trying to raise her son up\n'Til a stray bullet got his lungs struck\nAnd the Governor couldn’t give one fuck\nWhile she singing\n(My world is empty without you, babe)\nDamn, told you niggas \"Cole world, no blanket\"\n(My world is empty without you)\nTough luck, yeah\n\n"}, {"title": "Dreams", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "brandon hines", "j cole"], "artist": "j cole", "lyrics": ""}, {"title": "Royal Flush", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, this is the... warm up\nOkay, I roll up, hold up, look at how I showed up\nI blowed up, had a hole up in my pocket, now it's sewed up\nThey feinin' for that crack, you know that rock, I got that product\nYou niggas tryna stop it, better load up, I hang my coat up\nAye, I'm gon' be here for a while so I smile, haters\nI'm on that green like a flower, like an alligator\nNow or later, I'm serving niggas; I'm a sound waiter\nJust tell me what you want, I bring that back an hour later\nLook how I cater, dog what you afraid of? Nothing\nThey talking gangsta without no data, they fronting\nJackie-Chan, Jean-Claude-Van-Dam, straight stunting\nI wish a nigga would say something\nI'm a Carolina nigga, boy I got it on my back\nPiggy back style I ain't talking 'bout no tat\nAnd I'mma rep the Ville in every city that I'm at\nAnd I guarantee I'm bringing home plaques\nShoutout to my brother Zach, and my mother, I love ya\nYea look ain't that about a bitch? This nigga on his own dick\nThey say I'm like the human body, I produce my own shit\nAnd I tote my horns. A star when I was born\nMy name ain't James, my word is bond\nYea shoutout to Canibus, had a similar line 98-99\nDamn, that was the times never mind dwelling in the past\nYou're listening to the future\nThe flows gets tighter, them hoes get looser\nThen they wanna seduce ya like Medusa, be cool\nI said I got a girl, she told me, \"Me too! \"\nSo that must mean you want a nigga to eat that seafood\nBaby don't be foolish but call her I'll watch her do it\n\nYea and this is only \"The Warm Up\" yea\n\n"}, {"title": "Dolla and a Dream II", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah, aye wassup man? Aye, uh, aye look man, can I- can I get on- can I just get on this bus? All I got is a dollar fifty, I'm just sayin'. I just tryna get- I'm tryna get on the bus, man. I ain't got no mon- all I got is a dollar fifty, I don't go two dollars. Man, fuck you and yo' bus, nigga!\n(Yeah)\nHey, hey (Yeah, got a dollar and a dream)\nYeah, yeah\nI got a dollar and a dream (Yeah), yeah\nI got a dollar and a dream, real niggas on my team (Hey, hey, hey, hey, hey, hey)\nEverything ain't what it seems\nI got a dollar and a dream, hey (Hey, I'm dreamin')\nAyy, ayy, I got a dollar and a dream, real niggas on my team\nEverything ain't what it seems (Uh)\nNiggas hating but I love them even though they trying to scheme\nBut I'm past that (Past that), a nigga's stock is rising like the Nasdaq (Uh-huh)\nThey say I’m the future but yet I’m giving niggas flashbacks\nOf better days when you ain't have to settle for whatever played\nI represent the struggle, nigga, I say what they never say\nWhenever they spit that bullshit they spittin'\nThis that pulpit, I’m hittin' niggas with the gospel (And the lord said)\nHostile with them hoes, I got a dollar in my pocket plus a dream\nYeah you laughing my nigga but everything ain't what it seems\nWhat it means to know your mama or your father on that pipe\nOn that hard white, I’ll tell you what them scars like\nI’m speaking through these bars like a nigga in the jail\nTired of siftin' through my mail, I feel like Cartwright, bills (Bills and bills and bills)\nFor real, a nigga ill\nJust let me do the talkin', man, I know how niggas feel\nI got a dollar and a dream, real niggas on my team\nEverything ain't what it seems\n(God damn, nigga. These motherfuckin' bill collectors, man)\nI got a dollar and a dream, real niggas on my team\nEverything ain't what it seems\n(Can't even God damn turn on my phone without these nigga ringin' me up)\nI got a dollar and a dream, real niggas on my team\nEverything ain't what it seems\n(They tryna call me from different numbers and shit. Tryna- tryna fool me, nigga. I'm Lil Cole, nigga!)\nYeah, got a dollar and a dream, real niggas on my team\nEverything ain't what it seems, yeah\nI got a dolla and a dream, real niggas on my team\nEverything ain't what it seem\nEvery lady ain't no ho and every bitch ain't no queen\nEvery nigga ain't no dog and every nigga ain't no king (Uh-huh)\nShit be happening for a reason, everything is everything\nEvery nigga can't dunk, some white man can jump (Haha)\nThey shootin' niggas 'fore they even tell 'em put their hands up\nCrooked cops got a nigga scared to drive\nProbably thinkin' that I’m slangin', man, I see it in their eyes\nBut inside of my pocket is a dollar, plus a dream\nYeah, you swear your girl is faithful; everything ain't what it seems\nSee, I seen how she glance and looked away like she want it\nI ain't sayin' I'ma fuck her, but I could if I wanted\nKnow it hurts that she flirt with a nigga, this is worse\nI bet if I was to hit, man I wouldn’t be the first (Nah)\nThis is church, this is gospel (And the lord said)\nSpit it like I get it from the Bible for your survival\nI got a dollar and a dream, real niggas on my team\nEverything ain't what it seems (Yeah, ayy, yeah-yeah-yeah)\nAyy, I got a dollar and a dream, real niggas on my team\nEverything ain't what it seems (Uh-uh, uh, uh)\nAyy, I got a dollar and a dream, real niggas on my team (Wait 'til I get my money ri- hehehehe)\nEverything ain't what it seem\nYeah, I got a dollar and a dream, yeah, I got a dollar and a dream\n(Wait 'til I get my money right, I'm dreamin')\nCheck it\nAye Sallie, I know I ain't been answerin' your calls (Aww, not this bitch, yeah)\nBut shit, let me explain- (I can explain, I can explain)\nIt's because times been hard\nBeen runnin' 'round tryna find a job (I can't get no job)\nI hear my phone ringing in the morning, 9 o’clock\nAnd it's you (God damn), can't even front, I press ignore (Yeah)\nI still got your letters layin' in my dresser drawer (Haha)\nYou tellin' me about all the things you did for me (I know, I know, I know, I know)\nWhen I was broke, you sent me dough and that was big for me (I know, I know, big for me)\nSee you was there every year when I needed you\nAnd you were so quick to give I had to be with you\nRemember when I used to call you on your phone line\nI knew it was official when my mama cosigned (Haha, yeah)\nBut in no time, a nigga graduated\nI hit the real world, baby girl, I'm sad to say it\nBut I was usin' you, you gave a nigga major stacks (Major stacks)\nAnd I know in my heart one day that I'm gon' pay you back\nI got a dollar and a dream\nI'll pay you back. Look, can we- can we set up some type of payment plan or somethin'? Like, you know what I'm sayin'? Like, you know? I just graduated six months ago so you know, times is kinda- times is kinda hard, baby. I- I just- can I just pay you like a lil' bit right now and then I pay you- I pay you the rest next- next month when I get paid. Can I just do somethin' like that? I gotta- I'm not even gon' lie to you, I don't, I don't really have it right now. I gotta pay how much? Five thousand dol- Aw, nigga is you crazy? Bitch you lucky I even answered the phone, I shouldn't have even picked up this motherfucker, I s- Look, what's ya- what's ya name? Can I- can I speak to a manager? You are the manager? Look, look can I speak to yo' manager? Who's- who owns this motherfucker? Let me talk to the owner! God damn it, I ain't- y'all niggas crazy... hahaha\n\n"}, {"title": "Water Break (Interlude)", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "I bet they never seen him comin'\nLike a blind bitch you fuckin' from behind\nIt's the motherfuckin' dime, bitch I'm fucking up rewind buttons\nMy shit is jumping like Lebron\nFayettenam on my back like some scratches from your lady\nOn your mattress where they gave me that\nI bet niggas can't wait to pay me back\nWhile they relax, I stay in tip-top shape\nAnd I stay up on my toes like some gym socks, flip-flops\nTell them hater to rehab, kick rocks\nGame tight like Ziploc\nHalf-Black, other half white like Kid Rock\nTry to tell it to a cizz-op\nThought it would work, it did not\nHe told me \"Nigga stizz-op, you know you is not\"\nWrote the ticket and rizz-ocked\nFuck, this is for hip-hop, gassed up like a quick stop\nThey light a fire under my ass nigga my shit hot\nEven if you squatted over volcanoes, niggas your shit not\nI'm raw, but I kid not\nYour shit flop, I give props to the legend\nPraise God but I give not to the reverends\nLookin' up to the heavens like\n\"Where did all my blessings go?\" You chase a dream\nBut then you stop, guess you'll never know\nI got a show for you to watch, here's an episode, professional\nSet to blow any minute now, many women smile\nLook the lights and the action, and the cameras be callin'\nYou niggas got to log in, bitch, you fantasy ballin'\nI snuck up like I planned to be, this ain’t random, we called it\nLike once they get a hit of this, they hooked like that Twitter shit\nThought I get a deal and head straight to the dealership\nBut looking at my deal I probably can't afford benefits\nMedical, dental shit, left but I always came\nBack like a rent-a-whip, dirty ass game\nDog, I could run a kennel with all these bitch niggas\nWho don't lift a finger yet they wanna ride in the limo with\nMe, I switch the tempo on them sort of like Timbo on em'\nStart talking that \"we\" shit, I pause Nintendo on 'em (hahaha!)\nStart talking that beef shit, I turn to kimbo on em'\nI got no words for these niggas I'm instrumental on em'\nYeah! And I'll still keep goin', keep flowin'\n"}, {"title": "Heartache", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah yeah yeah\nElite Elite Elite, Elite\nYa know\nYeah, yeah\nSlim nigga, lyrically on my limbs\nBigga then a nigga hittin' the gym\nRegular benchpressin' the bar\nTen steps up from ya'll, you could follow my lead\nIf you shoot for the stars, I guess you aimin' at me\nBut please hold your applause\nYa'll holdin' up the wall goddammit I'm on the flo'\nGood Lord, can't you see me gettin' down on a ho\nAnd she drop it so low she sittin down on the flo'\nI never pound with the flo, at times I wonder\nAye when they listen to my shit man can they hear my hunger?\nOr will these hatin' ass rappers try to steal my thunder\nAye this is big shit poppin', you gon' need a plunger\nTo take me under, niggas in trouble\nYou lookin' at LeBron James of the game\nI could do anything that you name\nI could blaze any rapper in the game that you bring\nPour gasoline on the brain, got the flame for that\nSo you hatin' niggas refrain from that\nA little bitter cause yo game is whack\nI'll let Elite breathe, yeah\nI'll let Elite breathe, yeah\nAye you ain't gotta cry, don't worry 'bout me\nI know it won't be long 'fore you hear about me\nMy head's to the sky and I'm on my grind\nI'm reachin' for the clouds, tryna take what's mine\nTake what's mine\nHey, hey\nA dollar and a dream, that's all a nigga got\nSo, if it's 'bout that C.R.E.A.M, then I'm all up in the spot\nI'm just warmin' up, I'm hot but nah, I ain't flashin'\nI never gave a fuck about no high-end fashion\nAnd maybe I was too broke, maybe I'm just too dope\nTo rap about that regular shit, or bag a regular bitch\nThese niggas talkin' like they on the next level and shit\nBut Cole's flow so cold, Bet the devil get sick\nHow do you want it? So sick I make you mentally vomit\nThese rappers askin' for beats and they ain't even fit to be on it\nI see 'em writin' about rappers, I should be sick to my stomach\nBecause they talk 'bout the future but didn't mention me on it\nSo now I'm back in the kitchen, cookin' I'm meant to be one of the greatest\nNo niggas seein' me, this century us and you hate it\nLook how I played it, other niggas was jaded\nUnder-appreciated, now Carolina is rated\nI let Elite breathe, yeah\nHey, uh uh uh\nI let Elite breathe, yeah\nAye you ain't gotta cry, don't worry 'bout me\nI know it won't be long 'fore you hear about me\nMy head's to the sky and I'm on my grind\nI'm reachin' for the clouds, tryna take what's mine\nTake what's mine\nHey, hey\n\n"}, {"title": "Get Away", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "LA, NC, NY\nThe Chi, yea, hey, yea\nI wake up, hop out the shower spray cologne on while im dressing\nThey hollering about recession so my niggas out here stressing\nBut bitch, Im live and breathing so to me that there’s a blessing\nSee life is like a test that I ain't never got no “F” in\nStepping out today, I got leave the crib\nMomma stressing , I pray\nThat ain't no body gon’ pull the weapon out and spray\nCuz I don’t got no strap\nAnd ever since we hit the depression niggas don't know how to act\nIn, fact there goes some niggas there\nHating, I feel the stare\nMe vs you shining is like a diamond and silverware\nLet ya’ll feel the glare I got to go now\nI'm riding through the city with the windows rolled down\nShorty holla, so I pulled up beside her\nI'm fronting “What's your name?”\nShe told me, “Boy, you know me, don’t play no games\nNow, look, they say you blowing up, hey, is it true, fired up?”\nI say, “Girl, they wasn’t kidding like they tubes tied up\"\nI'm hollering hey, good God what a day\nI gotta say it feels good to get away\nWhere ain't nobody stressing over shit they got to pay\nAy tell me whats work without play\nAll my niggas hollering hey, good God what a day\nHey baby girl tell me can you get away?\nWhere ain't nobody hollering bout the problems of the world\nIts just me and my favourite girl, now all around they holler\nOkay so word is spreading\nThat I done jetted to New York- I was just up there doing my thing\nSo now some folks I used to know is hollering out “J. Cole!”\nI got to chuckle cuz I know they used to say Jermaine\nSo who changed?\nWhats in name though, when niggas can't hang on-your shoe strings\nThe flow insane plus I got that flame throw, that Liu Kang\nEven in the winter we bring, feelings of summer Suzanne\nWe get them hooked like T-Pain\nAnd scoop them hoes like loose change\nCan you blame me?- Im just a boy straight out the Ville\nThese wangsta ass niggas getting played out for real\nYour acting like your trill, nigga you bet not!\nYou talking out your ass, you feinna get your head rocked!\nThis is where they shooting sideways\nBoys getting blazed\nCan't afford to fly so we high to get away\nNow come here ladies see we trynna get you loose, pour it up\nTake this juice, we gon mix it with this Goose, don’t throw it up\nI'm hollering hey, good God what a day\nI gotta say it feels good to get away\nWhere ain't nobody stressing over shit they got to pay\nAy tell me whats work without play\nAll my niggas hollering hey, good God what a day\nHey baby girl tell me can you get away?\nWhere ain't nobody hollering bout the problems of the world\nIts just me and my favourite girl, now all around they holler\n\n"}, {"title": "Knock Knock", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": ""}, {"title": "Ladies", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "lee fields & the expressions", "j cole"], "artist": "j cole", "lyrics": "Yeah, hey, look\nWhen she talk she so closed-minded\nAll she wanna do is shop, she so clothes minded\nWanna cop the latest 'fore them other hoes find it\nMaterial girl yet somehow I don't mind it\nProbably 'cause she so fine it'll blow your mind\nShe black and Pocahontas, laid back and blow that chronic\nAss so fat, wanna tat my logo on it\nSo any other nigga that a tap will know it's mine\nI put in work overtime\nLet me cut, mow the lawn, guarantee I blow your mind\nShe tried to play me 'til she learned I wrote a rhyme\n\"That's that nigga from the Ville that I heard that Hova signed\nThe rap form Lebron, oh girl, that boy the bomb\nNo chain around his neck, but better watch out for the charm\"\nYou're not my daughter, um, but you can be my baby\nSummertime, wintertime, anytime we looking for them ladies\nShe said \"I got a man\", well, baby I don't give a fuck\nSee me I understand, and I ain't tryna split you up\nOkay, give me your number and later I'ma hit you up\nIf you sleep I get you up, ride over and pick you up\nIf it's clean I'll lick you up, yeah, do you research\nI'll rock that ass to sleep and have you sleeping in my t-shirt\nJust came home from getting my South Beach on\nYou know I ran the streets like a dog without a leash on\nShe tryna get her freak on, come hop up on this ski jet\nYou scared of that water or you just scared to get your weave wet?\nBarely got your feet wet, yes, I know where we headed\nTryna see you throw it back, let's check your reflexes\nGood Lord, didn't know what I was in for\nYou could be my cuddy buddy, baby, what are friends for?\nI speed up the tempo, them other niggas lazy\nCan't fuck with nuttin' younger than the eighties\nI'm grown and I'm looking for some ladies, ladies, yeah\n"}, {"title": "Til’ Infinity", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Uh, yea\nLet me warm up man, let me warm up man!\nI got to warm up man!\nYea, Elite what up! Yea Warm Up\nYea\nLook niggas wanna know the formula for success\nSheeitt, but I studied for this test\nAy nigga I'm better than the rest you just rest boy please\nMe I'm trynna stretch my treasurer chest, like some double D breast\nSo a nigga on a quest- no question\nSo I tell em birds no nesting\nLaying in my bed hope to lay a niggas egg, No- you'll never hatch mines\nBaby, you don't match mines\nI'm trynna shine like the bat sign, when it's crime\nAnd the gats flyin up in Gotham, watch em\nFar from a thug but I'll drop one\nFar from a scrub but I'll mop em\nWatch 'em better leave 'em alone (Malone) like Stockton, when he retired\nShit your shit is fire boy stop\nI don't buy it, boycott, stop lying\nYa shit is not hot man if niggas not buying\nIt's not rocket science\nBut the way I rock it help me build up my alliance\nThese niggas ain't playing in New York like the Giants-ha!\nA little line to show love to the city that got no love\nDon't want to see a nigga grow rather see a nigga hold-up\nThat's cold blooded, well never to fail\nIf you can make it here you can make if from heaven to hell\nI'm just a little nigga strait out the Ville\nAlways been sick probably never get well\nAnd no time soon, step to a nigga get 4 times 2\nBet the way I spit it leave your mind blew, with more rhymes due\nNigga you tryning who?\nSheeit, nigga you tryning me, bitch I'm better than all them niggas you trynna be\nShit, nigga you trying me? Bitch I'm better than all them niggas you trynna be\nLook, it's no time to chill I'm trynna get Mills\nThere's no time to chill I'm trynna build\nBitch there's no time to chill I'm trynna get Mills\nThere's not time to chill I'm trynna build\nIt's no time to chill I'm trynna get Mills\nThere's not time to chill I'm trynna build\nBitch it's no time to chill nigga! Yep\n\n"}, {"title": "The Badness", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "omen", "j cole"], "artist": "j cole", "lyrics": ""}, {"title": "Hold It Down", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "If my heart stop pumping tomorrow don’t feel no sorrow\n'Cause life is hard mentally and everything is meant to be\nSometimes I ask myself If I was gone who will remember me?\nIt's hard to tell oh-well sit back and sip this Hennessy\nNow lately it's been hard to tell my friends part from my enemies\nCuz plenty niggas show me love but in their hearts they envy me\nWhy? I'm just a nigga from around the way\nTold my momma I'll make it happen and I found a way\nPour out some liquor for my niggas at the crossroads\nAnd may the Lord give guidance to the lost souls\nI know that deep inside these niggas know it's more to life\nThen mackin' hoes and stacking dough\nMan I'm sort of like a nigga who done seen greener grass\nSo when they think they ballin' like The Dream Team\nMy nigga I done seen meaner cash\nAnd I'm tryna get it, follow me nigga I'm on a prowl\nHeaded to the top! You watching me nigga?\nThen hold it down\nHold it down, if you need to holla at me\nDon’t hesitate to call it ain't a problem\nI can be there I’d ride for you, lie for you\nI know you’d do the same, I will die for u\nSo hold it down, when the times is hard, I’ll be around\nSo hold me down and it don’t matter how far I’ll be around\nYea, I'll hold you down\nYou were my nigga from the younger days, we grew up\nI went to school you went the other way\nBut still my brother man, I'm sitting, reminiscing on\nAll of them bitches we were tripping over, kissing on\nOr at the skating rink we trying to bag some new hoes\nAnd If I need gear, you let me hold ya new clothes and vice-a-versa man\nBut now that life is worser man a nigga slow caking\nI'm broke tryna chase a dream, you just got probation and I'm stressed\nYour little sister pregnant what’s next?\nOh shit my mama doing drugs, at times it's hard to feel blessed\nIn this madness I holla at my nigga in the sadness\nRemember when ya mama tried to beat you with that bat shit?\nRemember your chick Nina man that ass was the fattest\nRemember my crush on Sabrina? yo, she still the baddest!\nI'm just glad that I can holla at you, it's been a while\nAnd til the next time I hear from you, ay, hold it down!\nHold it down, if you need to holla at me\nDon’t hesitate to call it ain't a problem\nI can be there I’d ride for you, lie for you\nI know you’d do the same, I will die for u\nSo hold it down, when the times is hard, I’ll be around\nSo hold me down and it don’t matter how far I’ll be around\nYea, I'll hold you down\nAnd these are tough times baby but we’ll make it through\nYou know I'm headed for the top I swear I'm taking you\nJust hold a nigga down through this bad weather\nThe rain falling ain't balling but I have better\nA women with an ass and a strong mind, it's been a long time\nSometimes you on your bullshit, sometimes I'm on mine\nWill I have a hard time to stay committed?\nOr do I only want your voice moaning when I hit it?\nMan only God knows\nI know deep in your heart you don’t want me to be no star though\n'Cause groupies out there every show you scared I'm fucking every ho\nAnd girl I ain't gon' lie and say I won't 'cause shit you never know\nBut may the Lord give me strength, I love you more than anything\nThe future mother of my kids, the love is real and if we ever part God forbid\nI love you still so when I'm on the road don’t trip, you know im down for you\nKeep it tight and don’t slip, and hold it down for me\nHold it down, if you need to holla at me\nDon’t hesitate to call it ain't a problem\nI can be there I’d ride for you, lie for you\nI know you’d do the same, I will die for u\nSo hold it down, when the times is hard, I’ll be around\nSo hold me down and it don’t matter how far I’ll be around\nYea, I'll hold you down\n\n"}, {"title": "Last Call", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "La-la-la-laaaa, la lala la lalaaaa\nNow I am (Here's to the Roc')\nHey and they ask and they ask and they ask and I tell them\n(Here's to Roc-a-Fella) It's the Fayettenam\nRaise your glasses, your glasses, your glasses to the sky and\n(Here's to the Roc')\nThis is the last call for alcohol\nThis is the warm-up\nNow to the few niggas out there who heard my last shit\nWhich if I must say so myself that was a classic\nI never been the type to ride my own coat tail\nBut it's obvious I'm here to stay, a fucking hotel\nI came up, I warmed up\nThe next up, I blow up!\nIf you ain't peep the trend by now with each rap I go up\nLook all he wanted was a deal so when he got it he just faded\nBut tell me what's a deal when you want to be the greatest?\nSo Jay I appreciate it, hell of a stepping stone\nWonder if he see it in my eyes I'm trying to get the throne\nWonder if the people know how many nights I spent alone\nMaking beats writing rhymes, thinking deep fighting time\nI'm getting better but wasn't getting younger\nAnd all that time can make the most confident nigga wonder\nBut never doubt it or allowed that shit to phase me yo\nJust switch my thoughts up like the stations on the radio nigga now I am\nAnd they ask and they ask and they ask and I tell them\nIt's the Fayettenam\nPut your glasses and your glasses and your glasses to the sky\nThis is the last call for alcohol\nThis is the warm-up!\nSo get your back up off the wall\nNow may I never slip up or let my grip up\nI know my girl be praying Lord just keep his pants zipped up -\nNow if some groupie bitch is on his dick then make it's stiff up, at least give the nigga common sense to wrap his dick up\nToast, let’s lift up our glasses, then sip up\nWe fly past they look up\nThey don't last they give up\nThey don't blast we clip up then empty\nAnd indeed we hit the target yes these niggas think they the shit and they ain't even farted yet\nStyle incomplete like a garbage ass quarterback\nMy offense is for real, ay fuck sack, niggas getting coffined in the Ville\nWay too often and it feels wrong\nNew York niggas fuck with me, I got 'em singing Ville songs\nGuess it's only right because we grew up singing they shit\nBig shit, Mase shit, Nas shit, Jay shit\nTime for a Carolina nigga to take his place with the greats\nA slim nigga making bold statement\nUh, ay J. Cole how you do that there? I hear you blowing up my nigga\nI'm like, true that yea\nIn NY but smile every time I flew back there\nThat Carolina, Fayettenam oh yea my crew back there\nI go home been so long they saying, you back here? -\nTook a turn for the worst boy don't move back here\nDon't do that, yo who dat?\nHe rep the Ville when he spit it told you he be back with a record deal and he did it\nNigga, fuck spinning on my pivot homie, I'm finna travel till 'refs blow the whistle on me\nI got a whole fucking city that's just sitting on me\nBut it fits on my back, my state is sitting on that\nWill I drop? I think not I get up while they stop-like a sleeve on tank tops\nThey ain't give it all they got so they flop\nSo hey watch, how I'm finna take their spot\nNow I'm starting and they not-let me show you how to stay hot\nI play not, man I'm killing em even your idols feeling em dog\nThe same nigga used to chill in the mall\nWhile they were still in the mall, I was up there spilling my rap\nThe hero fighting villains just to put the Ville on the map\nAnd they ask and they ask and they ask and I tell them\nIt's the Fayettenam\nPut your glasses and your glasses and your glasses to the sky\nThis is the last call for alcohol\nThis is the warm-up!\nSo get your back up off the wall\nYeah man so shit, this was The Warm Up\nUm, what can I say, what can I say?\nIf you heard The Come Up that was about just a lil nigga from North Carolina man\nFayettnam to be exact\nMoved to NYC, chasing the dream\nI used college, if y'all niggas don't know, I used college as a tool to get to New York\nI ain't have no family up here or nothing like that, I came up here on a scholarship, nigga went to college\nAnd the whole time I ain't even think I would have to finish college, I just thought I'd be signed by my freshman year so I wouldn't have to finish college\nBut it didn't happen like that obviously, a nigga graduated and things started falling into place\nI got more focused, I dropped The Come Up\nAnd I look at The Come Up like, how kinda like how I was in high school\nJust picture this, The Warm Up is about a nigga who did not make the team when he tried out and I know it's a lotta niggas who know that feeling man\nYou try out, you think you deserve to be one the team and you go that day to look at the cut-list\nYou wake up and you can't even sleep, you're like, \"Damn I'm gon' make the team, I did my thing at tryouts.\"\nYou go to the list. All the niggas is looking at their names on the list, some niggas is like, \"Aww shit I see my name nigga I'm good, I'm good nigga I'm good, I see my name.\"\nAnd you're looking for your name, and you kinda play in the back, tryna wait for niggas to clear out cause you're not sure\nAnd you go to the list and your name ain't there\nAnd you're like, \"How the fuck did I not make this team? I'm better than him, I'm better than him, I'm better than him.\"\nSo a lotta niggas either quit or some niggas go harder and so that's kinda how I took the rap shit when I put out The Come Up\nCause ever since I was 15 I thought I was supposed to be signed\nBut you know, shit, everything happens for a reason\nSo shit fast forward to The Warm Up, this just me, like you know, me being that nigga that's practicing and making sure it's no way, it's undeniable that when I go to tryouts, there's no fucking way the coach is passing up on me, my nigga\nSo that's what this whole mixtape was about and lo and behold, you know\nAs I'm finishing the mixtape, the deal comes\nThank God, I'm blessed. Everything happens for a reason. And it couldn't have been with a more fucking, with a better fucking squad\nYou know the niggas I got on the squad if you listen to this then you might have heard who I signed with, I ain't even gon' blast it off like that\nShoutouts to, you know, Mark Pitts, definitely\nShoutout to my nigga Mike Rooney, my nigga E, shoutout to my whole fucking crew, man\nThat's The Warm Up is about man\nRG what's good, Mike Shaw, my nigga Mez, Mez held me down, nigga\nMore than anybody in the whole fucking, in the whole crew, honestly\nSo shit, let's get it, man\nWe got a lotta shit for '09, '010, '011, '0 goddamn 35\nThat's all I got man, that's The Warm Up\nI made the team\nSo when you go from making the team, now what you gotta do nigga, you gotta start\nYou gotta be a starter, you gotta make it to college\nYou gotta make it from college to the league, nigga\nTrust me, I ain't get no deal and fucking relax man\nI feel like I ain't made it yet period nigga\nAnd that's all I really gotta say yo, it's The Warm Up\nThank you for listening man\nYeah\n\n"}, {"title": "Losing My Balance", "year": "2009", "album": "The Warm Up ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Miss high profile caught you shopping on Canal\nI guess it makes sense, it seems phony as your style\nYour hair and your nails just as phony as your smile\nFake eyelashes, you drew your eyebrows\nIt make a brother ask, do you pride yourself?\nYour make up like a mask, tryna hide yourself\nIt seems on the outside, you thinking you the shit\nBut there's a soul that's inside that you don't even knew exist\nSo you so out of touch that the world mistreat you\nRich niggas fuck you and broke niggas beat you\nHoping this will reach you when you understand\nThat your value ain't determined by another man\n'Cause right now you let them brothers get the upper hand\nAnd you just tell them \"go deep\" like Cunningham\nAnd you just let them OD like Len Bias\nAnd that pussy so good he let his friends try it\nLosing your balance, yea uh\nLosing your balance, yea uh\nLosing your balance\nGirl you losing your balance uh, yea\nDon't slip, don't fall\nJust a get a grip my nigga, hold on\nDon't lose your balance\nDon't lose your balance\nI look around at my city, this is SinVille\nThat boy eleven-years-old and can inhale\nSometimes I ride around wondering if we in hell\nOr why do cops love to throw a nigga in jail\nI'm bout to lose it, I just had another friend killed (damn)\nOver some bullshit this cycle's like a windmill\nI had a convo with my soul I asked it \"When will, this shit change? \"\nIt said boy \"Just use them pen skills\"\nAnd so I write this for my niggas on the corner\nLove you 'cause you my brother, so I feel I got to warn ya\nThis shit ain't set up for a young brother to advance\nOn that note, you niggas playing right into their hands\nDamn, better get yourself some goals, you niggas better dream\nI know the hood raised you but it's bigger better things\nAnd for those that passed, I need a moment of silence\nSssssshhhhh\nYeah, and don't be losing your balance\nDon't be losing your balance\nDon't be losing your balance\nMy nigga, don't be losing your balance\nDon't slip don't fall\nJust a get a grip my nigga hold on\nDon't lose your balance\nDon't lose your balance\nI got a thing for this little mama\nShe do it to me plus her brain is forreal, I'mma sucka for love I guess\nWon't catch her up in the club cause she ain't into that\nKind of chick that rather rent a flick and get intimate\nSay she never fuck with thug niggas only gentlemen\nAnd yea that ass is fat but what's better is her intellect\nOther men would sweat her when we walk past\nCan't even blame em' did the same when I saw the ass\nMatch with the thin waist, brown with a slim face\nLove the conversation and the kicks was like a sensei\nNow she got me chillin' with her all around the clock\nMy homies beefin cause I never come around a lot\nKeep on telling me I changed and things ain't the same\nAnd ever since she came around I never want to hang\nThey tell me that it's foul how a chick can make me switch\nBut man I can't help it dawg, her mind got me whipped\nI think I'm losing my balance, yea uh\nI think I'm losing my balance, yea uh\nShe got me Losing your balance\nShe got me Losing your balance uh, yea\nBut I won't slip, I won't fall\nJust a get a grip and hold on\nLosing my balance\nLosing my balance\n\n"}]