[{"title": "Cole Summer", "year": "2013", "album": "Truly Yours 2 ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Love, love, love, love\nLove, love, love, love, love\nIt's only what you got in the form of the highest power you seek\nNow this right here's not a preview\nI need to let it go\nYeah\nNow this right here is not a preview\nOf what the album goin' to bring you, or nuttin' like that\nSharing things I think quietly, with those that admire me\nRemember MTV Diaries? This something like that\nI wear my heart up on my sleeve, and I bleed for you\nCookin' beats hoping' to reach like each one you\nWhen I release, trust if you feel like my shit is weak\nWhen you see me on the street, then speak, I refund you\nThis sample was yellin' \"loop me!\"\nMs. Hill, please don't sue me\nCause I ain't one of these rappers out here frontin' like he got it, nigga\nI ain't fuckin' got it, nigga...\nThrowing thousands in the strip club with Drizzy\nDifference is I'm throwing four, he's throwing 50, Lord, forgive me\nBitches saying: \"You a rapper nigga, ain't you s'posed to tip more?\"\nI don't see no pussy, baby, ain't you s'posed to strip more?\nConfessions of a cheap-ass nigga\nBut I finally put my Momma in that E class, nigga\nAnd I told her quit her job, but hold your horses\nIf my next album flops it's back to the post office, both of us, shit\nThey're saying that's a real possibility\nThe thought alone is killing me\nI think I need to let it go\nI need to let it go, uh\nI think I need to let it go\nLet it go, let it go\nI think I need to let it go\n'Cause nothing even matters...\nAnticipating rain, I can't make the same mistakes again\nThem '90s niggas raped the game\nAnd left us with a battered and bruised bitch, with a few kids\nThe pussy loose, but the truth is I love her, though\nShe ain't perfect, but who is?\nHoes saying \"Cole, you is\" don't be silly, ma, 'cause really I\nJust a born sinner the opposite of a winner\nCole summer, I predict another winter\n'Cause I'm fin' ta drop knowledge like a five percenter\nFuck the Bilderberg, nigga show 'em God sent ya\nRhyme with the skill, as if Nas went to\nCollege on scholarship met Pac and said \"I'm down witcha\"\nAnd when they wasn't writin' rhymes they fuckin' line sisters\nPuffin' on swishers, what's up Milan?\nEvery time I drop I get the net poppin' like Lebron swishes\nKay told me kill ya, and I gotta respect my Mom's wishes\nWhen I let go this how my mind switches\nNo looking back, don't even want to see my prom pictures\nPardon the rhyme scheme, I guess I'm long winded\nLet me switch it now, back to Hell's kitchen now\nUp in Hova office like he the fucking principal\nPut me in with Stargate, that shit was like detention now\nJust tellin' my story so dissin' ain't my intention now\nDrop a couple hits and all the dummies pay attention now\nA shame when you learn the ins and outs of the game\nAnd reminisce on little Jermaine in the south\nRappin' out loud, with all the niggas that's cool to you\nJust to realize that all them niggas was foolin' you\nAnd they ain't who they said they were\nTalk about the streets, but nigga that ain't really where they were, actin' just like there they were\nBut who am I to judge? That's neither here or there\nJust know I know, my nigga, I just like being aware\nIf I had one wish, I would fuck Tia and Tamera\nAt the same time and put name tags on they titties\nSo I don’t get they names wrong, screamin' \"Game on\"\nLike Wayne's World, that just came on\nI'm rambling now, five days to finish the album, I'm scramblin' now\nTook a break from samplin' now\nJust to say a few words to this bitch named Summer\nJune will make four years since I gave you my number\nThe Warm Up dropped, I got hot, you called it a classic\nAnd Jay dropped \"Autotune\", you wanted him back, shit\nPlay my position, the whole while still wishin'\nA year later Drake put his key in your ignition\nAnd I told my fellas I dropped Friday Night Lights\nIn the winter just to make her jealous\nWanted to drop the album in the summer, but the label didn't think that they could sell it\nRecoup the first week, I think it ain't shit they can tell us\nDo you agree?\nBeen a long time coming this thing between you and me\nI can't let it go\nI can't let it go, nah\nI think I need to let it go, let it go\nLet it go\nThey say I need to let it go\n'Cause nothing even matters, ayy\nYeah\nJune 25th\nBorn Sinner, bitch\n\n"}, {"title": "Kenny Lofton", "year": "2013", "album": "Truly Yours 2 ", "writers": ["the manhattans", "j. cole", "jeezy", "j cole"], "artist": "j cole", "lyrics": "Hurt, to think that you lied to me\nHurt, way down deep inside of me\nAnd it breaks my heart...\nI seen it all at this young age\nThe only thing left to do is die and hit front page\nShould I knock on wood and pray like God forbid?\nThese hoes be poppin' pills, these niggas be poppin' shit, bitch\nPac on the mic in his prime\nThey only care 'bout a nigga when he writing a rhyme, boy\nKenny Lofton, you feelin' my pace?\nThey only care 'bout a nigga when he stealin' the base\nIt's like I'm Wilt the Stilt, I'm fucking them all\nThey only care 'bout a nigga when he dunkin' the ball, mane\nAnd it breaks my heart\nThe world’s a stage, I'll just play my part\nJust caught fire like a young Richard Pryor with unforgettable quotes\nThey only care 'bout a nigga when tellin' a joke, or when he's sellin' his dope\nThey tell the reverend \"Man, I rather get to heaven with coke\nThen live in hell and be broke\"\nShout out to black man who beat the odds by yellin' for hope\nToday he asked if I could Twitter y'all and tell you to vote\nMy nigga, how could I, knowing what I know\nIt's a game of charades, masquerade for the dough\nRead the teleprompter these niggas is actors on the low\nYeah I voted for the nigga 'cause he got the best show\nLike I got the best flow\nOn your mark, set, go\nMama got us out the hood but we still ghetto\nI seen it all at this young age\nThe only thing left to do is die and hit front page\nShould I knock on wood and pray like God forbid?\nThese hoes be poppin' pills, these niggas be poppin' shit, bitch\nPac on the mic in his prime\nThey only care 'bout a nigga when he writing a rhyme, boy\nKenny Lofton, you feelin' my pace?\nThey only care 'bout a nigga when he stealin' the base\nIt's like I'm Wilt the Stilt, I'm fucking them all\nThey only care 'bout a nigga when he dunkin' the ball, mane\nAnd it breaks my heart\nThe world’s a stage, I'll just play my part\nPac on the mic in his prime\nThey only care 'bout a nigga when he writing a rhyme, boy\nKenny Lofton, you feelin' my pace?\nThey only care 'bout a nigga when he stealin' the base\nIt's like I'm Wilt the Stilt, I'm fucking them all\nThey only care 'bout a nigga when he dunkin' the ball, mane\nAnd it breaks my heart\nThe world’s a stage, I'll just play my part\n\n"}, {"title": "Chris Tucker", "year": "2013", "album": "Truly Yours 2 ", "writers": ["2 chainz", "j. cole", "j cole"], "artist": "j cole", "lyrics": "I can't control this urge to fuck hoes and splurge\nMy sidepieces got real jobs, nigga I don't fuck with no birds\nMy main chick she got real hair, never had to shop to get hers\nGot a neat freak that don't eat meat, but goddamn she rocking them furs\nBall so hard mothafucka wanna fine me, and now the hoe wanna climb me\nIf real recognize real, that's why it took a motherfucker like Hov to sign me\nBall so hard I'm the truth nigga, All-Star game catching 'oops nigga\nIf you a bitch and I'm a bitch, I'm Sheryl Swoopes and you hoops nigga\nCole world, safe to say I'm cold blooded\nIn this cold life the more cold you are seem like the more the hoes love you\nSo I book a flight, she land today, she leave tonight with no luggage\nGot the camera on in my bedroom, shooting video with no budget\nGo! Only nigga up in first class, old lady tryna be friendly, ayy\nShe think I'm in the NBA, why a nigga can't have his MBA?\nNext time I'ma flip the script, you know, kick some shit that's gon' shock her\n\"You're so tall, what team do you play for?\" No bitch, I'm a doctor\nFlow hella proper, Cole never flopped, nah\nFloat like a propeller, no helicopter shit\nKnots thick like a bowlegged chick\nStick dick to a gold digger, won't give her dollar\nFuck your nine I'm a whole different caliber\nNigga say they pop cause they dont fill they collars up\nRead a book get your knowledge up, book a flight get ya mileage up\nBitch nigga...\nThis liquor I've been sippin' got me kissing all these models\nAnd I might not see tomorrow, I might not see tomorrow\nPlease don't tell my momma I spent my tuition on these bottles\nJust to pay back all these loans man we gon' have to hit the lotto'\n\n"}, {"title": "Head Bussa", "year": "2013", "album": "Truly Yours 2 ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Now do I roll up, get higher?\nOr po' up, get tired?\nDo I roll up, get higher?\nOr po' up, get tired? Yeah\nOkay, I'm back on a mission to pay my tuition\nGot loans out the ass, what you know 'bout my past?\nI was so late for class, hit the probate, get trashed\nFell asleep off the Henny, back in '08, I crashed\nWith my foot on the gas, thank the Lord I'm still here\nNo insurance, so now I'm racin' home on first gear\nOn that morn' I shed tears, asking what I'm doing here\nI should be rich, I'm sick, it's like I got the fuckin' flu in here\nBut yet I'm just chillin' like I'm back on the yard\nMy niggas say I'm the truth and when I rap they applaud\nThat what was my Unsigned Hype like in the back of The Source\nIt's like I'm tryna get the head, but she just jackin' me off\nI needed more\nHad to earn stripes, no Adidas store\nPut my feet on floor, borrow money from mi amor\nJust to cop a microphone, the same one that put me on tour\nShe held you down, now you out here fuckin' 'round\nOk my granny just died, but I'm too broke to go\nAnd she asking my fears but she too close to know\nGot trust issues I'm trying, where it come from? Don't know\nI just block out the pain, blow the fuck up, get dough\nSee, I thought that would help me, it turns out it's worse now\nMy girl want her first child, my label won't work out\nMy mama don't see me unless I'm on TV, I pray she (dont break down)\nShe strong, but she need me\nThey killed Saddam, now I wonder who's sane\nHow you balance being Batman, Bruce Wayne?\nOld chick callin', but I'm onto new things\nShe still a dime, but I always lose change\nYoung Simba, went from bottom of the food chain to a few chains in a new Range\nShe tellin' me \"So much has happened, would've thought you changed!\"\nWe ain't fuck in nine months its safe to say I'm due man\nNow this is for my broke niggas, rich niggas, what?\nGold diggers, Crys sippers, what?\nCold nigga, flow sicker, what?\nMuh'fucker, I'm a fuckin' head bussa, go\nComing down on the strip, liqour in the whip\nParking lot pimp, enough game to be sold\nLearn from me, fuck bitches, burn money\nSomeone told me \"Boy, you got your whole life to get old.\"\nBut everything that glitter ain't gold\nThe grass ain't greener, I've been told\nShe told me, \"Boy you want your cake and eat it too?\"\nI said \"It's cake, that's what you're supposed to do?\"\n\n"}, {"title": "Cousins", "year": "2013", "album": "Truly Yours 2 ", "writers": ["bas", "j. cole", "j cole"], "artist": "j cole", "lyrics": "Time keeps slipping away, away\nAnother day another love song, hey\nAnother day another love song, hey\nTime keeps slipping away, away\nAnother day another love song, hey\nAnother day another love song, hey\nYeah\nCousin in jail again, asking me for bail again\nClose when I was 12, but I was much frailer then\nHe was like 16, a nigga from the gutter and\nYears ago his favorite uncle had married my mother and\nHere we are, runnin' through the Ville like dumb and dumber and\nFor that summer man I swear I wish you was my brother then\nWell time passed and we fell off cause you moved back home\nLittle did you know Jermaine done grew a new back bone\nNiggas thought he wouldn't make it 'till he proved that wrong\n12 years later on the radio that Who Dat song\nYour homeboy bumps the Warm Up now you buggin'\nCause you looking at the cover and you say \"Yo that's my cousin\"\nAnd niggas looking at you like you lying but you wasn't\nNext thing I know you blowing up my line all a sudden\nAnd I'm showing love saying \"yo look what I did\nMan, nobody coming from here ever did this shit this big\"\nBut now you saying \"Man enough about you\nShit what about me, my nigga what about me?\nOh you forgot about me?\"\nSame niggas showed you how to rap, now you don't know how to act\nBoy I'm at the bottom you could pull a nigga out of that\nPut me in a video, yo put me on your hottest track\nBring me on the road with you, you know 'cuz got yo back\nAnd I'm strapped up if them niggas act up\nSee you headed to the top you need to let me catch up\nPlease let me catch up\nWon't you let me catch up man\"\n\"I'll see you when I see you\nHarsh as it seems to say, I wouldn't want to be you\nBail you out for your daughter and I pray to God\nA nigga never pull your card or she won't ever get to see you\"\nTime keeps slipping away, away\nAnother day another love song, hey\nAnother day another love song, hey\nTime keeps slipping away, away\nAnother day another love song, hey\nAnother day another love song, hey\n\n"}, {"title": "3 Wishes", "year": "2013", "album": "Truly Yours 2 ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Yeah\nGrew up with killers, I ain't know they was killers\nWe was just together, man, playing Mega Man on Sega, man\nYour mama loved me to death, she reminded me of Afeni\nYeah, a real black queen, if I had a genie\nI'd wish that she ain't struggle no more\nY'all wouldn't have to go to sleep with all the roaches if she wasn't so poor\nYou told me when you came to my house this shit was like a timeout\nFrom reality, one night you asked me what I'm crying 'bout\n'Cause you was staying over for the weekend\nI woke up from out my sleep when I heard mama and my stepfather beefin'\nI don't know if he'd been drinkin', but I know this shit got loud\nAnd I heard rumbling from struggling and rolling on the ground\nCould never get used to that sound, my mama saying \"Get off me!\"\nMy tears is tumbling now, I wish that you never saw me, 'cause I\nFelt like a coward, so powerless I was only 12\nI wish I would'a bust through that door my fucking self\nAnd grabbed the Glock right off the fucking shelf, if nothing else\nScared a nigga shitless, there goes two of my wishes\nForever scarred, determined to get some heart\nNo matter how big the nigga, no matter how small you are\nFast forward to our older years, two different paths\nYou used to talk to me 'bout college, but that shit didn't last\nWasted potential, getting cash, what could I say?\nSo tired of not having things, you'd never see it my way, too proud to fold\nYour demise, one day much to my surprise\nMy nigga called me, told me you just caught a body twice your size\nI asked if it was self-defense, he said it was defense of pride\nAnd that they tryna give you ten, but if you lucky you'll do five, damn\nNot my nigga, the same one that told me\nThat things always get better, just trust me, don't cry my nigga\nThe news call him a killer, but he my nigga\nSad shit, aye yo, genie last wish, free my nigga\n\n"}]