[{"title": "Can I Holla At Ya", "year": "2013", "album": "Truly Yours ", "writers": ["j. cole", "lauryn hill", "j cole"], "artist": "j cole", "lyrics": ""}, {"title": "Crunch Time", "year": "2013", "album": "Truly Yours ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Cause it’s crunch time\nCause it’s crunch time\nShit real man\nA nigga got bills man it’s crunch time\n\nShit real man a nigga got bills\nLook, scavenge these records of these days MP3’s\nLooking for the samples to put a nigga on MTV’s\nThis is for nigga’s with empty dreams and empty jeans\nStill holding on to the word maybe\nCause this 9 to 5 shit is driving you stir crazy\nComing home tired just to hear it from your lady\nHollering about your baby, need this and need that\nAnd all you want is peace and quiet\nMaybe some feedback, on these raps\nCause labels ain’t hollering, and niggas ain't downloading\nNobody see your vision, they walking around blindfolded\nAll this time holding on to possibilities\nYou step outside, you smoke a blunt and then you feel the breeze\nFuck what they talking, it ain’t like life come often\nOnly thing worse than death is a regret filled coffin\nSo try before you die or always wonder what if?\nI thank the lord for this wonderful gift\nLooking for strength in this crunch time\nLooking for strength in the crunch time\nThis shit real dawg a nigga got bills dawg\nIt’s crunch time, yeah nigga it’s crunch time\nThis shit real dawg a nigga got bills dawg\n"}, {"title": "Rise Above", "year": "2013", "album": "Truly Yours ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Rise above, rise above\nAnd you’ve got to\nRise above, rise above\nShe had a little daughter with her, it was cold out\nShe said “ah, I hate this motherfucker,” then she rolled out\nHe ain’t answering his phone, she yells “what the fuck?!”\nThen told her daughter “buckle up, yeah, that’s for safety”\nSee she been stressin’ lately\n‘Cause this nigga she done been with for the past two years\nIs now the current reason for her last few tears\nShe text, he don’t text back\nWhen she see him she be tryna sex, he don’t sex back\nHis heart be on jet black\nShe call, he don’t call back, all he say is “fall back”\nA nigga just need his space, so she headed to his place\nCause she just got a call from her homegirl Rhonda\nWho said he been creepin’, he been fuckin’ with Yolanda\n“Yolanda? Yeah girl, Yolanda”\n“Told you he ain’t shit but you ain’t listen, I was tryna” –\n“Click” – hmmm, hung up that phone and hopped right up in that Honda\nHeaded to his crib, she said she fed up with this shit\n“Thought this time this was the one, thought I got better at this shit”\n“Pickin’ out Mr. Right, stick it out through the fights”\n“And long nights, for what? These niggas is all alike”\nShe gon’ set it off, her daughter gon’ witness it all tonight, damn\nRise above, rise above\nAnd you’ve got to\nRise above, rise above\nShe said she just finished school, could barely pay tuition\nNow she teaches 7th grade, tryna make a difference\nAye, but the kids frustrate her, say that they don’t listen\nA ass like that, how the fuck they supposed to pay attention?\nI’m fuckin’ with you, but for real, she say they hopeless\nA class full of jokesters, creating all the obstacles, impossible to focus\nLittle niggas barely read, tryna give them what they need\nAnd they don’t even try, one little boy, he caught her eye\n‘Cause he look just like her brother, she be havin’ to call his mother\nBut she act like she don’t care – what father? He ain’t here\nNow she frustrated, thinkin’ that she just made the mistake of her life\nUnderpaid, be havin’ to waitress at night\nSix years of college down the drain, drinkin’, tryna drown her pain\nParty with her girls, feeling sorry for the world\n‘Cause ain’t no hope for the youth, well ain’t that the truth\nWhen all your role models either rappin’ or they hoop, damn\nRise above, rise above\nAnd you’ve got to\nRise above, rise above\n\n"}, {"title": "Tears For ODB", "year": "2013", "album": "Truly Yours ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "Tears for ODB, drug-induced poetry\nWhat’s the use? Strung-out from that drug abuse, woe is me\n80's baby, so I know my pops was gettin’ high\nIn the 90's, me and mama barely gettin’ by\n2000's I was concentratin’ more on gettin’ fly\nGettin’ bitches, gettin’ rich to get the shit I couldn’t buy\nYou know the story, you know my allegory\nI was sent from Heaven with a set of horns, they’d better warn y’all\nI’m here for more than just to kick some witty metaphors, dawg\nThis more of the type of shit you spit to set a war off\n‘Cause niggas be poor, get money and still don’t know\nWhy the fuck they can’t cop a house, the system meant to lock us out\nBut I’m knockin’ down the door, strapped up with a four-four\nRobin Hood, shit and yeah, I’m ‘hood rich\nThat’s good enough to stay in new kicks and a good whip\nGet good head from a good bitch, I give two shits, I’mma tell you straight up\nStraight up\nStraight up, aye, any chance I’mma take it\nRather die before I fake it\nThey say life is what you make it, bitch, but I’m just tryna make it\nStraight up\nStraight up\nStraight up, aye, any chance I’mma take it\nRather die before I fake it\nThey say life is what you make it, bitch\nLord have mercy on my soul, what I’ve done and what I’ve seen\nMy life has tumbled into that which only you could intervene\nI put my heart in senseless things: money, bitches and street shit\nFascinated by beef, sad to say I won’t be shit\nGrew up in this bitch without a pot to piss in, no toilet\nHow ironic, I took a lot of shit, like a bottom bitch\nOr a model chick, high off coke\nThey lockin’ sons up for less, I don’t care how y’all cope\nBut yet I still peddle this dope and these pills\nI’ll never know how sittin’ comfy on that Oprah seat feels\nMore than likely be on Most Wanted posters, we still\nHoldin’ on to old dreams of bein’ Hova, be real\nWe the forgotten souls, bottom of the totem poles\nLeft for dead, some niggas fled, people said they sold their souls\nI just think they found a better way, Lord knows I never pray\nBut sometimes I be wishin’ I could levitate, I’ll take it straight up\nStraight up\nStraight up, aye, any chance I’mma take it\nRather die before I fake it\nThey say life is what you make it, bitch, but I’m just tryna make it\nStraight up\nStraight up\nStraight up, aye, any chance I’mma take it\nRather die before I fake it\nThey say life is what you make it, bitch\n\n"}, {"title": "Stay (2009)", "year": "2013", "album": "Truly Yours ", "writers": ["j. cole", "j cole"], "artist": "j cole", "lyrics": "You can drop a “Wet Floor” sign down for the tears\nGod and my court date, the two things I fear\nMan, they tryna give a nigga years\nI’m tryna figure if I should even appear\nOr should I skate town, catch a Greyhound\nChange my name right, catch a plane flight\nOut the country, let them ma’fuckas hunt me\nCome and catch me if you want me\nKnow they’ll lock me if I stay\nBut where I’mma run to\nI got a good girl, we got a son too\nAnd all we went through, we ain’t see eye-to-eye\nBut what you told me way back, you was a ride-or-die\nSo if they give me one, or if they give me two\nOr if a nigga gotta sit down and do a few\nBefore I go, baby, I gotta know, what would you do?\nWould you find someone new or would you stay?\nLike the hoes when they lay with me?\nPuppy eyes when I go, sayin’ “stay with me”\nAw, girl, you bad as hell and yet I’d love to\nBut see I got a girl I’m really makin’ love to\nTherefore I’m feelin’ a lot more guilty when I rub you\nThat’s why I skip all of that kissin’ when I fuck you\nFlush the condom down the toilet then I skate\nI had you, but you can’t have me, I never stay\nStay\nHa! Life in a hometown, ‘fore I could take a step\nI’m gettin’ grown now\nAnd startin’ to notice that I see the same hoes around\nGuess they had to go ‘round, my raps is profound\nI got the flows, but yet a nigga ain’t got no sound\nCopped a beat machine, I’m cookin’ up my own now\nGot my mind on the city where it goes down\nSee, if I’mma get to where I’m goin’ then I can’t stay\nAlthough I love it here\nI’ll be damned if I sit around another year\nDreamin’ dreams, hopin’ somehow that they just appear\nThe hardest part of leavin’ is to know my mother here\nOh, but I’m comin’ back – oh boy, believe that\nLet’s show the little niggas, boy, you can achieve that\nGot the city on my shoulders, piggy back\nHello, my name is Cole and I’m here to stay\n\n"}]