[{"title": "Intro (COLOURS 2)", "year": "2017", "album": "COLOURS 2 ", "writers": ["partynextdoor", "majid al maskati"], "artist": "partynextdoor", "lyrics": ""}, {"title": "Peace of Mind", "year": "2017", "album": "COLOURS 2 ", "writers": ["partynextdoor"], "artist": "partynextdoor", "lyrics": "All I wanna do is lay up with you\nAll day, all day (All day, all day)\nNothing else, nothing else (Nothing else)\nThan spend time with you all day (All day)\nBut I gotta get to the money, baby, yeah\nWe both love these hunnids, yeah\nOnce I'm finished with my job, baby girl, yeah, I'm on my way, yeah\nI'ma cop you that new Pedro Garcia up on display\nYou know I don't say things just to say things, yeah\n(Oh na na na na)\nNever felt, never held, never had no love like you\n(Oh na na na na)\nBut this right here, I'm keepin' to myself\nI don't wanna lose\n(Oh na na na na)\nYou\nDon't wanna lose you\nCouldn't, can't, wouldn't, won't lose you, yeah (Phew, uh, ooh)\nWhen it feel this good, you better keep it (Ooh)\n(When it feel this good, you better keep it)\nWhen it feel this good, you better keep her around (Yeah, keep her around)\nWhen it feel this good she get the key to the house (Oh, yeah)\nBecause in exchange you give me peace of mind\nBaby, you could take (Coulda did it, baby) all my time (My time, yeah)\nAll I needed was a piece (All I needed was a piece)\nAll I needed was peace (All I needed was peace)\nSomeone that gon' listen to me (Someone that gon' listen to me)\nReal niggas need real relief (Oh)\nBut we both know my time ain't cheap\nAll I wanna do is lay up with you\nAll day, all day (All day, all day)\nNothing else, nothing else (Nothing else)\nThan spend time with you all day (Day)\nYou gave me peace of mind, yeah\nOoh, I'd retire right now but I'm too young, baby (Baby)\nIs it love? Is it love? Or am I sprung, baby? (Baby) Oh, oh, oh, oh\nGotta take it, gotta gotta take it slow now (Slow now)\nHaters mad I got my ducks in a row now (Ducks)\nGot my lil' wifey and I'm feelin' real grown now\nShe for stable, it's 125 for the show now (We for racks, huh, rackin')\n(Oh na na na na)\nI showed love to my old woman\nBut never love like this (Never showed 'em love like this)\n(Oh na na na na)\nNo one wants to lose a love like this (No, no, no)\n(Oh na na na na)\nA lady with patience\nA lady with patience, yeah\n(Oh na na na na)\nI did crazy things and she still waited on me (Phew)\nWhen it feel this good, you better keep it (Feels, ooh)\n(When it feel this good, you better keep it)\nWhen it feel this good, you better keep her around (She's fine)\nWhen it feel this good she get the key to the house (Yeah, hmm-uh)\nTell me \"treat me like my spouse\"\nBecause in exchange you give me peace of mind (Peace of mind)\nBaby (Ooh, nah, nah), you could take all my time (You could take all my time, yeah)\nAll I needed was a piece (All I needed was a piece)\nAll I needed was peace (All I needed was peace)\nSomeone that gon' listen to me (Someone that gon' listen to me)\nReal niggas need real relief (Oh)\nBut we both know my time ain't cheap\nAll I wanna do is lay up with you\nAll day, all day (all day, all day)\nNothing else, nothing else (Nothing else)\nThan spend time with you all day (Day)\nYou gave me peace of mind\nYou gave me peace of mind\nYou gave me peace of mind\nYeah, peace of mind (Yeah, peace of mind)\nOh yeah\n\n"}, {"title": "Freak In You", "year": "2017", "album": "COLOURS 2 ", "writers": ["partynextdoor"], "artist": "partynextdoor", "lyrics": "Room full of beautiful women but I want one\nRoom full of women and they notice me\nNow all they wanna listen to is Jodeci\nFreak in you (freak in you)\nFreak in you (freak in you)\nIs there a freak in you? (Freak in you)\nCome and talk to me, oh\nQuick, rush, rush, rush\nBaby, just like Kimora Lee, oh\nSo pretty, girl, you belong in a gallery\nWhat's your fantasy? (Your fantasy?)\nSay something you ain't never did (ain't never did)\nLike fuck and suck a real nigga\nI'm flickin' my wrist like I'm a fisher\nDiamonds on my chest like a bishop\nAnd these lines right here ain't no pickup\nThese lines right here gon' really, really make you fuck\nThese lines really gonna make you numb like Chuck\nThis time is your time\nI need to know if you're down\n'Cause if not, I know there's more around\n(There's always more)\nThere's always more, that’s for sure\nThere's always more, that’s for sure\nBecause there's a room full of beautiful women but I want one\nRoom full of women and they notice me\nNow all they wanna listen to is Jodeci\n(All I care about is)\nFreak in you (All I care about is)\nFreak in you (freak in you)\nIs there a freak in you? (Freak in you)\nCome and talk to me, oh (talk to me, oh)\nI, I don't like the shy game\nI don't like no mind games\n'Cause by the time you make your mind up\nTime's up\nHey, hey, you gon' have to climb me, climb me\nIf you want it\nBurnin' rubber (skrrt)\nBurnin' through these rubbers is exhausting\nDrop, drop, hot\nBaby girl, it's Crossfit\nI'm gon' grab you by the hips, hey\nThere's a room full of beautiful women but I want one\nRoom full of women and they notice me (they notice me)\nNow all they wanna listen to is Jodeci (Jodeci)\n(All I care about is)\nFreak in you (all I care about is)\nFreak in you\nIs there a freak in you?\nMa-Magic City bumpin', but my crib is nicer (bumpin')\nGot wifey at home\nYour night could pan out if wifey like ya\nI seen your old niggas lookin' like some old niggas (yeah)\nI’m in the ‘sace mansion with some Gucci ghost slippers (Gucci ghost slippers)\nI got more gold in my mouth, I think she a gold digger\nThat spandex might triple my antics\nMight take off the bandage, might fuck like a savage\nPrayers out to Magic, sav-sav-savage, mmm\nThere's a room full of beautiful women but I want one\n(I'm lookin at you)\nRoom full of women and they notice me (they notice me)\nNow all they wanna listen to is Jodeci (Jodeci)\n(All I care about is)\nFreak in you (all I care about is)\nFreak in you\nIs there a freak in you?\n\n"}, {"title": "Low Battery", "year": "2017", "album": "COLOURS 2 ", "writers": ["topflr", "partynextdoor", "g. ry", "m3rge"], "artist": "partynextdoor", "lyrics": "My battery's low, but I hope my messages come through\n'Cause I need answers from you\nI need answers from you\nI got questions for you\nSo why don't you got answers for me? (Oh na na na, oh na na na, oh yeah)\nHave you ever lied?\nIt's a dumb question, baby girl, 'cause everybody lies\nBut did you lie with someone else, baby?\nWhat you tryna do? Are you tryna hurt my ego?\nLook you know it's actually on a hunnid\nBut babe, right now it's on a zero\nI'm not gon' ask you was it worth it\n'Cause I know I'm not perfect\nWe are young and you're still searching, and uncertain\nMy heart's been broken before\nThis a feeling I already know\nI just want the truth, it's just between me and you\nThey don't even know, they don't even have a clue\nConfess, confess, girl, need to know facts\nConfess and text me back, don't hold back\nMy battery's low, but I hope my messages come through\n'Cause I need answers from you\nI, I need answers from you\nI got questions for you (ooh)\nSo why don't you got answers for me? (ooh)\nHave you ever lied? (Have you ever lied?)\nIt's a dumb question, baby girl, 'cause everybody lies\nBut did you lie with someone else, baby? (Yeah, yeah, yeah)\nWhat you tryna do? Are you tryna hurt my ego? (What you tryna do? Ego)\nListen, you coulda said you want to see different people\nNever knew that your love was so lethal\nShot, shot, shot, it's a shot, baby\nKept your secrets on the D-low\nLow-key like a C-note\nOh, oh, no need for the long-talking, girl\nI just want the truth\nFace it, reality, there's no getting back with you\nGive me the truth, it's just between me and you\nThey don't even know, they don't even have a clue\nCo-confess, confess, girl, need to know facts\nConfess and text me back, don't hold back, oh, woah\n'Cause my battery's low, but I hope my messages come through\n'Cause I need answers from you (I need answers from you)\nI, I need answers from you (I need answers from you)\nI got questions for you (I got questions for you)\nSo why don't you got answers for me?\nHave you ever lied?\nIt's a dumb question, baby girl, 'cause everybody lies\nBut did you lie with someone else? Oh, woah\nSomeone else\nYou must have wanted someone else\nMy battery's on low and I hope my messages go through\n\n"}, {"title": "Rendezvous", "year": "2017", "album": "COLOURS 2 ", "writers": ["partynextdoor"], "artist": "partynextdoor", "lyrics": "Little lady, come and tell me something, say something, yeah\nIs it something or nothing? Yeah, yeah\nYou going back and forth, back and forth, back and forth\nI don't know what you want, yeah (no more)\nI know you're used to him\nBut you really want something real\nSomeone to keep up with you, baby\nKeep up with you, yeah, yeah\nPut a Range out, it's your pain now\nDealing with fame now\n'Cause you're sweet like sugar-sugar cane now\nBitch, that bitch, that bitch, she poppin'\nHow many times did I get you wet\nThe night I pulled up to the dock? Yeah\nAnd I even..\nHad to pull you to the side and tell your friends to chime in\nYou said you was joking\nBut I could tell you want my baby (baby), yeah, yeah\nGirl, I'm older than you\nYou cannot play me, you a baby\nI'm not fooled by the money that you got (got)\nYou're still Jenny from the motherfuckin' block (block)\nBaby, yeah, yeah, you got money, I got money too\nJust let me know what you wanna do\nLittle lady, come and tell me something, say something, yeah\nIs it something or nothing? Yeah, yeah\nYou going back and forth, back and forth, back and forth\nI don't know what you want, yeah\nNike, Nike, I'm done checkin' on you\nThree stripes, I got two up on you\nGirl, you know what I wanna do\nI wanna rendez-rendezvous\nI got too much to lose\nYou might disagree, that's your point of view\nI ain't tryna find love, I'm tryna find the truth\nI ain't tryna do nothin' but have fun with you\nSecret, I'ma keep it, all day, all day\nSlow jams? you like slow jams, S.A.D.E shawty\nBut I could tell you want my baby (baby), yeah, yeah\nGirl, I'm older than you\nYou cannot play me, you a baby\nI'm not fooled by the money that you got (got)\nYou're still Jenny from the motherfuckin' block (block)\nBaby, yeah, yeah, you got money, I got money too\nJust let me know what you wanna do\nLittle lady, come and tell me something, say something, yeah\nIs it something or nothing? Yeah, yeah\nYou going back and forth, back and forth, back and forth\nI don't know what you want, yeah (no more)\n\n"}, {"title": "Freak In You (Remix)", "year": "2017", "album": "COLOURS 2 ", "writers": ["partynextdoor", "drake"], "artist": "partynextdoor", "lyrics": "Room full of beautiful women but I want one\nRoom full of women and they notice me\nNow all they wanna listen to is Jodeci\nFreak in you (freak in you)\nFreak in you (freak in you)\nIs there a freak in you? (Freak in you)\nCome and talk to me, oh\nQuick, rush, rush, rush\nBaby, just like Kimora Lee, oh\nSo pretty, girl, you belong in a gallery\nWhat's your fantasy? (Your fantasy?)\nSay something you ain't never did (ain't never did)\nLike fuck and suck a real nigga\nI'm flickin' my wrist like I'm a fisher\nDiamonds on my chest like a bishop\nAnd these lines right here ain't no pickup\nThese lines right here gon' really, really make you fuck\nThese lines really gonna make you numb like Chuck\nThis time is your time\nI need to know if you're down\n'Cause if not, I know there's more around\n(There's always more)\nThere's always more, that’s for sure\nThere's always more, that’s for sure\n"}]