[{"title": "Let’s Get Married", "year": "2014", "album": "COLOURS ", "writers": ["partynextdoor"], "artist": "partynextdoor", "lyrics": "I've finally realized what I need\nCan only be royal if you loyal girl\nAnd all I need is a woman who will wanna agree with everything that I do\nAnd get naked for me when I want her to\nAll I need, make it feel like forever\nWhen it's temporary, let's get married\nJust cause this moment deserves a moment\nJust cause this moment, deserves a moment\nLet's get married, let's get married\nI'mma get drunk enough and get crazy enough\nTo say something just as crazy as let’s get married\nLet's get married, let's get married\nStill I need me a freak, I'm coming straight out of Montego Bay\nYou working seven days a week\nI know how you feel cause I feel the same\nWe put the same shit in our brain\nIt was that molly, coked up on Dolly\nAll that you need is some green girl you a rockstar when with me\nGirl I know, I know, I know, I know, I know, I know, I know\nI know, I know, I know, you sometimes feel outta' control\nBut baby you know that this moment deserves a moment\nJust cause this moment, deserves a moment\nLet's get married, let's get married\nI'mma get drunk enough and get crazy enough\nTo say something just as crazy as let’s get married\nLet's get married, let's get married\nI've finally realized, can only be, if you loyal\nNeed, need, need\nWhen it's temporary, moment\nDeserves a, moment, deserves a\nLet's get married, let's get married\n\n"}, {"title": "Girl from Oakland", "year": "2014", "album": "COLOURS ", "writers": ["partynextdoor"], "artist": "partynextdoor", "lyrics": "Stop looking for a reason to hate me, just hate me\nNobody's perfect you know, I'm working on me\nThey jealous so they lurking on me, I don't mind\nMy new girl's not too thirsty to ride, she riding for me\nRide or dying for me\nGirl, you're the reason, you're lonely tonight\nBut this is the season to get back your life\nThis is your chance (I know you know the truth)\nCome take a chance (It's not that I blame you, I know you know the truth)\nWhen you see (I know you know the truth)\nIt's not that I blame you, it's not you that I blame you\nI blame you\nFive foot five of pure sexy, I see you\nEvery bitch wanna be you\nEvery nigga wanna meet you\nYou're getting bookings in my city\nI see niggas looking in my city\nAnd I know what you been up to\nBut that is no good, it's no good even though I do it\nBaby, I'm outchea, baby, I'm outchea, you know what I'm pursuing Yeah you can know, girl, you're the reason, you're lonely tonight\nBut this is the season to get back your life\nThis is your chance (I know you know the truth)\nCome take a chance (It's not that I blame you, I know you know the truth)\nWhen you see (I know you know the truth)\nIt's not that I blame you, it's not you that I blame you\nI blame you\nAnd what do your say to a girl that's heard it all before?\nTell me\nAnd what do you say to a girl that’s heard it all before?\nSay\nTime is wasting, time is wasting\nTime is wasting, babe, time is wasting\n“Bitch, hurry up. This nigga finna' to move on! Get in the fucking car with that nigga!\"\nTime is wasting, time is wasting, time is wasting\n\n"}, {"title": "Jus Know", "year": "2014", "album": "COLOURS ", "writers": ["partynextdoor", "travis scott"], "artist": "partynextdoor", "lyrics": "I remember everything, know that I'm watching\nI remember everything, just know\nI see you then look away, just know\n'Cause I remember what you took away, just know (ah, ah)\nNot everybody is your friend, baby, no, no, no, no, no, no\nNot every nigga is my nigga, baby, yeah, no, no, no, no, no\nHey, you used to kiss me then smile (I remember every, oh)\nShit that I missed for a while (oh, oh)\nI remember everything (ooh)\nI remember everything\nI remember everything (I remember every...)\nOh, oh, oh, ooh\nI remember everything\nI remember everything, yeah (I remember every...)\nOh, oh (I remember everything)\nI remember everything, know that I'm watching\nI remember everything, just know\nI see you then look away, just know\n'Cause I remember what you took away, just know (just know)\nMama still checks the letters\nThat I used to write you when we broke up\nWhen I said shit like...\n\"When we grow up, I'ma buy you shit when we blow up\"\nHey, we were the original Kanye and Kim\nYou know, Kanye and Kim\nNow it's Drizzy and Rih, it was so obvious then, oh, yeah\nYou know I remember, I remember everything (I remember)\nEven details about the wedding ring (I remember)\nI got questions about everything (I remember)\nBroke your heart, girl, you deserve these things (I remember)\nAre you still mad that I made you pay for everything, everything?\nGirl, I got it now, girl, I got it now\nGirl, I got you now\nI remember everything\nI remember everything\nI remember everything (I remember every...)\nOh, oh, oh, ooh\nI remember everything\nI remember everything, yeah (I remember every...)\nOh, oh (I remember everything)\nI remember everything\nI remember everything, yeah (I remember every...)\nOh, oh (I remember everything)\nI remember everything, know that I'm watching\nI remember everything, just know (ah)\nI see you then look away, just know\n'Cause I remember what you took away\n"}, {"title": "Don’t Worry", "year": "2014", "album": "COLOURS ", "writers": ["partynextdoor"], "artist": "partynextdoor", "lyrics": ""}]