[{"title": "INtro", "year": "2014", "album": "Hey! Thanks A Lot 2 ", "writers": ["thecoolismac", "quentin miller"], "artist": "quentin miller", "lyrics": ""}, {"title": "Cinematic", "year": "2014", "album": "Hey! Thanks A Lot 2 ", "writers": ["quentin miller"], "artist": "quentin miller", "lyrics": "Cinematic how a nigga living\nMoon roof in the ceiling just to hurt their feelings\nTrying to run my money up like a was a sprinter\nI ain't never had enough it's only the beginning\nCinematic how a nigga living\nMoon roof in the ceiling just to hurt their feelings\nYa, like a was a sprinter\nThis only the beginning\nI used to dream about being famous I'd rather be rich\nRather when I leave the planet my daughter having some shit\nRather be in control like Janet her dad and some shit\nRather leave a mark in the game before the casket get dipped\nDead for them old ways, these ain't the old days\nYou can't control me\nI'm the latest version Quentin, I'm not the old me\nSee I remain me, you sold your soul and it got you nowhere\nOh ya that's right I'mma go there\nBack to that real you ain't heard in so long\nLet my new one get her Marilyn Monroe on, Covergirl glow on\nBaby show them who you are\nMe and you go together so high, so high, so high\nHTAL2 told you it was coming\nMerry Christmas\nCinematic how a nigga living\nMoon roof in the ceiling just to hurt their feelings\nTrying to run my money up like a was a sprinter\nI ain't never had enough it's only the beginning\nCinematic how a nigga living\nMoon roof in the ceiling just to hurt their feelings\nYa, like a was a sprinter\nThis only the beginning\nAll up in your city like I always been there\nNew  pretty looking gorgeous in it\nI tried to work a nine to five it just wasn't getting it\nI started working when I quit that bitch\nNow pal I can get that tip\nMaybe someone who what that is\nY'all selling for the weak shit selling for the hits right back in\nI'm offin' y'all acting\nIf we inside your function we brought Jack in\nHalf a million glo 1317 glo ya\nMoon roof in the ceiling just to hurt their feelings\nTrying to run my money up like a was a sprinter\nThis only the beginning\nI intentionally didn't use auto tune on this shit\nThis shit would wave if I did though, we'll just let y'all do the watching\nHey Thanks A Lot 2\nYea, Yea, next level you fucks\n\n"}, {"title": "Thanks.. From Toronto..", "year": "2014", "album": "Hey! Thanks A Lot 2 ", "writers": ["quentin miller"], "artist": "quentin miller", "lyrics": "Yeah, UTDinfiniti, Nike checks and fini's\nWe hit department store and start a frenzy\nMy team came in with me, 1317 infinity\nThat means that shit is never ending\nUTDinfiniti, Nike checks and fini's\nWe hit up Edgewood and start a frenzy, yeah\nOoh they tried to play me like Mario\nI should've dropped that HTA a long time ago\nI been grinding while you rap 'bout grinding\nCuz I move behind the scenes don't mean i'm behind you\nI been gone from the city tryna chase a million\nI might just hit your girl mentions if you need a reminder\nBackseat bumping WDNG in Toronto\nNew sneaks, I had to cop cuz I know you ain't got those\nQuentin Miller been hot since action figures and snot nose\nActions speaks, not words, catastrophe from my verbs, man\nPlease believe it gets worse my friend\nWhen she with me she gon come out that purse my friend\nPlease believe it gets worse my friend\nYou can get served my friend\nBut you know i'm gon charge for the verse my friend\nMoon roof, no, my car's not a vert my friend\nGot your bitch singing like Gerald Levert my friend\nYou falling down like Donnie McClurkin, damn\nRiding through somebody town and i'm lurking, damn\nText from somebody girl and I curved her, damn\nJack Daniela is Jamie Lee Curtis, damn\nYou don't really wanna pull back the curtains\nI'm up working with work on a Wednesday\nYoung Quentin Miller, no fuck 'bout what them say\nWho is \"them\"? Them the haters\nWho is \"them\"? Them them fake niggas\nLupe Fiasco, I skate on niggas\n'97, I ain't even got the plate on it yet\nHTA, I made em wait on it, yup!\n\n"}, {"title": "KellySlate (PennState)", "year": "2014", "album": "Hey! Thanks A Lot 2 ", "writers": ["cj francis iv", "quentin miller"], "artist": "quentin miller", "lyrics": "Yeah, real-really hot tea\nAnd cough drops\nAnd brown liquor of course\nYeah, 1-3-1-7\nIt's Nike on me right now, it's always Nike on me\nIt's a lifestyle, UTD\nI be 'round probably late, probably\nYou so wet, must be on ovulate, probably\nQuentin Mill, Mr. Big like he Ron Isley\n'97 like I wasn't born in '89, i'm young and flexing, yeah\nYou chasing women while i'm getting richer, yeah\nNext year my daughter gon fuck up a Walmart, yeah\nSanta gon have his work in for Christmas\nCome get on this wave\nYou gon ride this wave and do what I say\nCome and ride this wave\nCome to my crib, you gon KellySlate\nDerrick Rose to the hole, i'ma penetrate\nMy white bitch, she goes to Penn State\nDrive my '97 like a Benz from today's date, yeah\nYou gon ride this wave, you gon KellySlate\nYou gon ride this wave, you gon KellySlate\nKnow you bad as fuck so you always late\nJust like my white bitch\nMy white bitch, she goes to Penn State\n\nGo... goooo\n\n"}]