[{"title": "Na fr.", "year": "2020", "album": "na fr. ", "writers": ["big rube", "quentin miller"], "artist": "quentin miller", "lyrics": ""}, {"title": "Senseless.", "year": "2020", "album": "na fr. ", "writers": ["quentin miller"], "artist": "quentin miller", "lyrics": "Yo\nAyy\n30-20\nYeah\nShit don't even make sense\nAll I had to do was have patience\nI sit back and listen, I'm like, \"Wow\"\nThey more like my kids than my own child\nI do what it takes to make it pile\nThe way I'm moving flagrant, that's a foul\nBeen this lit since Webbie, \"Wipe Me Down\"\nYou niggas just starting to catch it now\nAyy, y'all been known the truth for a while\nIt's whatever now (Okay), Stüssy sweater now\nIt's 1-3-1-7- now (Okay)\nI'm Q.M., don't ever disrespect the lettuce, child\nLit, yuh\nIt's an event when we enter your function\nMoney and success on my line, it's a conference\nI don't need no fake people in my circumference\nTwo-face niggas make me sick to my stomach\nRidin' through the city like a motherfucking president\nStarted serving bars, I ain't worked a job ever since\nAlmost missed my flight, had to hit it one more time, though\nTrap in good condition, junkies blowing up my line (Okay)\nI can't get too comfortable, they'll stab you from behind, ayy\nThey hate more than what you got, they hate what's on your mind\nI cannot explain it, I just do not have the time\nFunny how we say it's up when it be going down\nShit don't even make sense\nAll I had to do was have patience\nI sit back and listen, I'm like, \"Wow\"\nThey more like my kids than my own child\nI do what it takes to make it pile\nThe way I'm moving flagrant, that's a foul\nBeen this lit since Webbie, \"Wipe Me Down\"\nYou niggas just starting to catch it now\n\n"}, {"title": "Stuck Up.", "year": "2020", "album": "na fr. ", "writers": ["quentin miller"], "artist": "quentin miller", "lyrics": "Yeah, ayy, okay\nYou think you’re prepared? You’re not prepared\nThem dudes over there do not compare\nStuck to the code that got me here\nIt's up, it's stuck, it's locked up there\nI just had got back to the city, I'm good\nShe tryna link up and I think that we should\nDon't nobody else do this shit how I do it\nThere's money to make and I'm tryna get to it\nA legend already, I don't gotta prove it\nI want the new Bentley, I don't want the Buick\nI jump on the beat and get very abusive\nBall on these niggas like Gary, no Busey\nMost of these rappers is not who they say they is\nI just do not know why y'all even play they shit\nSoon as y'all get information you say the shit\nAll of my secrets? I go to the grave with it\nMake your own bed then after you lay in it\nMoney it come and go, people that came and went\nYou gave the game away, didn't even pay for it\nThat be the lamest shit, ain't that the lamest shit?\nI could care less 'bout no clout or no fame and shit\nI'ma get money and keep entertaining shit\nBitches you fuckin’, the niggas you hangin' with\nThem be the best indicators of who you is\nI am not new to this, truly I'm true to this\nI spray at anyone, I don't care who you is\nSwear I'm the realest that's currently doing this\nWho else you know that influence influencers?\nYeah, ayy, okay\nYou think you’re prepared? You’re not prepared\nThem dudes over there do not compare\nI stuck to the code that got me here\nIt's up, it's stuck, it's locked up there\nSo many things that dropped this year\nI'm finna fuck up the block this year\nIt really ain't much I got to fear\nThey had me before but not this year\nI'm on a whole different vibe\nThere's no way of blowing my high so don't even try\nMost of these niggas be lying\nDon't even be going outside, so really it's quiet\nYeah, I said it, I meant it and I'm sticking by it\nYou said there's money to get at\nI'm asking you why do you preach to the choir?\nHit the hotel and checked into the president suite\nNow I need a Melania\nMy flow on water like Anya\nFrozen like Anna, niggas ain't hot enough\nSheesh, might even put on a fleece\nI don’t clock in to a job, I just be managing beats\nAll I can do is go hard, I don't know how to go weak\nYoung nigga paid the cost to turn to a boss\nI got the receipts\nYeah, ayy, okay\nYou think you’re prepared? You’re not prepared\nThem dudes over there do not compare\nStuck to the code that got me here\nIt's up, it's stuck, it's locked up there\nI just had got back to the city, I'm good\nShe tryna link up and I think that we should\nDon't nobody else do this shit how I do it\nThere's money to make and I'm tryna get to it\nA legend already, I don't gotta prove it\nI want the new Bentley, I don't want the Buick\nI jump on the beat and get very abusive\nBall on these niggas like Gary, no Busey\n\n"}, {"title": "Pop-up.", "year": "2020", "album": "na fr. ", "writers": ["lil maddi", "cj francis iv", "quentin miller"], "artist": "quentin miller", "lyrics": "Ayy, watch how you react now, we back now\nI'm still spendin’ cash from my last style\nWhat they finna do 'bout my new style?\n'Times I got into it with my close pals\nThings I didn’t know that I know now\nGotta keep it movin', I can't slow it down\nI'm on my defense, on my Colin Powell\nI gotta keep goin' and I know it now\nI got circumstances tryna hold me down\nKnown around the world, I ain't local now\nI sat back and felt like I was missin' out\nTryna step it up, make sure this one counts\nTryna make sure they do not forget about\nThis legendary shit that I be givin' out, haha\nYuh, they did not expect me to live long\nThey thought they was real, they was so wrong\nIf y'all about a code, then the code’s wrong\nOut here tryna be what you not though\nWe know what it is and you not, bro\nGrammy's couldn't tell me that I'm hot, bro\nHaha, wait\n"}, {"title": "Love Costs.", "year": "2020", "album": "na fr. ", "writers": ["quentin miller"], "artist": "quentin miller", "lyrics": "Yuh\nYou gon' ride for me? You gotta show me\nSaid you down for me, you gotta show me\nIf I was down, would you leave me lonely?\nWhat your love cost, 'cause it ain't free\nYou got your own, girl you doin' okay\nShe like Louis Vuitton, she like Dolce\nI can't fuck around, no I won't play\nI need all your love now, I won't wait\nNo, no\nI'm tryna tell you how I feel about you, I cannot express it\nLet you know it's real without comin' off aggressive\nDon't be tryna tell me 'bout your ex now, that's extra\nNow you feel impressed, now it's pressure (Whoa)\nI am not impressed, you a mess, girl (Whoa)\nShit wasn't like this when we met, girl\nSay that you gon' ride, show me that (Yuh)\nThey cannot hold me back\nMoved away from broke and I'm not goin' back\nLook out for my bros, you know I'm doin' that\nYoung Q.M. the G.O.A.T. and BMarch, it's a wrap\nYou gon' ride for me? You gotta show me (Show me)\nSaid you down for me, you gotta show me (Show me)\nIf I was down, would you leave me lonely?\nWhat your love cost, 'cause it ain't free (Ain't free)\nYou got your own, girl you doin' okay (Okay!)\nShe like Louis Vuitton, she like Dolce\nI can't fuck around, no I won't play\nI need all your love now, I won't wait\nNo, no\nShe like fancy dinners, she want trips to Venice (Whoa, yuh)\nShe like useless spendin', she want true commitment (Whoa)\nMan, ain't no opposition, ain't no competition (Whoa)\nMan, how long we been winnin', man, its been a minute (Whoa)\nHow you just gon' act like you ain’t know\nYou sing like a Yin-yang twin, your numbers gettin' low\nShe gon' treat me right or leave me standin' in the cold\nIf you really down, then say you down, let me know\nYou gon' ride for me? You gotta show me (Show me)\nSaid you down for me, you gotta show me (Gotta show me)\nIf I was down, would you leave me lonely? (Lonely)\nWhat your love cost, 'cause it ain't free (It ain't free)\nYou got your own, girl you doin' okay (Okay!)\nShe like Louis Vuitton, she like Dolce (Dolce)\nI can't fuck around, no I won't play (Won't play)\nI need all your love now, I won't wait\nNo, no\nYessir\n\n"}, {"title": "Spectacular.", "year": "2020", "album": "na fr. ", "writers": ["damar jackson", "quentin miller"], "artist": "quentin miller", "lyrics": "Yessir\nJansport J, Q.M\nFull effect, hahaha\nOkay\nSome say the \"X\" makes the sex spectacular\nGet me all I can get, no holdin' back your love\nHit it from the back, make you tap, next up\nI flip you on your back like spatula\nNibble on your neck like Dracula\nHit me with that neck, I'm like \"that's what's up\"'\nYou need a nigga in your life that knows exactly what—\nYou should do and what you want, you could ask me for\nBaby, please don't pass me up\nThat nigga made your heart bleed, I'll patch you up\nTake control, be the chief like Kansas, huh\nOne word to describe me, \"gargantuan\"\nThe places that I be, they can't get in\nYou should lay up with him, I'm sayin'\nHahaha, I'm sayin\nI notice the way it's goin', I'm better for it\nYou tell me you on the way, then you better floor it\nKeep some flowers on me, I just left the florist\nThe shit I'm doin', haters can't ignore it (Sheesh)\nMeet me under the sheets, we can—\nMake beats then order somethin' to eat, I mean—\nBy the time it's here, you'll probably be sleep\nFuckin' with me, I'm sayin'\nI'm too old to be frontin' what I'm feelin'\nDenzelin', actin' like you ain't appealin' when you are\nAnd that the way you feeling is not far—\nFrom the way I'm lookin' at it in my thoughts\nThen let's kick this shit off, yeah\nIt's really on you, I'm with whatever works\nNew year, new you, I'm tryna be your first\nCouple rounds in, you can rest assured\nThe truth ain't the only thing that hurts, I'm sayin'\n"}, {"title": "Contingency Plan.", "year": "2020", "album": "na fr. ", "writers": ["quentin miller"], "artist": "quentin miller", "lyrics": "Yeah, yeah\nYeah, yeah, yeah, yeah, yeah\nFor real\nWhat I learned this time\nI cannot just stand by\nGotta keep your guard up at all times\nCase it does not go right\nWhat I learned this time\nAll you really can do is try\nGotta keep your guard up, all times\nCase it does not go right, yeah\nCase it does not go right\nCase it does not go right\nCan't, I just can't\nGet a break from the fake\nGotta go make a run\nMake a break 'fore they break\nMe, I know I got angels\nAnd demons around me, they watch\nIt's a angle when people come 'round me, they plot\nYou don't know what I been through, I been through a lot\nMan, I know I gotta vent this eventually\nStop with the cap and pretendin' and friendly shit\nStop with the actin' and Denzelin', seein' through like X-Ray\nMy DM and requests gettin' hectic\nI text \"better meet me where we met\", then we met\nThen I left thinkin' I will never see this girl again\nAin't no point in goin' for it 'cause I know how it's gon' end\nNow I know\nWhat I learned this time\nI cannot just stand by\nGotta keep your guard up at all times\nCase it does not go right\nWhat I learned this time\nAll you really can do is try\nGotta keep your guard up, all times\nCase it does not go right, yeah\nCase it does not go right\nCase it does not go right\n\n"}, {"title": "Still Standin’ (Extended Version)", "year": "2020", "album": "na fr. ", "writers": ["thecoolismac", "sy ari da kid", "quentin miller"], "artist": "quentin miller", "lyrics": "Yeah (Cole, you stupid)\nForreal? No, forreal?\nC'mon, forreal? Ayy\nHm-hm, no cap, 2020\nNew everything, yeah\nDown so long, I forgot that up exist\nI ask God, \"Why do I even exist?\"\nMad at God when I should've blamed myself\n20's gone, time to focus on the next\n30 years and I don't know what to expect\nTook that long for me to see that I was blessed\n2015, y'all just don't know how I felt\nWhat that shit could do to someone's mental health\n2019, Xanax almost took me out\nCould've never got to see my daughter smile\nUsed to hold my childish ways, I put 'em down\nNo more self inflictin', let's just stick around\nI got songs that I had put out in my name\nTurn them records on a day I feel ashamed\nThis goes out to all the ones that's tryna change\nDon't let anybody tell you that you can't\nYeah, not the same, changed man, stay on your grind\nNew commandments, givin' up? Ayy, that's a sin\nTimes was hard, I been through it all\nI did not understand though, look at God\nWe got through it all, still here, still standin'\n"}]