[{"title": "05.1317 Freestyle", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Ayy, ayy, ayy, 1-3-1-7\n05.1-3-1-7\nAyy, trappin' outta Vegas\nServin' all my patients\nCookin' while she naked\nI can't take it, I can't take it\nY'all out here committin' flagrance\nMe? I'm committed to the game, man\nComin' live, comin' live from the A, man\nAin't you tired? Ain't you tired from the hatin' nigga?\nGo to sleep, stay asleep, I'ma stay as me as possible\nThat's what I'ma do\nThey hear my name they whole mood North Carolina blue\nShit is light though, we'll be aight though\nKill shit, broad daylight, walkin' light, walkin', ayy\nBig cloud, I don't even have to try\nMixed feelings 'bout my chick from last night, yeah\nI'm a king and that's what I act like\nCould've been a king in my past life, yeah\nLost a leg but that could've been a life\nPulled a couple strings, spent a high price, yeah\nBare things goin' on, on my side\nLotta things goin' on, on my side\nAyy, trappin' outta Vegas\nServin' all my patients\nCookin' while she naked\nI can't take it, I can't take it\nY'all out here committin' flagrance\nMe? I'm committed to the game, man\nComin' live, comin' live from outer space and\nAin't you tired? Ain't you sick and tired of hating man?\nGo to sleep, stay asleep, I'ma stay as me as possible\nThat's what I'ma do\nThey hear my name they whole mood North Carolina blue\nShit is light though, we'll be aight though\nKill shit, broad daylight, walkin' light, walkin', ayy\n05.1317\nYeah, I was never good at politics, that's why I quit\nI'm focused on what's positive in places that I'm tryna get\nMissed a couple steps but hey I'm human, peep my bio\nI make timeless records when I'm tired, I'm hearin' two a day\nOne leg, shit I might as well be in shape\nFruits in the fridge, fruits for the kids\nI done growed up, let me tell the truth how I live\nNike jackets with the smiley face\nFake love, come and get the Pat Riley face, my mistake\nGet your order placed, trap open late\nBackdoor the gang, fuck it, it's closer to backstage anyway\nBut anyway, let me finish\nCut the check like guillotine, I got spender needs, yeah\nFound out what I was, stop saying what I'm finna be\nThe legacy continues\n"}, {"title": "1st Impression... (Came In)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah\nD-town, A-town\nD-town, A-town, yeah\nI came in like this, I came in\nI came in like this, I came in\nI kept things 1k when I came in\nI came in like this, I came in\nYeah, word on road you was king and you lost it\nHad the number one spot then you dropped from it\nI can tell that you despise the way I'm comin'\nI looked death right in his eyes, he ain't stop nothin'\nYeah, even if he did, I would still live\nAll this music that you hearin', ain't no time limit\nAll this truth up in my lyrics, ain't no lyin' in it (Yeah, wait)\nI came in like this, I came in\nI came in like this, I came in\nI kept things 1k when I came in\nI came in like this, I came in\nI came in like this, I came in\nI came in like this, I came in\nI kept shit 1k when I came in\nI came in like this, I came in (Yeah)\n\n"}, {"title": "Acquisitions", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Just tryin' get it, just tryin' get it\nNigga what up tho? Chicago, ATL\nYou already know\nRidin' round tryin' get it, I'm just tryin' get it\nIf ya ain't tryin' get it, I ain't fuckin' witcha\nI gotta keep it trill, that's just how I'm livin'\nIf you ain't fuck wit me then I'ont feel no different\nI'm ridin' in the latest feelin' like the greatest\nI'm ridin' in my city feelin' like the mayor\nI'm ridin' on you niggas if I catch you hatin'\nI'm ridin' on you niggas if you try to play me\nQuentin Miller, switchin' flow up make it different\nLabels turn their back on me it didn't make a difference\nI'm bout peace but nigga I be tryin' make a killin'\nNo one gave a shit for me so fuck these haters feelings\nDamn, its a cruel world\nBands a get me that new benz and a new girl\nShit let get it then, damn how you do it to em'\nThey ain't think I stood a chance I had to prove it to em'\nOkay lets get it then\nBig bank over owl tank, lil bank sip drank\nTill I fall then we sip again\nQuentin Miller, I'ma ball just like Reggie did\nQuentin Miller, bitch I'm everything you never been\nRidin' round tryin' get it, I'm just tryin' get it\nIf ya ain't tryin' get it, I ain't fuckin' witcha\nI gotta keep it trill, that's just how I'm livin'\nIf you ain't fuck wit me then I'ont feel no different\nI'm ridin' in the latest feelin' like the greatest\nI'm ridin' in my city feelin' like the mayor\nI'm ridin' on you niggas if I catch you hatin'\nI'm ridin' on you niggas if you try to play me\n\n"}, {"title": "All Around Feeling", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "I'm making short term goals when the weather froze\nTo put away the leather and put ices on the gold\nUh, cause I been in the peace state\nStill rocking Pineapple but I'm from the peach state\nPete sake, for that reason I'm giving 'em hell\nI'm in my prime, I'm living it well\nNot at all, the more that these niggas stall I get better\nThese threats of leaving me stranded, my reply is \"whatever\"\nThat's y'all loss, I'm out of town with the doors off\nJeepers, I'm eating good like a mob boss\nChicken fingers for my dinner, turn from dreamer to a winner\nI can teach 'em that's a splinter, uh\nMoney is the motivation, I gotta make it\nThat's an over-statement\nTo over-stand me from my niggas and my family\nI told myself I would make it from the bottom to the Grammy's\nI hope I get to make it 'fore the program gets fucked up completely\nDamn, and I hope that last statement doesn't fuck me up before you get to see me\nHere I go\nI feel it all, I'm 'bout to say\nYour love just comes up all day\nI feel as though I'm up against this struggle and\nIt's brighter then the things you did and when your back\nUh, and I seen it all, before it came\nI knew it before the fame\nI would reach it and knew that I would never be the same\nIt would be, the best and the worst time, bittersweet\n'til you be asking the Lord to deliver me\nAw, Marty every time I call\nYou be thinking \"ha, do you have fun at all?\"\nWe mixing these records, I changed a little though\nReminiscing over Andy Warhol means B-I-G-P-O-P-P-A\nWhen opportunity calls, usually it's not three-way\nI asked God to help me out with this, just look what he did in three days\nSo tell me, do you go with what you know all your life\nOr throw it all away for who you feeling for?\nCause basically, the choices that you making will eventually hurt you down the road\nHere I go\nI feel it all, I'm 'bout to say\nYour love just comes up all day\nI feel as though I'm up against this struggle and\nIt's brighter then the things you did and when your back\n\n"}, {"title": "Aug28...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah\nYoung nigga options now, you know\nIt's a little different\nMy DM poppin'\nYeah\nYeah\nShe wanna know\nOh, she wanna know, she wanna know\nUh, she wanna know, she wanna know\nI'm a let her know\nBaby I'll hit you and let you go\nI ain't tripping, I'm a professional\nWhen it comes to pimping I'm professional\nWhen it comes to Nike I'm professional\nI'm a let you know\nHaha. I'm a let you know, I'm a let you know\nYou got one chance to flex on me baby and you ain't gonna receive a text no more\nI'm a let you know\nShit ain't the same as last year, I'm a let you know\nShit ain't the same as last year, I ain't stressing though, I ain't stressing though, I ain't stressing though\nI ain't stressing though, I'm a let you know, I'm a let you know\nYeah, yeah. Yeah, yeah, yeah\nI'm a let you know, yeah, yeah\nI been flexing on em, yeah, yeah\nI done flew a jet before, yeah, yeah\nThat's real life, that's real life, yeah\nAnd I'm a let you know\nI ain't got no problems letting you go\nI'll let you know, I'm a let you know if she wanna know\n\"What time can I pull up?\" Baby I'll let you know\nI might switch up on you, I'll let you know\nHmm, I'll let you know\n\"Hey Quentin Miller, how much for a feature? How much for a show?\" I'll let you know\nIt might be high but it's never low\nHahaha, it might be reasonable but it's never low\nI'll let you know\nI'll let you know, I'll let you know\nI'll let you know, yeah yeah yeah\nReally just playing like\nFriday, August 28th. 1:01 PM\nYou all on my line now, you all on my line now\nYou value my time now, you value my rhymes now, ooh\nYou value my words now, yeah\nYou know what I'm worth now, yeah\nIf you was i my position when that shit popped off, you all would of freaked out, you all would of freaked out, okay\nYou value my time now, you value my words now\nYou all know my worth now, you all know my worth now\nYou all see that '97, you like how I swerve now\nParallel parking for free on the curb now\nYou see me on Edgewood, you say wussup now\nHaha, ight bruh\nHahaha, I'm just having fun bruh, like it's Friday\nNick Miles, Quentin Miller. Thirteen-Seventeen\nHTA3, Winter\nHahahaha, y'all niggas take shit too seriously\nIght\n\n"}, {"title": "Awareness freestyle", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Wiz did it first let me spit a verse\nBig Q.M on my shirt\nSwoosh on it to make it wose\nCan't even sell the merch\nY'all ain't 'bout the life, y'all just want the perks\nY'all just want the light, but you don't want the work\nI watch Drake break down every verse\nBack when I was throwing words together he showed me\nI had the talent just lacked the effort\nShit made me step up, it made me better\nI could never erase what happened\nNo looking backwards, I'm chasing my passion\nI was with Don can hit when I first had Chris\nDream let me put that Hublot on my wrist\nSmall things that I'll never forget\nI seen too much success to settle for less\nMan, man, man\nI seen big bodies, green pastures, big mansions\nAll manifested from rap-pop, what have you\nI'm in it now, no turning backwards\nNo way of happening, we made it happen\nLeg with the battery in Manhattan, I'm back!\nI'm back\n\n"}, {"title": "Bad Intention", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah\nGot into the crib, I'm having plenty bad intentions\nThen she started stripping, then she got my full attention\nYoung money making, better be on my discretion\nAnd Reno made the beat in case I didn't mention...\nCome up with right amount of change, I can visit\nYou can never say that we the same, boy I'm different (yeah)\nNike track & field pants and I'm limpin', but I'm livin', yeah\nWhoa!\nYou can say you beat the odds when you did! (yeah, whoa!)\nYou gon' make me pull your card like I'm dealin' (yeah, yeah)\nYou gon' make me rent the car without the ceilin' (yeah)\nBaby, don't fuck me, don't got no heart, got no feelin's\nYeah, alright\nYou can say you beat the odds when you did! (whoa!)\nYou gon' make me pull your card like I'm dealing\nYou gon' make me rent the car without the ceilin'\nBaby, don't fuck me, don't got no heart, got no feelin's\nYeah, alright\n\n"}, {"title": "Bop fs v1.03", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yezzir, get the YouTube back crackin' you feel me?\n2020, for the fans\nOkay, aight\nI need some shit with some bop\nI need my money off top\nYoung nigga been through a lot\nTold you my hand on the button, whats funny?\nYou thought I was playin’? I'm not\nI had just got back through custom\nMy passport look tatted up just like The Rock\nOkay, I feel like Thugga and Gunna, I'm hot\nOf course I don’t communicate with these haters\nThese hoes that spread rumors & cops\nShe only fuckin' with me 'cause I got the key just like I'm Glock\nFind out you niggas ain't come with the money, you done, fuck out the spot...\nYeah, straight out the mud, now I'm the plug\nWhippin' the road to the success and it seem like the only direction is up\nThey say I need to do more, they tellin' me Quentin ain’t doing enough\nI think I’ll never be doing enough for people that's doing too much\nOkay, who can you trust?\nGame on the line, I’m the one always come through with the clutch\nStussy keep sending me package, really ain't gotta go shopping for months\nDifference between me and these rappers is they do what's cool and I do what I want (Do what I want)\nHm-hm, and I invented the wave\nGood with the pitch like a Brave, I'm from the A, what can I say?\nAnd I’ma live by the code, I got some secrets I'll take to the grave\nStack up until it gets old then put it away, more money to make\nI need some shit with some bop\nI need my money off top\nYoung nigga been through a lot\nTold you my hand on the button, whats funny?\nYou thought I was playin'? I'm not\nI had just got back through custom\nMy passport look tatted up just like The Rock\nThat shit hard to say forreal\n\"I had just got back through custom\nMy passport look tatted up just like The Rock\"\nYeah, haha, but nah, feel free though, feel free\nLike, like, look up the lyrics\nLike listen to the song, go through each line you know\nLike tell me which one of these lines is, is like some bullshit like\nLike y'all been playing for a long time\nI been letting y'all like, you know, sleeping\nYou know, play for a long time\nAnd we, we been acting like we don't know what the fuck this shit is\nBut we know what this shit is, you know what this shit is, bro\nStop fuckin' playing with me man, c'mon, hahaha\n\n"}, {"title": "C3 (wit Me)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Things change right\nYeah\nAlways and forever\nEven though we were never\nAnd at this point, probably never will\n\n"}, {"title": "Caesar salad....", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "I can't say that I'm any better than any ain't-shit nigga that ever met ya\nI compromised my morals, lost site of what was important, it takes effort to focus\nI take steps in the right direction everyday... I think\nOpposition, competition non-existent\n'Less I'm staring in the puddle of the mirror, hold up, hm-hm\nI was not picked on accident, I was signed, dropped\nWorked warehouse jobs and niggas still couldn't hold me back\nNow look, BOA wanna hold my racks\nNow look, Wells Fargo wanna hold my cash\nOverdraft, full tank on gas, hm-hm\nQ dot M three x dot, fuck the city up then hit the next spot\nStarted your album then I checked out right around track two\nI just wasn't that moved, they used to tell me that I wasn't that cool\nMy tune [?] the jokes on you sir, recording artist slash producer\nNever falling off so you might as well get used to it\nThey sneak diss but I'm used to it\nI mean... I would trip if I was new to it\nI was missing from a few looks, it's whatever though\nWhat goes around comes around like the letter \"O\"\nI come through like the line in the letter \"Q\"\nThey hate me like kids hate vegetables, I hate veggies too\nNiggas switch they whole tune like the weather do\nQ.M to you, unforgettable\nGive in, that's just something that I'll never do\nHere's a list of MC's that's comparable:\nCarter, Marshall, Graham, West\nLamar, Miller, etcetera, etcetera\nCash calling, call accepted\nHold up... let me get this\n(hello.. yeah.. yeah.. I was just doing this freestyle...)\n-Lady speaking-\nThanks Pegasus\n\n"}, {"title": "Can’t Deal", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, [?] boys\n3077 Club\nI can't even deal, I can't even deal\nShuffling through this paper I can't even deal\nShuffling through these hoes I can't even deal\nAlmost lost my life behind the steering wheel\nWant a verse from me then hit the ATM\nLegendary like Turner in the ATL\nThey can't even deal\nWait, wait, you know this guy, wait\nWait, wait, you recognize his face\nWait, wait, more deposits, wait\nWait, wait, my wallet need a bank\n\n"}, {"title": "Can’t Trust... (Toast Up Freestyle)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Mm... mmm... mmm... ugh...\nFirst song I recorded in a long time you know..\nAight\nI got niggas I can't trust, I got hoes that I can't trust, yeah\nI got fears I gotta face, I'm gonna face 'em, wish me luck, yeah\nSpirits was low, money low so I had to run it up, yeah\nWhere it's gon' go? I don't know, I don't know, yeah\nYo, yeah my biggest temptation is temptation\nI ain't really patient, I'm impatient, I ain't been patient\nI been through some things I can't rap about\nI play through the pain like a athlete now\nLife comin' at me, don't @ me now\nYou ain't even gotta @ me, don't @ me\nAnd we know, we know the story\nNo pain, no guts, no glory, more glory for me then\nWait, I got niggas I can't trust, I got hoes I can't trust, yeah\nWait, I got fears I gotta face, I'm gonna face 'em, wish me luck, yeah\nSpirits was low, money low so I had to run it up, yeah\nWhere we gon' go? I don't know but I know we won't be stuck here\nYeah, you rappers live a perfect life, like a real mothafuckin' like perfect life\nDon't be going through shit, niggas don't be going through a goddamn thing..\nWhere I came from\nYou can't understand where I came from\nYou cannot withstand where I came from\nI had to befriend isolation\nI apologize if I wronged you\nI ain't mean to put this hurt on you\nYou can seek revenge if you want to\nDon't let that energy haunt you, no, no\nI got people I can't trust but I don't know they can trust me\nI got fears I gotta face, I'm gonna face 'em, wish me luck, yeah\nSpirits was low, money low so I had to run it up, yeah\nWhere we gon' go? I don't know man, I don't know yet\nMmm.. mm... ugh...\nYeah, yeah, 1-3-1-7\nShout out to Gunna, this a little freestyle\n\n"}, {"title": "CatchMeSlippin...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Young man going for the win, yes I am\nMeet and greet with Ben Frank I'm his biggest fan\nWe don't got the time girl, make your mind up\nFuck around and make me hit your friend, bitch get in(woah)\nGot me selling raps to keep my daughter flee\nGot it for the low, but aim for the cheap\nWhat we smoking on, anything but weed\nThey was right the revenge taste so sweet\nChris Sutton with me, hit the button\nFake friends got me out here trusting nothing\nAin't no way I'm leaving out of here with nothing\nAin't no playing fair I got to take it from em'\nAlmost lost my life, 2016\nNiggas switch teams, niggas did things\nOoo I can't let em' catch me slippin'\nNo I can't let em' catch me slippin', wait\nI got hatters now I'm doing something different\nThey bump my shit whatever area you live in\nThey don't wanna see me rental car with it\nThey don't wanna see me lay up but I'm living, wait\nBecause I always feel like running, not away because there's no such place\nBecause if there was I would've found it by now\nBecause it's easier to run\nEasier then staying and finding out, you're the only one who didn't run\n\n"}, {"title": "Cease and Desist", "year": 0, "album": "", "writers": ["quentin-miller"], "artist": "quentin-miller", "lyrics": "Started off the ACA series off of Miami beach y'all know that shit\nDropped from the label and still wasn't faded\nGave these niggas some of the hottest songs of the year and I'm still underrated\nAnd I couldn't care less\nI'm put in this position to make y'all's clearer\nIf money's not involved I'm not involved neither\nWhat you making off the door with my name on the bill\nFrom now on, oh no nigga\nDon't approach niggas until that parts cleared up\nNike store all geared up, ah shit bruh\nIsn't that yup you guessed it\nChecked up 'til they pay their respects and I rest in peace\nYes you are blessed if you met with me\nNiggas sleeping on me I'm like who them\nThink about 2015 without Q.M\n1317 ya that's the crew them\nWhat would hip-hop be if y'all ain't knew them\nHop right back in that car that I own\nTook my daughter back home, life altering calls on the phone\nI'm really moving ya I'm really moving\nThat Puerto Rican with me new habla Español very fleuent\nAnd when she fuck me she know what she doing, that's important\nI'm good at finding talent young Barry Gordon\nYou out of town with a young Paris Hilton\nHit the stores and bought another pair of Jordans just for the sport of it\nAre you not enter? Are you not entertained?\nAre you not entertained? Are you not entertained?\nAre you not entertained? Isn't this what you wanted are you?\nNo more Mr. Niceguy Quentin Miller\nNo more love from my side for you niggas\nMiddle fingers all you niggas get\nTry to run off with my swag I send a cease and desist\nYoung how he getting, so much potential I don't see the ceiling\nBefore he sent me God briefed me on my mission\nCould've easily went in on niggas that ain't what I'm here for\nI've been heating up the stove tryna water whip a Grammy\nMillion something plays million sold Miller platinum, wow\n\n"}, {"title": "Cinematic", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Cinematic how a nigga living\nMoon roof in the ceiling just to hurt their feelings\nTrying to run my money up like a was a sprinter\nI ain't never had enough it's only the beginning\nCinematic how a nigga living\nMoon roof in the ceiling just to hurt their feelings\nYa, like a was a sprinter\nThis only the beginning\nI used to dream about being famous I'd rather be rich\nRather when I leave the planet my daughter having some shit\nRather be in control like Janet her dad and some shit\nRather leave a mark in the game before the casket get dipped\nDead for them old ways, these ain't the old days\nYou can't control me\nI'm the latest version Quentin, I'm not the old me\nSee I remain me, you sold your soul and it got you nowhere\nOh ya that's right I'mma go there\nBack to that real you ain't heard in so long\nLet my new one get her Marilyn Monroe on, Covergirl glow on\nBaby show them who you are\nMe and you go together so high, so high, so high\nHTAL2 told you it was coming\nMerry Christmas\nCinematic how a nigga living\nMoon roof in the ceiling just to hurt their feelings\nTrying to run my money up like a was a sprinter\nI ain't never had enough it's only the beginning\nCinematic how a nigga living\nMoon roof in the ceiling just to hurt their feelings\nYa, like a was a sprinter\nThis only the beginning\nAll up in your city like I always been there\nNew  pretty looking gorgeous in it\nI tried to work a nine to five it just wasn't getting it\nI started working when I quit that bitch\nNow pal I can get that tip\nMaybe someone who what that is\nY'all selling for the weak shit selling for the hits right back in\nI'm offin' y'all acting\nIf we inside your function we brought Jack in\nHalf a million glo 1317 glo ya\nMoon roof in the ceiling just to hurt their feelings\nTrying to run my money up like a was a sprinter\nThis only the beginning\nI intentionally didn't use auto tune on this shit\nThis shit would wave if I did though, we'll just let y'all do the watching\nHey Thanks A Lot 2\nYea, Yea, next level you fucks\n\n"}, {"title": "Closing Statements...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah yeah\nI gotta watch, like, my words 'cause my kids is upstairs, you know\nAppreciate y'all listening\nYuh\nNothin's realer, nothin's off of the table\nThe cards face up, I can't even fake stuff now nowadays\nIt's tough to do away with my childish ways\nI'm a kid at heart, baby, that's just how I'm made\nI was told I'm not a star by a couple folks\nStill found a way to put myself in discussion\nNext up talks\nThe check come, I turn Yeezus with the Jesus Walks\nI wanna see my dawgs eatin', not just me\nAnd that eats away at me daily\nFinancial issues got my niggas losin' patience\nThere's pressure to make it\nIf I don't, what does that say about me\nDon't think I'll every do away without, just work around it\nI don't have a problem stayin' grounded\nI know what's real and what's facade\nIt's the ladder, I try to stay up out it\nIdentify what really matters, then I made adjustment\nStayed that nigga you truly fuck with, I'm movin' up with\nHad to get on my all-or-nothin' to make me somethin'\nMy demons confronted, can't tell if I won yet\nTo tell you the truth, I got what I wanted\nHaven't worked a job in years, I'm blessed, my boy\nI was put to the test, my boy\nAmputee makin' big-ass steps, my boy\nWhen I get to my death\nOnly thing they'll have to say is \"damn, he did it to death\"\nYoung QM on my Amazon Prime\nI deliver every mother fuckin' time, accept it\n"}, {"title": "Cold Day in Hell...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yo, ayy\nAyy\nIt'll be a cold day\nCold day in hell, it'll be cold day\nHot day in heaven, it'll be a hot day\nBig backwoods, we do not vape\nI been eatin' good, really need to drop weight\nBut my name is in tip-top shape\nYeah my name stay in tip-top shape\nYeah my name hold weight (wait)\nI don't take breaks, I just beat the brakes\nOff the motherfuckin' drum and bass\nOff that motherfuckin' drank man, wasted\nQ.M. and Nick, good as music gets\nYou will never see me with a different clique\nSnap like D4L hits\nGot a ex from M.C. Hammer hood, too legit\nTold me watch for these niggas on cat shit\nMe and Nick goin' bat shit\n*Screw* get me to the point, I don't act sip\nNo, we don't lack shit\nUTD, UTD all access\nSince I had the iPhone jailbroke\nI came with the wave like a sailboat (facts)\nGeppetto, came attached\nInsurance on the rental, bro relax\nIt'll be a cold day\nCold day in hell, it'll be cold day\nHot day in heaven, it'll be a hot day\nBig backwoods, we do not vape\nI been eatin' good, really need to drop weight\nBut my name is in tip-top shape\nYeah my name stay in tip-top shape\nYeah my name hold weight (wait)\n\n"}, {"title": "Complex", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah, yeah\nYeah, yeah, yeah , yeah\nOne word to describe me, that shit is complex\nI stepped into the game real muhfuckin complex\nReal life shit a young nigga gotta deal with\nI ain't feeding into no muhfuckin nonsense\nShaq size skeletons in my fucking closet\nReally gotta live with that shit up on my conscious\nOne word to describe me, that shit is complex\nMiddle finger to that hating nigga at the Complex\nYeah, oh you feel a way, I know you feel a way\nYeah, i'm just doing me, I know you still gon hate, yeah\nOh you still gon hate, I know you still gon hate, yeah\nI stay in my lane and y'all stay in my way, yeah\nI been everywhere and you been MIA, yeah\nI be lowkey, don't need cameras in my face, yeah\nI'm just trying to get some Grammy's in my mama place\nWhy I gotta do this shit, I can't explain\nShit is, shit is complex\nYeah, real muhfuckin complex\nI'm not the same, I done changed, i'm evolving\nJust give me time, it's a muhfuckin process\nYeah, i'm still trying to figure out, let me figure out\nBeen grinding for a minute now, trying to figure out\nMy daughter getting bigger now and I been missing out, yeah\nFeel like I been missing out, yeah\n"}, {"title": "Concussion...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Aye Bmarch , yo Bmarch\nYo Bmarch\nYo Bmarch\nFor real\nFor real, yuh\nYou ain't gotta hurt em like that for real\nYou ain’t gotta hurt em like that for real (oh, ooh)\nYou ain't gotta do em like that for real\nYou ain't gotta do em like that for real\nYou ain’t gotta hurt em like that for real\nYou ain't gotta hurt em like that for real\nYou ain't gotta do em like that for real\nYou ain't gotta hurt em like that for real\nYeah, aye\nI'ma go in for the kill (aye)\nWatch me go in for the kill (aye)\nDoo-doo-doo-doo, aye\nShoot through the roof (yeah, aye)\nI'm having juice\nI'm having all of the juice\nEnd of discussion was meant for concussion\nI'm telling the truth (hey, yuh)\nOff that bitch she cause me stress\nMelrose, parallel park my whip, hey\nFrom the six to the six\nS-s-s-s-s-s-s-s-s-s-s-s-s-s\nI got bread, cake and cheese, and I play with my food\nA legend in the game, boy that’s me and not you, yuh\nI might fuck up Lenox just to switch up my mood, yuh\nAll about my business, I turned into tycoon\nThey’re like\nYou ain't gotta do em like that for real\nYou ain’t gotta do em like that for real (oh, ooh)\nThese niggas really don't trap for real\nThese niggas really all cap for real\nYou ain't gotta hurt em like that for real\nYou ain't gotta hurt em like that for real\nYou ain’t gotta do em like that for real\nFor real, for real\nWhen I'm at the crib I pray at the foot of my bed\nI pray for some head and staying away from the feds\nCan't let em take me, I can't\nYou know what I said, you what the fuck I just said\nI'm playing with motherfucking bread, I'm playing with cake\nAnd if you can't relate, I can't relate (pssh, yuh)\nI'm switching the country, I'm switching the state (yuh)\nDon't want no more apartments, I want an estate (yuh)\nJust scratching the surface, or scraping the plate\n1317, we want all the smoke like a vape, nigga\nYou ain't gotta hurt em like that for real\nYou ain't gotta hurt em like that for real (oh, ooh)\nYou ain't gotta do em like that for real\nYou ain't gotta do em like that for real\nYou ain't gotta hurt em like that for real\nYou ain't gotta hurt em like that for real\nYou ain't gotta do em like that for real\nYou ain't gotta hurt em like that for real\nYeah, aye\nI'ma go in for the kill\nWatch me go in for the kill (aye)\nDoo-doo-doo-doo, aye\nShoot through the roof (yeah, aye)\nI'm having juice\nI'm having all of the juice\nEnd of discussion was meant for concussion\nI'm telling the truth\n\n"}, {"title": "Contingency Plan.", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah\nYeah, yeah, yeah, yeah, yeah\nFor real\nWhat I learned this time\nI cannot just stand by\nGotta keep your guard up at all times\nCase it does not go right\nWhat I learned this time\nAll you really can do is try\nGotta keep your guard up, all times\nCase it does not go right, yeah\nCase it does not go right\nCase it does not go right\nCan't, I just can't\nGet a break from the fake\nGotta go make a run\nMake a break 'fore they break\nMe, I know I got angels\nAnd demons around me, they watch\nIt's a angle when people come 'round me, they plot\nYou don't know what I been through, I been through a lot\nMan, I know I gotta vent this eventually\nStop with the cap and pretendin' and friendly shit\nStop with the actin' and Denzelin', seein' through like X-Ray\nMy DM and requests gettin' hectic\nI text \"better meet me where we met\", then we met\nThen I left thinkin' I will never see this girl again\nAin't no point in goin' for it 'cause I know how it's gon' end\nNow I know\nWhat I learned this time\nI cannot just stand by\nGotta keep your guard up at all times\nCase it does not go right\nWhat I learned this time\nAll you really can do is try\nGotta keep your guard up, all times\nCase it does not go right, yeah\nCase it does not go right\nCase it does not go right\n\n"}, {"title": "Criss Angel", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Ayy, ayy, ayy\nTake off the fake, show the real you\nI don't want the fake, show the real you\nTake off that fake, show the real you\nStop being so fake, show the real you\nI kept it one K when I came through\nMy name hold weight like the Range do\nMy life IMAX every angle, forreal\nJust like magic, Criss Angel, forreal\nI done made waves when I had nothin', forreal\nI done made plays when I had nothin', forreal\nKnow I get paid off of rap songs, forreal\nTake off the fake, show the real you\nI don't want the fake, show the real you\nTake off that fake, show the real you\nStop being so fake, show the real you\nI kept it one K when I came through\nMy name hold weight like the Range do\nMy life IMAX every angle, forreal\nJust like magic, Criss Angel, forreal\nDon't you-\nDon't you do that, don't you hold back\nDon't you do that, don't you play no games\nI'm knockin' on thirty, I'm too old for that\nI can't even front, I can't fuck with ya\nIf you don't know what you want\n'Cause I know what I want\nIf you know what we want\nLet's do whatever the fuck we want\nFuck you want, can't tell you exactly what I'm on\nBut just know I'm on\nHead game way too bomb\nMight just get her a room at the Intercon\nShow me love, show me love\nHead on site, that's wassup\nWhere you at? Hit me up\nLink me up, 1317, we up (nah, forreal)\nTake off the fake, show the real you\nI don't want the fake, show the real you\nTake off that fake, be the real you\nStop being so fake, be the real you (forreal)\nI kept it one K when I came through\nMy name hold weight like the Range do\nMy life IMAX every angle, forreal\nJust like magic, Criss Angel, forreal\n\n"}, {"title": "CYAN", "year": 0, "album": "", "writers": ["quentin-miller", "jeremih", "quentin miller"], "artist": "quentin-miller", "lyrics": "1317 (are you ready?)\nThat's the team, more like a machine (are you ready?), huh, huh\nThat's on everything, whoa\nThat's on everything, we want everything (you know)\nWe want everything, even them extra things\nFound myself away and took advantage of that\nNiggas tell their perspective end up bendin' the facts\nHol' up, hol' up, roll up, relax\nWe do, we do big drugs then quit then relapse (yeah)\nWord is he snapped (are you ready?), he do\nAin't it the truth, ain't in the truth, true (are you ready?)\nGoin' with any of you (are you ready)\nAny of you, any of you's (are you ready?)\nDown for shit so shotguns\nWe do it 'till the team's pockets full of Benjamins\nI call 'em B. B. Kings we would be some hot boys\nSince they say bling-bling, every hook at throw at 'em (are you ready?)"}, {"title": "D’Angelo", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "When you the one the world look at\nWhen you the one that never knew you was the one\nUntil the world put that\nTitle on you, I been on this, Micheal Jordan wave\nWay before the jumpman came\nThe MJ that got cut from the team\nLook at me now, I'm in the league and it's the funniest thing\nNiggas ain't want me to be seen, ah man\nI know how bad shit feels\nI took y'all joy, I know how sadness feels\nFrom inside out, I know how bad shits been\nMy daughter' momma car broke down\nTil' it's fixed I let her have my whip\nI'll Lyft, I'm more conditioned to take that hit\nSacrifice is part of life, you gotta take that shit\nFrom now on, I leave town the whole squad come with\n1317 til I take my last breath, I'm saying\nNever try to flex for a blog post\nI value my integrity a lot more\nWhen rap is no longer fun, that's when I stop goin'\nI'm not forward if I'm in it and I'm not growin'\nI gotta leave Maddy something 'fore I leave\nI gotta see my family getting what they want and need\nACA-3 that's what they wanna see\nI put my all in these beats, what else they want from me?\nD'angelo flow, yeah, how it feel? That D'angelo flow, yeah\nRap game, Michael Angelo, oh Lord\n\n"}, {"title": "Darkside", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Pull up and, do I what I does\nWoah, I do what I want (woah)\nNot giving a fuck\nShe let me fuck, she knew what it was\nMoney in fast (woah), liquor and drugs\nPlease don't tell my kids how I live man\nI been in some shit, this some shit man\nCar parked in the dark side\nFeel like I ain't seen the light in years man\nMe and C Major, we major like Kanye and Nas\nI got your message before and just didn't respond\nI sold that metal like auto parts, rock the watch like a Audemar\nI think I'm better than all of ya'll\nFall off in some sex, only way that I'm falling off\nI think I'm obsessed, cause I want all the hundreds\nI don't even want to stunt, but really I gotta stunt\nIt's really no option for me\nI need me a profit from it\nPull up and, do I what I does\nI do what I want (woah)\nNot giving a fuck\nShe let me fuck, she knew what it was\nMoney in fast (woah), liquor and drugs\nPlease don't tell my kids how I live man\nI been in some shit, this some shit man\nCar parked in the dark side\nFeel like I ain't seen the light in years man\nI can't hold it in, I ain't been outside, I'm going in man\nI've been feeling ways on how I live\nPlease don't tell my kids\nI got partners out in Houston, I can introduce you\nWe can sip on some exclusive, it'll slow your moving\nEverytime we do a show it turn into a movie\nMight as well write a script for it and send it to you\nPick an item in your size, we can send it to you\n1317 supply, we can send it to you\nI don't know when I'ma die, I'ma  live the fullest\nYeah, as long as I'm alive I'ma\nHold up\nI do what I want (woah)\nNot giving a fuck\nShe let me fuck, she knew what it was\nMoney in fast (woah), liquor and drugs\nPlease don't tell my kids how I live man\nI been in some shit, this some shit man\nCar parked in the dark side\nFeel like I ain't seen the light in years man\n\n"}, {"title": "Destiny (Freestyle)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller", "lyle leduff"], "artist": "quentin-miller", "lyrics": "It's like drop-top music\nIt's like I'mma have to rent me a drop-top\n'Cause you know, I don't own a drop-top\nSo I might have to rent one so I could feel this shit\nYa feel me? Haha\nAyy\nI see things clearer than ever, yeah\nPopsicle juice on my leather\nThat's what I get, just had to say yes\nHad to change my idea of success\nStay in my lane and don't trip on the next\nWhat's for me? It be what I'ma get\nHecklers want to bomb my set\nI am not upset, joke's on you, I still got a check\nEvery real rapper realizes I'm a threat\nHand over the button like Kim Jong\nBut I'm calm like Obama 'nem\nI have never seen a single battle karma didn't win\nI have never seen a popping rapper with a missing limb\nScratch rap, anything\nTechnically, I won already, I'm just sayin'\nIt took a minute for myself to understand\nMy destiny was already in my hands\nName drops, name drops, I hear name drops\nAssociates, old friends, got suggestions\nNicki popping off, she ain't never met me\nNiggas got opinions, don't even know me\nI don't even want the crown, I'm just doing me\nMike Will, Metro, they 'bout as old as me\nWanna be mentioned with them, not just some old beef\nIf You're Reading This was like 2015\nI lost a leg in '16\nLook, if you can't tell by now\nI ain't 'bout the hype\nI create waves, I'm not the wave-riding type\nBig mistakes, grave ones, I made throughout life\nTry to learn from 'em, do it better next time\nCollaborated with my favorite rapper a few times\nI don't want none of his credit, I'm just focused on mine\nI was making songs back when I had a job\nI do have a life, two kids and a dog\nI ain't tripping at all\nNot at all\nYeah\nYou know, I'm more than just a prop, you know?\nOr—or a pawn\nI'm a person too, you know? I ain't ask for none of this\nFuck this shit, man\nShout out to Gunna\nYou know\nNever met him before, that's a nigga that I fuck with, that I respect, you know?\nI—I'm tryna make music, you know what I'm sayin', and—and box with these niggas\nShout out to Gunna\nShout out to goddamn Super Duper Kyle\nShout out to goddamn, motherfuckin' slick J.I.D\nFat Man Key\nEverybody, everybody doin' they thing\nRico Nasty, everybody doin' they thing, man\nShoutout to all y'all, bro\nI—I'm inspired by y'all\nYou know, I'm out here doin' my thing too, bro, you know\nI know that y'all get caught up in that, but I'm\nIt's 1317 man\nForward\nHaha\nAight\n\n"}, {"title": "Differences", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "I could see the, i could see the difference, i could see it\nBut y'all don't  pay attention , i could see it\nI could see the way we treat our own shit, i could see it\nLike we don't even care about our own shit\nWhy we ain't got sidewalks in the hood?\nWhy niggas gotta always be niggas?\nWhy black folks can't have nothing good going, and if you do best believe it's gon be niggas\nI ain't talkn bout black folks, talking bout that folks, just these niggas\nI love my black folks, i love being black but i fucking hate these niggas\nMane, niggas get mad bout Trayvon, shoot a kid same age and the same race\nNiggas wanna change this shit, but then still do the same thing, don't be mad at me\nI love turning up like the next man, don't get me wrong\nSome of y'all niggas been turning up for way to long\nAnd i can see it\nI could see  the difference, i could see  the difference\nI could see it, but y'all don't pay attention\nI could see the way we treat out own shit\nObviously we don't even care about our own shit, fuck\nWhy i gotta watch my back when i get around black folks that look just like me\nHow can i show these white folks that we aren't all like em\nWhen your ass always on tv\nYou always on the news nigga\nShot a nigga for some shoes nigga\nGot in a fight from a conversation\nGot me clicking white on my application\nNow i gotta act super educated, thanks to the stereotypes that you now created\nLook at how hard you niggas have made it\nI pray to god that a nigga make it\nI'm tryna start a new black movement that don't act nothing like you act\nWish i could start a whole new black community where can't none of y'all niggas move at\n'Cause i could see it, i could see the difference\nI could see it, but y'all don't pay attention\nI could see the way we treat our own shit\nObviously we don't even care about our own shit, fuck!\n"}, {"title": "Dilla Drums... (Growth)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "The flow sound sicker over Dilla drums nigga\nThe beat sound harder when QM is on\nI know who it is in the mirror now\nYeah, I could feel the growth in me\nI sell hope, Lord forgive me\nI sell hope, Lord forgive me\nI sell hope-\nCook it, cut it, measure it, bag it, sell it\nThe fiends cop it, nowadays they can't tell if\nThat's that good shit, we ain't sure man\nPut the city on your tongue, yeah that's pure man\nYeah that's him, curtains in the windows\nLimo's off rap, who would've thought that?\nLook at the wave I just brought back\nHip-Hop back, Hip-Hop back, fax!\nThe flow sound sicker over Dilla drums nigga\nThe beat sound harder when QM is on\nI know who it is in the mirror now\nHe-he, that's a good thing, he-he\n\n"}, {"title": "Dodger", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Ya, ya, woah, woah\nPush the whip like a drop top\nTryna dodge ex girlfriends and dodge cops\nWoah, woah, hold up\nWoah, woah, hold up, hold up\nI push the whip like a drop top\nDodging ex girlfriends and dodging cops\nNike down to the ankle socks\nBesides your girls crib I'm in the bank a lot\nNike track and field I'm tryna run it up\nI might just hit it once and be done with it\nTrap house still ain't got no furniture\nA legend in the A like ted turner\nI push the whip like a drop top\nTryna dodge ex girlfriends and dodge cops\nNo, no I will not stop\nHaha ya\nI push the wheel like a drop top\nTryna dodge ex girlfriends and dodging cops\nBesides your girls crib I'm in the bank a lot\nBesides your girls crib I'm in the bank a lot\nWoah\n\n"}, {"title": "Do You Have The Time???", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Long walks on the beachWhip black like Chyna, damn\nBall like 'Bron and dem\nHoes in my DM, chat like IBM\nYou know what time it is\nYou know what time it is\nFlavor Flav, Flavor Flav\nYeah, I got love, I get love, see\nXO, XO, kiss and hug me\nRX Lexus, whippin’ on Peachtree (ayy)\nBlue Spot, Lenux Mall, know you see me\nMy shit major still, without no major deal\nNew shit finna drop again\nNew ATM, new ATM\nI'm in a L.A again, GLS 'cedes Benz\nLooking for a lady friend, take my hand\nLet the games begin, I like—\nLong walks on the beachWhip black like Chyna, damn\nBall like ’Bron and dem\nHoes in my DM, chat like IBM\nYou know what time it is\nYou know what time it is\nFlavor Flav, Flavor Flav\nIf you ever thought this was a game, it isn't\n1-3-1-7, it's a faith religion\nChecks on my body like I'm graded, nigga\nJack in my body till I'm faded, nigga (yeah)\nYou might try to tell me that I'm crazy, nigga\nI love all my hoes like Flavor, nigga (yeah)\nYou ain't doing shit if you ain't got haters, nigga\nMiddle fingers to ’em and who came here with ’em\nIf you put me on your song it's a danger, nigga\nNiggas sending shots, check your aim lil nigga\nDon’t believe the hype tho, I'll flame you niggas\nPlenty money on me, plenty flavors, nigga\nLong walks on the beachWhip black like Chyna, damn\nBall like 'Bron and dem\nHoes in my DM, chat like IBM\nYou know what time it is\nYou know what time it is\nFlavor Flav, Flavor Flav\n\n"}, {"title": "Eclipse", "year": 0, "album": "", "writers": ["quentin-miller", "cj francis iv", "quentin miller", "pe$o"], "artist": "quentin-miller", "lyrics": "Nowadays I gotta think before I do shit\nMe and my girl [?], yeah\nYou talking crazy in them fonts nigga\nI ain't giving you response nigga, yeahOne three one seven till I'm gone, yeah\n"}, {"title": "Expression 3", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "I Swear\nNot the same dude man\nI don't know if that's a bad or a good thing\nGot to do it man\nGotta finish what I started when I came in\nI just can't be stuck up in the same place\nLife got me going crazy\nGoing crazy\nI can't look at it the same, everything changed\nThey think they know me cause they know my name, but don't know a thing\nThey got opinions, they got opinions, man\nIf them shits was worth ten cents, I'd be rich\nIf my name is on it, then it's some iconic shit\nReally, thank them dudes for giving me a shot at this\nEven if that shit was not intentional\nI just left Miami, I was just off of collins, man\nTalking 'bout art basel with the prosthetic leg\nNah man, you can't stop what was already planned\nCan't stop me, can't stop me, man\nGoing, crazy\nI swear, we done been at it for so long\nI don't know how this can go\nI don't think that I'm the same guy\nLook in the mirror, I don't know em'\nHe look like someone who been through it\nAlways had something special in him, but never knew it\nLike everybody except him knew it\nAnd I don't he is, crazy\nGoin' crazy\nGet your fuckin' ass down her\nOkay, fuck you\n*Sir, you touch that, I'm gonna have to press charges againts-*\nWell call the fuckin' police right now\nCall 'em right now\n*I can't do anything about the beeper; it's a safety issue*\nNo, you're done, you're fuckin' done\n*It's a safety issue, sir*\n*Sir, you touch that lift, you're gonna be in big trouble*\nI'm fuckin' done!\n*Don't do it, sir!*\n*Hey! Hey!*\n*[?], you're gonna hit those hydraulics!*\nGet your fuckin' ass down here\n*You will kill me!*\nCome on, bitch! Come on!\n\n"}, {"title": "Expression 4", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah\nEntry, Fucking, 276\nApologies in order\nTo Maddie my daughter\nIf it was up to me, this ain't how shit would be\nApologies in order\nTo  Siniya my daughter\nSky miles racking up, I'm on the move\nMy bread ain't praying that the shit recoupe\nPut my all in everything a nigga do\nBut I can't be everything\nYeah, your mother wanted a wedding ring\nCeremony and everything\nI never did quite feel the same\nEverything, everything changed\nKarma got me two ways, two girls\nCheated death, some kind of way\nI can't help, but think what every man thinks\nI hope they never fall for a nigga like me\nApologies in order\nTo Siniya my daughter\nIf it was up to me, this ain't how shit would be\nApologies in order\nTo Maddie my daughter\n"}, {"title": "Expression 5", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah, yeah\nOne three one seven man\nMan, man, yeah\nJump right back to the beats\n20 somethin' songs in a week\nChecks comin in from the clicks\nMac, iPhone, PC\nClocked in middle of the night\n2am going on 3\nYou wouldn't understand my life\nWouldn't understand, yeah\n'Bout to move to LA, ATL get too cold man\nMiddle man sittin' in the way\nMiddle aged Quentin on the way\nNigga finna turn 28\nCan't be sittin' in the same place\nCan't take a break no, no\nCan't take a break (whoa)\nBack in the kitchen like Deen\nFuck these niggas like Dean\nLegendary like Mike Dean\nYou ain't seen the shit that I seen\nI could never work at a desk\nNigga found a way to cheat death\nMusic only thing I got left, damn\nJump right back to the beats\n20 somethin' songs in a week\nChecks comin in from the clicks\nMac, iPhone, PC\nMac, iPhone, P— (alright)\n(Yeah)\nI made this beat and song yesterday\n2017 we in a different age\nDirectly to my fans, axe the middle man\nYeah, XO's for all my women friends\nRespects owed to us we doing\nWhat they said we can't, man\nShout out Boi-1da he set the play up if it\nWasn't for him I'd still be minimum wage\nTill this day\nBig blessings, I'm seeing big blessings\nGrind harder, stack, leave my kids blessings\nPut some respect up on my name\nQuentin million dollar Miller\nKeep the change, peep the change, damn\nPeep the change, yeah\n\n"}, {"title": "Fax", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, ye-yeah, yeah\nDon't take my motherfucking shit man\nI mean, everybody say \"yeah\"\nBut y'all don't say\nThe way I be sayin' it\nI'ma notice if you do (hm-hm)\nYeah!\nToo big to fail\nMove the bars like stocks on Wall Street\nDow Jones with the sound, prices up and down\nOnce you reach a certain height ain't no coming down\nI got no complaints man, my life good\nI mean we really made the wave and you niggas jugg\nHow many times we let you run off on the plug\nGuess what? We the plug, we the fucking plug\nFax, know it for a fact\nMade it to the racks\nI ain't going back, studio my trap\nYou could pull up, get a pack (hm-hm)\nFact, know it for a fact (hey!)\nI don't give a fuck 'bout a diss song\nI don't really care 'bout a rap beef\nYou ain't even gotta @ me\nRacks, I need more of those\nHad to kick it down 'cause the door was closed\nI need all of those\nRock my Nike like designer clothes\nYeah, I be sellin' hope, oooh\nThey turn up at my shows, oooh\nSuper Saiyan Goku, yeah\nBack against the ropes, oooh\nFly like a butterfly and float, oooh\nKnock they ass down like you supposed to\nYeah, we don't play by no rules\nYeah, green light, green light, green light, go\nDo whats necessary, as long if the checks coming\nYou got a verse from him\nThen you was blessed from him\nYou really was blessed from him, fax, facts\nStudio my trap, come and get a pack\nHe-he, fax!\n\n"}, {"title": "Fleece", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah\nThree\nTA3, yeah, HT-HTA\nHaha\nFleece on fleek, she on fleek, yeah\nShe on me, what y'all think, yeah\nATL in my speech, LA streets\nShit is epic, no L.A. Reed\nIt's getting hectic, niggas want to compete, they getting reckless\nAll the energy directed at me has been pretty negative\nI'm checked up no matter where I'm in\nEven when I had to purchase from the clearance rack\nJust kicking fat, first check tech fleece, no more jeans, yeah\nChris nolan the scene when he on scene, yeah\nFlow on, interstellar, I'm with whatever\nYou getting jealous, I'm getting better, I'm lit as ever\nTech fleece on fleek, she on fleek, yeah\nATL in my speech, LA streets, yeah\nSalva back on my beat, back on my-wait, uh, wait\nOh, we're talking rap and stuff\nI hit the track and bring it back to the Saint Valentines Day Massacre\nDamn, trigger finger on fleek, I'm gonna squeeze it\nA situation with me, you don't need, yeah\nTell fill in the blank to drop a bomb on it\nWhich ever DJ's name, you all should be on it\nI ball yearly on it, like Paul Pierce or something\nInstead of dissing someone, go out and get you something\nWhen keeping it real goes wrong, that's what some of y'all careers been on\nDamn homie, a few month ago you was the man homie\nThe fuck happened to you?, aw man\nCheck fleece on fleek, she on fleek, yeah\nShe on me, what y'all think, yeah\nATL in my speech, LA streets, yeah\nSalva on the beat, HTA3, yeah\nHaha, yeah!\n\n"}, {"title": "Games Freestyle... (No Diss)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah\nPush what up?\nCheated death, he got beef with me now\nI gotta lay low, I hear the reaper is out\nI had to make sure I put some seeds in the ground\nI heard you reap what you sow\nEvery shred of humanity was killed by the socials\nIts no way to control it\nIf I had tried to send a good message no one would notice\nSo you leave me no choice but to get back on my bullshit\nOn my crabs in a barrel\nNike SB jacket, standin' right next to Terrence\nShit is more than a logo, this is the life that we living\nI was baking them pies, Mac was working at Lenox\nThat was just the beginning, we came up\nNow a nigga too adjusted to winning, I changed up\nI don't even have a problem admitting it\nI don't even leave the house unless I see a benefit\nI had started something, I gotta finish it\nSki mask flow, the door was closed\nNow I'm breaking an en-ter-ance\nBack when 50 Cent dropped \"Many Men\" I was digging in\nBeat repeat pad and pen prepping up for the games we play\nSame rappers, same moves and the same mistakes\nI can't remember how it even became this way\nSaw the stakes, took the stakes then raised the stakes\nMotherfucker\n\n"}, {"title": "Gold", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah yeah, Yeah\nGot Groove in the house\nSquad in the house\nYeah, look\nI've been doin' a lot of soul searchin'\nI can't let them take my soul from me\nI'm a king, I can't let them take my gold from me\nNo, no, I can't let 'em take my gold from me\nPush my whip like a Rolls Royce\nHoes fuck with me, I could get you exposure\nAnd I'm about that cash money like from the 'Nolia\nPut in that request, it get sold to you\nIcons in my contacts\nI'm a fuckin' icon, they don't want that, yeah\nNike hat to the front yeah\nLike I drive a truck, yeah\nUp like Donald Trump\nI've been doin' a lot of soul searchin'\nI can't let them take my soul from me\nI'm a king, I can't let them take my gold from me\nNo, no, I can't let 'em take my gold\nI can't let 'em take my gold, yeah\nI'ma keep this going too\nYeah, look\nGroove beats it's beast to say the least, yeah\nThese bars is beast to say the least, yeah\nThey goin' hard, they reach, but never reach, yeah\nMoney and me like Metal and Magneto\nKill the track like cops kill black people\nThe ball fire, my flow flyer than seagulls, man\nI can't let 'em take my soul from me\nI'm a king, I can't let 'em take my gold from me\nGotta make some plans, set some goals on 'em\nMade my first hundred bands, keep it goin', yeah\nI've been doin' a lot of soul searchin'\nI can't let them take my soul from me\nI'm a king, I can't let them take my gold from me\nNo, no, I can't let 'em take my-, hahaha\nI can't let 'em take my gold, yeah\nJust wanted to try some shit\nSee, see what y'all thought\nAlright\n\n"}, {"title": "Grey Leather", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Coming off the last record\nBlowing hundreds at the Grove when the check clear\nLit already before I even hit the function\nFuck, this shit getting to me\nRap game different than when I was young\nLook, the rappers turned song makers\nSaw a few game changers, the whole game changed up\nBut anybody who really doing it is\nMore about the followers and viewers\nLook, it's big QM now, let's get it clear\nI made hip hop history on them niggas\nI might go on hiatus and let 'em debate it\nWas he one of the great ones?\nDinner with -- at eight, my girl beautiful\nEven thought she ain't mine, she still mine, she still fine\nOpen bar, free drink, me\nPop a Barclay, let's link, ok\n\n"}, {"title": "Gunmetal Bapes", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Young Miller, young rebel, gunmetal\nProsthetic with the Bapes\nI'll let y'all tell it, y'all gon’ tell it anyway\nIt's okay\nI'm a legend anyway\nI made it this far, it's gotta mean somethin'\nMy niggas got bills, can't have the team strugglin'\nWe ain't reaching out no more cuz we don't need nothin'\nNah, my brother, we don't need nothin'\nYou made your assumption, now you stuck with it\nI could've deaded your career for the fuck of it\nI don't understand what I’m up against\nA bunch of know-it-alls but they don't know the shit at all\nThat's what's wrong with 'em\nNever had to keep me a pistol, but I did have to face some evictions\nNewborn cold as a freezer, wintertime couldn't roll up the windows\nNick Miles cold with the samples, they like \"boy, where the fuck you get them from?\"\n1-3-1-7 regime, we in the streets like Timb’s in the winter\nYoung Miller, young rebel, gunmetal\nProsthetic with the Bapes\nI'll let y'all tell it, y'all gon’ tell it anyway\nIt's okay\nI'm a legend anyway\nI made it this far, it's gotta mean somethin'\nMy niggas got bills, can't have the team strugglin'\nWe ain't reaching out no more cuz we don't need nothin'\nNah, my brother, we don't need nothin'\n\nBeen in a dark place, yeah\nI been in a dark place since mid-April\nBig demons, can't shake or run away from\nMa help me, God help me, Lord help me\nI can't help it, I feel helpless\nI'm tryna find my true self in this\nI can't lie, I’ve been selfish\nDaughters with a \"S\", I got two of those\nI gotta protect 'em at any cost\nGotta get the whips with the ceilin's off\nJust to say \"I got it\" in a couple songs\nIs that the only reason that I do it for?\nDoes this shit really matter when the music's off?\nMaybe I wasn't meant to be in it long\nSome people are stars, some are shootin' stars\nYou know some stick around, and some come across\nIf that's the case, I’ll just embrace it, I’ll be better off\nOn to the next move now, steppin' off\nThe old one with that new gunmetal walk\nYoung Miller, young rebel, gunmetal\nProsthetic with the Bapes\nI'll let y'all tell it, y'all gon’ tell it anyway\nIt's okay\nI'm a legend anyway\n\n"}, {"title": "High Speed Chase...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yuh, yuh (ooh)\nYuh, yuh (ooh)\nYuh, my way, I gotta live life my way\nStakes up high, it's some high stakes\nHigh speed chase, I don't touch brakes (ooh)\nYou's a fuck boy with a fuck face (ooh)\nIf I get her home I'ma fuck face (true)\nWhen it come to songs ain't too much I can't do\nBad bitches on me so much I can't move\nTalkin' down on me but wanna act cool?\nThinking 'bout me? Need to focus on you\nAyy, run it up, wait (ooh)\nHigh speed chase, we don't touch brakes (ooh)\nHey, hey, hey!\nThey like let me get a break, Q.M let me get a second\nNiggas out here selling they respect for a necklace\nDamn, shit been gettin' hectic, it's hectic\nUsed to pop two buses a day, living reckless\nI was whippin' fini till I wrecked it\nTook a trip to Russia, came back and bought a Lexus\nYou ain't gotta like me, just respect it\nYou gon' fuck with my shit if real is your preference\nYeah, the kid with the leg missing\nHe could prolly make a mil off a reference (ooh)\nYuh, my way, I gotta live life my way\nStakes up high, it's some high stakes\nHigh speed chase, I don't touch brakes (ooh)\n\n"}, {"title": "Hot N’ Cold", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, I might, I might, I might\nI might..\nI might, yeah, be too cold, be too hot\nGuy like me gets involved in a lot\nYeah, pull a car up out the lot\nYeah, Sean Combs, I can't stop\nYeah, right back to the bop\nI just run my wrist in the pot\nFlick my wrist every time you make it drop\nThought you said that you would meet us at the top\nBut I checked, you weren't there\nMy shit [pipe?], so is life, shit ain't fair\nNiggas run from the truth, they pick dare\nWatch my moves, watch my moves, first step\nI might, yeah, be too cold, be too hot\nGuy like me gets involved in a lot\nYeah, pull a car up out the lot\nYeah, Sean Combs, I can't stop\nYeah, right back to the bop\nI just run my wrist in the pot\nFlick my wrist every time you make it drop\nThought you said that you would meet us at the top\nYeah, let 'em in, they with me\nYou know squad, you know me, UTD\nYeah, I was gettin' fifty plays a week\nNow I got fans overseas, look at me\nNike pants, I don't wear jeans, that ain't me\nI ain't them, y'all do them, I do me\nNiggas fake like the Sims in these streets\nNiggas be faker than the Sims in these streets\nI might, yeah, be too cold, be too hot\nGuy like me gets involved in a lot\nYeah, pull a car up out the lot\nYeah, Sean Combs, I can't stop\nYeah, right back to the bop\nI just run my wrist in the pot\nFlick my wrist every time you make it drop\nThought you said that you would meet us at the top\nWhat happened?\n1-3-1-7\n\n"}, {"title": "HTA Flow", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, this that HTA flow, karma shimmerin'\nMaking smarter decisions 'bout my time spending\nI got my nurturing heart from my mom didn't I?\n1 dog and two children, goin' out is like clocking in\nI just purchased Arkham Knight again, fuck it\nI’m making money from people pushing buttons, I'm forever upward\nHit a rut a couple months ago that I'd been stuck in\nBig decision, go for hits or make some shit with substance\nShoutout 2 Asia for servin' plates up of inspiration\nShe put me on to this tape and wala I made it\nWheel up, wild out like wale on a publication\nMake the moves that you make, make statements\nBrought it way up from the basement to the helipad\nThey wouldn’t tell you that they mad\nBut even still you can tell they made\n2016 I went to hell and back\n\n"}, {"title": "Is That???", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah\nAnother one?\nAnother one, woah\nWoah, woah, woah\nYeah, yeah\nIs that your girl now? I cannot tell now\nI treat my town house, just like a trap house\nYou put your order in, I send that dope out\nBK my own boss, boy what you know about?\nYa, ya, 30 Roc pulled up, and he brought reefer\nMy new bitch hate me, hate how I treat her\nI'm getting money, I cannot talk much\nStay true till cops out, mommy a child holder\nIs that your girl now? I cannot tell now\nI treat my town house, just like a trap house\nYou put your order in, I send that dope out\nBK my own boss, boy what you know about?\nThat boy Q.M. just got back from Texas\nI'm sipping Texas, your bitch gon' text me\nFenny in the Lexus, unless they pay me\nCameras surround me, yeah bitch I'm famous\nIs that your girl, dog? I cannot tell now\nI'm in your Ear Drums, shoutout Mike Will now\nWe got that turn up, we got that turn down\nGot shit to boot you up, got shit to turn you down\nYeah, we got both, we got both yeah\nWe gon' win, we gon' brag, we gon' boast, yeah\nWe don't take, we don't ask, cause be don't care, yeah\nNo, we don't care, yeah, no, we... Yeah\n"}, {"title": "Joel Goodson", "year": 0, "album": "", "writers": ["quentin-miller"], "artist": "quentin-miller", "lyrics": "Yeah, just every day pimping man\nAin't got many cars outside, but I got a ho outside, you feel me?\nAnd that bitch willing to go the extra mile, you hear me?\nIf you know what I mean? We doing that shit straight out of Atlanta\n\n"}, {"title": "Jokes.... (”Can’t take a joke” Remix)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Blast that shit back, blast that shit back\nBlast that shit back if you blastin'\nPass that shit back, pass that shit back\nPass that shit back after I pass it\n1317\nYa digg\nI be tryna kick it with the bros, tryna link up with some hoes\nMiddle fingers to my foes, yeah I got them\nNiggas wanna talk bout takin' jokes, but they can't take a joke\nIf you lookin' for a joke, boy you got one\nEvery single time I hit the road, gotta put on for my folks\nGotta show 'em who is chosen, it's not them\nNiggas wanna talk bout takin' jokes, but they can't take a joke\nBig talk, big talk, switch my, tax bracket\nCash appin', bag snatchers, had to have it, last in my lil' category\nI could tell a sadder story, dark tales, twisted dreams\nPress the button, hit the screen\nGet these things, p-o-p, i-n-g, hold it down\nPimp C, UGK, modern day, Mac & me, shoutout Bun B\nCame, I didn't run, took that L, learn from that, lesson learned\nI'm way too ?, ?, Jesus Christ\nMom was scared, dad was there\nBrothers too, fuck I do\nSix months, healing time\nSucks for you\nI be tryna kick it with the bros, tryna link up with some hoes\nMiddle fingers to my foes, yeah I got them\nNiggas wanna talk bout takin' jokes, but they can't take a joke\nIf you lookin for a joke, boy you got one\nEvery single time I hit the road, gotta put on for my folks\nGotta show 'em who is chosen, it's not them\nNiggas wanna talk bout takin' jokes, but they can't take a joke\nBlast that shit back, blast that shit back\nBlast that shit back if you blastin'\nBlast that shit back, blast that shit back\nBlast that shit back\n\n"}, {"title": "Judge Dread", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yo, yeah-yeah, yeah\nAh, couldn't\nYeah\nBeen in the darkest places\nMade the hardest decisions\nI'm a rap star for a living\nBut I gotta father my children\nAll I know is confusion\nThat's all that I know, yeah\nYeah, that's all that I know\nIt's a lot of mine\nSee as far as it goes\nYeah, inspire some hope\nDo that shit before I go, yeah\n"}, {"title": "KellySlate (PennState)", "year": 0, "album": "", "writers": ["quentin-miller", "cj francis iv", "quentin miller"], "artist": "quentin-miller", "lyrics": "Derrick Rose to the hole, i'ma penetrate\nMy white bitch, she goes to Penn State\nDrive my '97 like a Benz from today's date, yeah\nYou gon ride this wave, you gon KellySlate\nYou gon ride this wave, you gon KellySlate\nKnow you bad as fuck so you always late\nJust like my white bitch\nMy white bitch, she goes to Penn State\n\nGo... goooo\n\n"}, {"title": "Lies (What I Live)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "You know it's like, I see y'all\nAnd what y'all be doing, you\nWear disguise, tell them lies to be televised\nI'd rather work a nine to five over selling my soul\nChasing fame, tryna see yourself among the stars\nI'd rather chase this fucking paper over chasing these hoes\nThat's what I live now, that's what I live\nYou rap about it but that's what I live\nThat's what I live, boy, that's what I live\nBeing  broke ain't an option where there's mouths to feed\nY'all can be hand-out, on your ass, Christopher Reeves\nToo bad I think differently\nI guess y'all quote-on-quote \"different\" rappers ain't different as me\nOn your Twitter page sneak dissing at me\nLook at how difficult it's gonna be\nI done seen what it's like to get rich off your dream then lose it all\nYou can have the game, I'm through with y'all\nI'm moving on, don't try me though\nYou've been warned, Quentin Miller, I'll check to that\nThese niggas can't hold me back\nFive-O, X two, you rapping dudes, I don't get you\nCause niggas'll sell their soul for some clothes and Versace gold\nNiggas ain't got goals when they shoot them viral videos\nWorld been cold, I just finally threw my sweater on\nDamn\nWear disguise, tell them lies to be televised\nI'd rather work a nine to five over selling my soul\nChasing fame, tryna see yourself among the stars\nI'd rather chase this fucking paper over chasing these hoes\nThat's what I live now, that's what I live\nYou rap about it but that's what I live\nThat's what I live, boy, that's what I live\nDaughter on the way, I got dreams but that don't fill her plate\nWhat's that shit you say?\nIf it ain't about money, it don't apply to me\nTryna get rich off writtens just like tickets from the lottery\nOne in a billion chance you win, daddy tryna drive new Benz\nApologies in order to Maddy, my daughter\nI just wanna see you brought up better than I was brought up\nI just hope that I could show you, you can be anything you wanna\nWithout misleading persona, I'm working on it\n\n"}, {"title": "Look What I Did", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, 1-7\n1-3-1-7, yeah\nMi-, man\nMiss me with that, with that high school shit\nWith that high school shit\nNigga look what I did, I don't gotta prove shit, I don't gotta prove shit\nNigga look at my bitch\nI don't have to pay her bills, she already hood rich\nNigga look how I live, look how I live\nYeah\nLook how I, look how I live...\nBrown liquor in the fridge...\nSome things you just won't understand...\nTime Warner, I got hoes on demand\nComcast, I got hoes on demand\nWhat does that say about me as a man?\nOkay, too caught up, two daughters\nHope they never fall in love with a guy like I am\nCouldn't settle for the place I was placed inside of\nHad to come up out it\nI was too unhappy, had to do something 'bout it\nYou can't do nothing 'bout it\nEverybody, but you going off in your project\nAnd you call it your comeback, fuck that\nNiggas caught me slippin' once\nNow I'm looking out on all fronts\nI'm really up there with 'em, I'm not a little guy\nAsk Ty Ty, that's a big name drop\nI only met him a couple times, but them discussions was pretty clear\nI got different peers, rappers come and go\nWe see 'em dissapear\nIt's not a race, it's a marathon\nJust give it a year or something\nLet me get the game figured out\nI come at these niggas brains when I drop, woah\nWoah!\nThat high score shit\nNigga look what I did, I don't gotta prove shit, I don't gotta prove shit\nNigga look at my bitch\nI don't have to pay her bills, she already hood rich\nNigga look how I live, look how I live\n\n"}, {"title": "Love Costs.", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yuh\nYou gon' ride for me? You gotta show me\nSaid you down for me, you gotta show me\nIf I was down, would you leave me lonely?\nWhat your love cost, 'cause it ain't free\nYou got your own, girl you doin' okay\nShe like Louis Vuitton, she like Dolce\nI can't fuck around, no I won't play\nI need all your love now, I won't wait\nNo, no\nI'm tryna tell you how I feel about you, I cannot express it\nLet you know it's real without comin' off aggressive\nDon't be tryna tell me 'bout your ex now, that's extra\nNow you feel impressed, now it's pressure (Whoa)\nI am not impressed, you a mess, girl (Whoa)\nShit wasn't like this when we met, girl\nSay that you gon' ride, show me that (Yuh)\nThey cannot hold me back\nMoved away from broke and I'm not goin' back\nLook out for my bros, you know I'm doin' that\nYoung Q.M. the G.O.A.T. and BMarch, it's a wrap\nYou gon' ride for me? You gotta show me (Show me)\nSaid you down for me, you gotta show me (Show me)\nIf I was down, would you leave me lonely?\nWhat your love cost, 'cause it ain't free (Ain't free)\nYou got your own, girl you doin' okay (Okay!)\nShe like Louis Vuitton, she like Dolce\nI can't fuck around, no I won't play\nI need all your love now, I won't wait\nNo, no\nShe like fancy dinners, she want trips to Venice (Whoa, yuh)\nShe like useless spendin', she want true commitment (Whoa)\nMan, ain't no opposition, ain't no competition (Whoa)\nMan, how long we been winnin', man, its been a minute (Whoa)\nHow you just gon' act like you ain’t know\nYou sing like a Yin-yang twin, your numbers gettin' low\nShe gon' treat me right or leave me standin' in the cold\nIf you really down, then say you down, let me know\nYou gon' ride for me? You gotta show me (Show me)\nSaid you down for me, you gotta show me (Gotta show me)\nIf I was down, would you leave me lonely? (Lonely)\nWhat your love cost, 'cause it ain't free (It ain't free)\nYou got your own, girl you doin' okay (Okay!)\nShe like Louis Vuitton, she like Dolce (Dolce)\nI can't fuck around, no I won't play (Won't play)\nI need all your love now, I won't wait\nNo, no\nYessir\n\n"}, {"title": "Made a Mark...", "year": 0, "album": "", "writers": ["thecoolismac", "quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yuh, aye, yuh\nMade a mark in this game, yeah I did that\nIt's respect on my name, now they big mad\nNorth Atlanta, where them drug dealers buy zips at\nA young get-it-out-the-mud nigga, I'm is that\nI put gold in my mouth when I'm jiggin' out\nI put truth in my rhymes and I live it out\nYou don't listen to my music, you just missin' out\nMade a mark in this game, yeah I did that\nIt's respect on my name, now they big mad\nNorth Atlanta, where them drug dealers buy zips at\nA young get-it-out-the-mud nigga, I'm is that\nI put gold in my mouth when I'm jiggin' out\nI put truth in my rhymes and I live it out\nIf you don't listen to my music, then you missin' out\nIf you don't listen to my shit then you missin' out, nigga\nMade a mark in this game, yeah I did that\nIt's respect on my name, now they big mad\nNorth Atlanta, where them drug dealers buy zips at\nA young get-it-out-the-mud nigga, I'm is that\nI put gold in my mouth when I'm jiggin' out\nI put truth in my rhymes and I live it out\nIf you don't listen to my music, then you missin' out\nIf you don't listen to my shit then you missin' out, nigga\nHeh heh heh\n\n"}, {"title": "Make It Take It", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Shit's amazing, it's so amazing\nIt's so amazing, I made it\nIt's make it take it so I'ma take it\nFading, I'm probably faded, I'm really faded\nLooking out for the fake shit, looking out\nEverybody give their two cents now a nigga rich\nEverybody got shots to take, I'll take the hits\nMaybe I should leave the game, try something else\nSteve Woz, I made the product by myself\nLife changed up, Soundz came up\nI done came up, we remained us\nFuck the game up, fuck the game up, fuck the game up\nFuck the laws and fuck the lames up, fuck the lames up\nIt's amazing, it's so amazing\nIt's so amazing, I made it\nIt's make it take it so I'ma take it\nFading, I'm probably faded, I'm really faded\nLooking out for the fake shit, looking out\nLooking out for the fake shit\nLooking out for the fake love, that's real hatred\nI don't fight life, I embrace it\nSpent my bread on putting smiles on my daughters' faces\nNot your basic, not your\nI'm getting close, man I'm getting close\nHopefully I make it 'fore my window close\nCranberry with the liquor pour\nEverything but that is different\nShits amazing, it's so amazing\nIt's so amazing, I made it\nIt's make it take it so I'ma take it\nFading, I'm probably faded, I'm really faded\nLooking out for the fake shit, looking out\nGod gave me daughters, I embraced it\nGotta keep a smile on they faces\nGotta take 'em out on vacation\nI just can't be out with a basic\nYeah\n\n"}, {"title": "Minimum Wage Freestyle", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah\nYeah, here I go, here I am again\nQuentin Miller and Samiyam again, so unauthorized\nPoet, author, all those titles fit me well man I found my size\nI'm still around years after I should've died\nY'all still be looking surprised\nI'm nice, I'm thriller when on the mic\nOff the wall held all those\nMoonwalk with the flow, fuck it\nI brought it back to authentic rap\nBut switch to that new flow any minute if you\nThink a nigga lack\nI been thinking back\nOn decisions made\nSome were good and bad\nSome were downright bad I still did that\nI ain't have no god I had to get there\nNo young money for me that's no diss its just\nSomething I noticed\nHard to stay focused when you get that pink notice\nThirty days to pack your shit and go nowhere\nNewborn with me, the city don't care\nI been there\nThats why I go hard on the track I refuse to go back, uh\nPressure make a nigga blow a fuse\nWays gotta raise 'fore I lose it\nIt's really hard to gauge what the truth is\nI gotta see the windows bro\nHad to slow the tempo bro\nYou know, think 'fore I move\nMight have lost a queen but I still got a bishop and a rook\nReal lyrics in the verse minus hook, hold up\nYeah, cook the verse like Enron cooked the books\nGuy on the stove\nNot the only guy, just the guy that was chose, whoa\n\n"}, {"title": "New Equipment Freestyle", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah\nWhats your sign?, I don't even care\nYou know mines, gotta keep the scale\nClimax I could meet you there\nI could meet you there\nTook my time, just got off the road\nSelf made, did shit on our own\nI'd never do you wrong\nBut who I'm kidding I'm forever in the wrong man\nWho I'm kidding I'm forever in the wrong man\nWho I'm kidding I'm forever in the wrong man\nFill out them papers and collect the payments\nNo police station ever gets a statement\nRest in peace to [?] and Trayvon\nHope you got that hoodie on in heavens gates\nAnd I mean that shit in every way\nI've been seeing blessings every day\nAll my ex's good investigators\nI be tryna keep my secrets\nI was tryna keep you around, forreal\nSaid what I said, did what I did, yeah\nLosing my grip, started to slip, yeah\nLook in the mirror, don't know who he is, yet\nMix my liquor with prescription yikes!\nEvery night is like I roll the dice\nI don't know if I deserve a wife\nWill I ever love again?\nColdest spring ever, Nike golf sweater\nSays she finna leave I'ma let her\nSays she want to leave I'ma let her\nBoth know that I can't be what you want me to be\nI can't leave the game, shit be calling me\nIf I die before I wake\nMake my music say the things I couldn't say (hey!)\nMake sure my daughter straight\nLeave 'em right, 50/50 my estate\nKeep they mother on her feet\nKeep my name buzzin in the streets, man\nWhats your sign?, I don't even care\nYou know mine, gotta keep the scale\nClimax I could meet you, I could meet you\n\n"}, {"title": "Newton (Freestyle)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah yeah\nShould I give 'em one more before the year's over?\nFresh off the laptop\nIt's kinda hard to get a mix done on New Year's Eve\nOh yeah, I just recorded this\nWest Coast with it\nThe flow's so fitting\nA on my skin, A on my fitted\nBig players brewing I feel like Cam Newton'\nI'm so out of pocket, shout out Key\nNah, you ain't gotta shout out me\nFor real though, all the real gon' vouch for me\nThis past year sparked some pretty good ideas\nI ain't ask for it, I was put out there\nBut since I'm here, might as well get comfy\n'97 whip, moonroof, still functioning\n13, 17 hundred from the jump with me\nBetter be punctual with that money you owe\nHold up\nWest Coast with it\nThe flow's so fitting\nA on my skin, A on my fitted\nBig players brewing I feel like Cam Newton\nTouchdown addict, I'm still dabbing\nYou still fucking with them cause you live backwards\nY'all dudes ain't keeping it real\nOnce you realize what is then there's no going back to not knowing\nLord when does he NOT go in\nCrack-rock flow\nThe pot's overflowing\nCrack-rock flow\nI'm on my Frank Ocean\nNike sandals listening to Channel Orange\nI'm so real\nNike coat for him\nIt's gonna be a cold winter\nTryna not to stray far from Character\nI'm far from an established artist\nBut I'm far from amateur\nRockstar pop far tight grip on banisters\nYou'll never see me falling off\nEvery season balling hard\nI'm in the game I'm Willie Beamen\nI might fuck up some change over the weekend\nEverything changed even the people\nLion from the P-state, Cecil\n\n"}, {"title": "Notification Medication", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, notification medication\nTweets, comments, likes, repost, nigga, that's good though\nI saw a story that had made me feel unimportant\nYou know, fast cars, jewelry, that sorta thing\nI can't afford them things, but still I want them things\nFor all the notifications that it would bring, we on\nYeah, notification medication\nWhen timing meets preparation, that's how success is made but\nWe ain't prepared, we too busy spectatin', I'm saying\nWe all need hits from the clicks\nTBT's for L.i.K.e's not to reminisce\nAnd them shits ain't worth a cent, notifications\n\n"}, {"title": "OJ Dem...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, ayy, ayy (Cole, you stupid)\nYeah, ayy, ayy (Ayy)\nMe and Hollywood Cole\nNo, we ain't come to play, no\nI expect to be a billionaire by any day now\nGenerated millions, still home making WAV files\nI just spoke to the plug, he said the work was on the plane now\nBack to back I’m droppin', they like \"Can I get a break now?\"\nEven though they hate they seen the bumpers like a breakout\nI fuck up the stage, I said I fuck up the stage now\nI fuck up the stage, nigga (Ayy)\nYeah, ayy, ayy\nYeah, ayy, ayy (Yeah, okay)\nRap game easy but the dope game gravy\nLast night drinking, I was throw'd, Tom Brady\nSticking to the script, my clique was on the same pages\nMoney on the way off of rap, shits amazin’\nI brought it from the bottom like I brought it from the basement\nBrought it off the lot then went ghost, Pat' Swayze\nI really found it funny when they talk 'bout being wavy\nI'ma let 'em have it, I'm just saying you should thank me\nYeah, I come from a note but I rap like I live in the projects\nI'm looking for more, what I'm after is bigger deposits\nMy weed and my women exotic\nShe said Q.M is the truth (Ayy), you got it\nAyy, ayy\nYeah, ayy, ayy\n\n"}, {"title": "Open to interpretation....", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Don't be\nDon't be confused by the numbers and views\nI hear a lot of me, I know you hear it too\nIt's cool, I pay attention too, I get it\nThe downside to actually gettin' to know your heroes\nIt's never what it seeming\nI can't tell when you genuine and being strategic\nTry not to overthink it\nLook, I'm outchea bruh, you see me\nY'all want me to be upset, I just be me\nSame parks as Offset and the three Migos\nThat part of town created so many flows, I'm sayin'\nOpen for interpretation, nothings off the table\nY'all play games that two can play and I enjoy playin'\nFuck is left to say but let the games begin, uh\nStill with the Lexus like I drop Mercedes Benz\nI'm a made man, and money never made the man\nLet's get fades ran, Mac was heated anyway and-\nEveryday I live in pain, so I'll adapt to anything\nUh, yeah, hunnid bucks for the drug money\nPut insurance on the truck with the hush money\nY'all like playing with fire, you get a rush from it\nIt's been enough subbing, look\nShoot the gift, I'm super lit at what I do with this\nAnd if I shoot I only shoot to hit\nFrom the same state as Future, Tip, and Ludacris\nRun me my respect please, it's overdue as shit\nY'all niggas always on some shit\nAlways trying to take a yard when giving inches\nLove talking from the benches\nNot from the projects but I made it out the trenches\nAnd you sneak dissing\nIt's whatever really, forever really\nMy name will be mentioned\nAy, yeah you, motherfucker\nYou know who I'm talking to\nYeah, you that motherfucker\nThat betrayed your homeboys\nAnd you ain't shit!\n\n"}, {"title": "Out of My Hands", "year": 0, "album": "", "writers": ["quentin-miller", "cj francis iv", "quentin miller"], "artist": "quentin-miller", "lyrics": "Good pizza\nGood Atlanta Georgia pizza\nBrown liquor for real\nYou know what turned out, started out… you know..\nJust play around, turned to a real experience\nYeah ya dig\nSometimes I think about the shit I did\nThink about the shit that I’ve been in\nSometimes I think about that crash\nWhat’s the reason that I lived\nWhy a nigga still here\nYeah\nI was with you but I was never there\nLike never quite there\nI mean I felt the same\nIt wasn’t like I was running game\nSometimes feelings change\nLike the seasons\nCoz we been\nOut here on the road\nOut here chasing goals\nWe don’t want no bronze or no silver\nSplit it all with my niggas\nYeah\nPlace your order we deliver\n1317 you know it\nYeah you know, you know\nAnd I still don’t know why they still want the fame\nDon’t you see it’s not your plan, I just live coz it’s out my hands\nShawty know that I’m not her man\nDon’t let space come between us again\nI am not myself and  you are no one else’s\nWe don’t need no help, I just need you healthy and present when I’m here\nYour mother getting sick, last year had a scare\nTold you that I’d be there did not disappear\nI don’t even know where\nReal fast when I hit third gear\nIt be crazy real clear real clear\nNorthside yeah I still reside there\nDon’t know why be fair\nAnd I still don’t know why they still want the fame\nDon’t you see it’s not your plan, I just live coz it’s out my hands\n\n"}, {"title": "Playmaker", "year": 0, "album": "", "writers": ["thecoolismac", "quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Keep my circle tight and remain G (yessir)\nLookin' at my feet, I need a minute to explain these\nI'm on your head like a brain freeze (turn up in here)\n"}, {"title": "Post Malone", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "I told you... yeah\nYou can turn me up a little more?\n*30, you a fool for this one*\nYeah, I already told you I'm choze, I already won\nIt wasn't even close, shit is over\nLet you niggas pose, I just post up\nBlack Malone in the Lone Star\nNeed no help, no, we really don't need no help, yeah\nGet it myself, had to get straight to myself, yeah\nI got Nike on me right now, yeah\n1-3-1-7, it's a lifestyle, yeah\nMix my drugs when I hit my drugs, yeah\nHit my plug when I get my drugs\nIf I'm on the drugs, I might hit you up, yeah\nYeah, depend on how I'm feelin', yeah\nJust depend on if I'm hittin', yeah\nCheck your Snapchat, let me see your outfit\nTrying to see about that mouth still\nI just stepped up out the house like\nYeah, I already told you I'm choze, I already won\nIt wasn't even close, shit is over\nLet you niggas pose, I just post up\nBlack Malone in the Lone Star\nNeed no help, no, we really don't need no help, yeah\nGet it myself, had to get straight to myself, yeah\nI got Nike on me right now, yeah\n1-3-1-7, it's a lifestyle, yeah\nTake a Xan, pipe down, yeah\nYeah, take a perc, pipe down, yeah\nSip some syrup, pipe down, yeah\nNow hit this router and boot up\nI'm gonna do what I want\nI'm gonna park out front\nI'm gonna take that hit, just to stunt, just to stunt\nGas in Seattle 'cause it's legal, pass the blunt\nYall was cashing out, I pass you up, I pass you up, look\nYeah, I already told you I'm choze, I already won\nIt wasn't even close, shit is over\nLet you niggas pose, I just post up\nBlack Malone in the Lone Star\nNeed no help, no, we really don't need no help, yeah\nGet it myself, had to get straight to myself, yeah\nI got Nike on me right now, yeah\n1-3-1-7, it's a lifestyle, yeah\nIt's a lifestyle, yeah\nYeah, I got Nike on me right now, yeah\nDamn, all this Nike on me right now, yeah\n1-3-1-7, alright\n\n"}, {"title": "Potential", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Treat the Fuelband like a Rolex\nShe ain't coming over? Cool, I ain't stressin'\nI got hoes I ain't stressin', I ain't stressin'\nI got money I ain't stressin', wait\nShe like fuckin' with a nigga with potential\nDamn, all this Nike shit on me, expensive\nQM Rapping C4 on the instrumental\nWait, wait, wait, wait, hold up\nWatch me scrape it, hold up\nWatch me scrape the plate, fetty scrape, hollup\nThink you in the game? You in the way, hold up\nWait, wait, wait, wait, hold up\nFuelband on press a button make my wrist think it's Christmas Hold up, hold up, hold up\nBad bitches on me I guess money was the only thing missin'\nHold up, hold up, wait\nShe said, \"I listen to you every day\"\nWhen she's with him, she wish she was with me\nWhen I'm with her, sometimes I feel the same, yeah\nNo my crew don't abide by the rules\nI can no longer lie for you dudes\nThat's why I'm out here dodging interviews, wait\nTreat the Fuelband like a Rolex\nShe ain't coming over? Cool, I ain't stressin'\nI got hoes I ain't stressin', I ain't stressin'\nI got money I ain't stressin', wait\nShe like fuckin' with a nigga with potential\nDamn, all this Nike shit on me, expensive\nQM Rapping C4 on the instrumental\nWait, wait, wait, wait, hold up\nWatch me scrape it, hold up\nWatch me scrape the plate, fetty scrape, hollup\nThink you in the game? You in the way, hold up\nWait, wait, wait, wait, hold up\nI ain't got nothin' to lose, I ain't got nothin' to lose\n1-3-1-7 the movement, we don't do nothing but move, wait\nYou just gone put on a hat and just act like you ain't seen me doin' it\nI know that shit ain't no accident or no coincidence, wait\nNiggas be stealing the swag and thinking they gone get away with it\n1-3-1-7 with attitude Nike with attitude head on it\nHow many albums went platinum this year that don't got my name on it? – I’ll wait on it, yeah yeah ooh\nWe are not involved if it's y'all squad\nJerz put me in the mob, I got mob ties, yeah\nMiddle finger pointed towards y'all guys, yeah\n99 cents, you a small fry, yo\nTreat the Fuelband like a Rolex\nShe ain't coming over? Cool, I ain't stressin'\nI got hoes I ain't stressin', I ain't stressin'\nI got money I ain't stressin', wait\nShe like fuckin' with a nigga with potential\nDamn, all this Nike shit on me, expensive\nQM Rapping C4 on the instrumental\nWait, wait, wait, wait, hold up\nWatch me scrape it, hold up\nWatch me scrape the plate, fetty scrape, hollup\nThink you in the game? You in the way, hold up\nWait, wait, wait, wait, hold up\n\n"}, {"title": "Power 106 Freestyle with Quentin Miller", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "This shit be a Felli Fel freestyle\nThe Fini smashed so the RX is out\n28 years last year, my life different\nI'm lookin' at life different\nTryin' to avoid police and life sentences\nOn my Bruce Willis sh-\nIf I'ma die, I'ma die hard with a vengeance\nThey want new Q.M., they really do\nI been waterin' this here money tree\nSince Lamar dropped *Swimming Pools*\nHome school, the real-\nNigga really lived in that livin' room\nSaid it, then I did it to 'em\nNot quite rich, but that price tag affects me less\nI would rather spend more if it stress me less\nIf it gets me straight to the point\nLike direct-to-sex\n\n"}, {"title": "Powerless...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Nick Miles, we back again, aye\n(Oh whoa)\nNo I can't control it, I can't control it\nI just keep doing it\nI can't control it, what's in your pockets?\nMine look like bulges\nYou can't control it, we done took over\nWake up smell the folgers\nYeah, wake up smell the folgers\nWe in the game now, you can't control it\nPut my arm in this shit, till it pays back\nBy  time or money you can get it back\nYeah, out of town making moves trying to get a say here\nBack at home my daughter wonderin' where her daddy at\nYeah, Yeah, Yeah\nI can't control it, I can't control it\nShe gon' get older, She gon' want to know shit\nWhy things ain't work out with me and mommy?\nI'ma heart breaker, runs in my family\nI can't control it, I can't control it\nI can't control it, I can't control it (anymore)\nPut my arm in this shit, till it pays back\nBy time or money you can get it back\nYeah, no one knows how it feels, no one understands\nThe shit I been through, yeah\nYou ain't never been through that\nYou ain't been through that\nYeah, you can't control it, you can't control it\nOn them high horses, you can't be on that\nMade up opinions, don't even know me\nI am a rock star, you can't control me, no\nYou can't control me, you can't control us\nYou can't control me, yeah\nNick Miles, Quentin Miller\n\n"}, {"title": "Praying Mantis Freestyle", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah (Cole, you stupid)\nAight, yeah\nPlease don't get this shit mixed up\nI don't give a fuck 'bout who next up\nTough guy rappers don't seem so tough\nFirehouse subs, how nigga send subs?\nNiggas wanna act like I ain't they plug\nWhen they show love I don't ever get love\nGot a little buzz and you wanna switch up?\nLet 'em switch up while I'm levelin' up\nKnow how it look and I know how it seems\nYou thought it was sweet, you thought it was clean\nSmoke ain't a issue, it isn't a thing\nI let 'em have it, come get it for free\nIf I didn't get it, it wasn't for me\nDon't gotta be woke when you wasn't asleep\nShe said she don't get enough TLC\nThat's why she hittin' me up for the creep\nI could just tell they don't want us to eat\nThey clean up the counters, the floor it got sweep'd\nNo competition, don't gotta compete\nI'm already winning, this isn't defeat\nOnly thing sweet is when I'm in a suite\nBut other than that it's nothing but heat\nI just know I gotta get to the bag\nThe same way that Russell had got to the Greek\nStill paying rent off the shit that I said\nThey call it a game and that's how I play it\nSo many niggas had left me for dead\nMeanwhile I'm killin' the game instead\nI'm going crazy, I'm off of my meds\nI'll never get back on prescriptions again\nFuck that depression shit, I'm tryna live\nThe legend still lives, it is what it is\n\n"}, {"title": "Problem Solved", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Mothafuckin' spooky tour\nYeah\n"}, {"title": "Proper Freestyle", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Cole, you stupid\nYeah, I'm out of ways to say it\nI got a ways to go but I'm way ahead in a race\nI started off in a basement, then I start hittin' the pavement (Tsk)\nHow I came up is amazing\nI got my dope on a plane with me, yuh\nThey not on my brain to think with me\nIf I'm not on the beats, I’m with a bitch making some beats (Yeah)\nI'm not your average Joe you see on the street\nNiggas be thinking they fleek, you really a fleet (Forreal)\nOne three one seven and one more for thinkin' it's sweet (Forreal)\nBack in the kitchen with grease, I'm cookin' with grease (Forreal)\nDamn, she got my shit on repeat\nDamn, Q.M back up in the streets, how we gon' eat?\nYuh, yuh, you do not own the sauce, you niggas lease\nYuh, they pay me to speak, I feel like a priest\n\n"}, {"title": "Puff free...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, life goes in cycles\nWhat comes around goes around\nSo hold it down like you supposed to hold it down, yeah\nGrowin' up I would say the hardest part\nRighting wrong, what's right? What's wrong?\nThis life is far from black and white\nIt's orange, pink, yellow's, blue's and off-white shoes my dude..\nI'm sayin' I don't even feel the need to chase publicity\nYou know, steady doin' shit that isn't me\nAttention seeking, keep that shit off my description when descripting me\nLifted off prescription like Diego be, shake the hate off me\nPray the Falcons hit the bowl since it's up the street"}, {"title": "Put Nothing Past You...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, uhhhhhhh\nUhhhhhhh, I might\nI might change up\nMight get rich, might get rich, might just change up\nIt was trench, it was trench where I came from\nHad to get it how you live where I came from\nHad to go hard, had to go hard where I came from\nSo many calls, yeah we called, no one saved us\nShit broke my heart, broke my heart when you changed upI can't put nothing past you, can’t put nothing past you\nI'm on my own path, I'm on my own path too\nI want my respect and them platinum plaques too\nOn these niggas necks, ain’t no holdin' backI might change up\nMight get rich, might get rich, might just change up\nIt was trench, it was trench where I came from\nHad to get it how I live where I came from\nHad to go hard, had to go hard where I came from\nSo many calls, yeah we called, no one saved us\nShit broke my heart, broke my heart when you changed upI might change up\nMight get rich, might get rich, might just change up\nIt was trench, it was trench where I came from\nHad to get it how I live where I came from\nHad to go hard, had to go hard where I came from\nSo many calls, yeah we called, no one saved us\nShit broke my heart, broke my heart when you changed up"}, {"title": "Q.M. x CHASETHEMONEY unreleased", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Just 'cause they wish you well don't mean they mean well\nI can't slip up, pay attention to detail\nProduct zipped up and I send it through email\nI spend so much on apparel and retail\nNow I'm glowed up and I'm wishin' I did more\nI see it clearer than how I seen it before\nMan in the mirror whenever I look there\nI just didn't know exactly what I'm lookin' at\nMaster yourself, take control of your thought pattern\nCut off the friends that are fake and your bad habits\nTried to be zen master, turned out I'm bad at it\nStill took a stab at it so it's not bad actually\nI can't be mad actually, I'm in control of my destiny\nGuess it's time I start to act like it\nMy flow on mad science, I am a mad man\n'Bout to go Jon Hamm, y'all just don't understand\nDeep in the rabbit hole, Alice in Wonderland\nNobody fucks with your shit like the Tumblr app\nYou in the back of the race, we in front of that\nNo need to front all that, bro what you want with that?\nJust get the money bags, bring every one of those back\n\n"}, {"title": "Quentin Miller Freestyles on Flex | Freestyle #102", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, ay\nNow that I'm awake\nI realize there’s more fear inside you than hate\nThat's okay, I forgive you for your mistakes\nTake no days off, and take off, that's the only way\nOkay, holy matrimony to this money, man\nSometimes I start to wonder if she love me back\nMy whole life, I been rolling with the punches\nJabs, hooks, haymakers, me and pain are good friends, my friend\nI mean, I don’t even feel the need to pretend, my friend\nI'm at Legoland with my kids my friend\nThey like, \"where you been, where you been QM?\"\nCan you please come back with the hits again?\nName rings where I'm from to the six, my friend\nWhy people know Calabasas exist, my friend\nI'm saying, give me mine now\nThey see it in me, it's just a matter of time now\n'Fore they find out, ay\nDiamond in the rough like Amy Winehouse\nHad to bring the wine out\n'Cause shorty coming through, and you know what I'm ’bout, ay\nShe about it to, I do me in every city\nEvery street, every room, yeah\nEvery once in a moon, real ones make it through\nI was homeschooled, I don’t get in any these rooms\nTalkin' to dudes, no hit records but well respected\nNigga 1-3-1-7\nYeah, flip the script like Spielberg on the set, yep\nI am legend like Will Smith, I even got a German Shepard\nRun the, done ya, on to the next one\nI’m on to some shit, huh\nStill gettin' paid to perform on one leg\nI be doin' what I said I'm doin’\nRent a car, skating through L.A\nSpending money on my way to money, ain't it funny?\nPlant seeds and watch trees grow\n2018, Kids See Ghost\nHumanoid, C-3PO\nBall like CP3 on them folks\nHuh, yeah\n\n"}, {"title": "Redefined Beauty", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, redefine the definition of beauty\nShine your light for yourself and others that couldn’t do it\nAnd those with like minds, they speak through you\nCame from tough times that really grew me or made me grow where'd my grammar go?\nAll my shit Grammy level even if I never win a Grammy for it\nI am a force that you can’t ignore\nI am the proof that the world is yours\nLife goes on, might as well keep it going\nStayed in my lane till I reached a zone\nSome people complain but to each his own, I'm gone, we gone\nRedefine the definition of beauty…\nLeave a piece of my DNA in the music\nMy hearts in it truly, truly\n\n"}, {"title": "Reign", "year": 0, "album": "", "writers": ["ant clemons", "quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Fuck with her because she know the difference (Goat talk)\nQ.M and Ant, we two of the realest\nIf you in the building, we [?]"}, {"title": "Rental Cars", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "I know, I know, they can't stand me\nEverything I do, outstanding\nThey don't know, they don't know, they just can't see\nThey ain't woke they ain't woke, but they can be\nGo hard in the paint Marcus Camby\nBring more of the day, Joell Embiid\nRental car in LA, going top speed\nAin't no shame, ain't no shame, ain't no shame, ain't no shame\nAin't no shame in my game\nI still switch lanes the same\nI really get paid the same\nI really get paid\nI know, I know, they can't stand me\nEverything I do, outstanding\nThey don't know, they don't know, they just can't see\nThey ain't woke they ain't woke, but they can be\nGo hard in the paint Marcus Camby\nBring more of the day, Joell Embiid\nRental car in LA, going top speed\nRental car in LA, going top speed\nLet them hate, let them hate, you know I'll always be\nLet them hate, throw shade, you know I'll always be\nA lot of niggas entertain but they not me\n1317, we the top seed\n\nAll they want, all they want, is to stop me\nFollowers, followers, you know my heart bleeds for you\nReal ones, real ones, you know the game needs you\nHelped out, worked out, when I didn't need to\nCame up, stepped out, I'm still doing me dude\nCut from a different cloth, we are different breeds dude\nI know, I know, they can't stand me\nEverything I do, outstanding\nThey don't know, they don't know, they just can't see\nThey ain't woke they ain't woke, but they can be\nGo hard in the paint Marcus Camby\nBring more of the day, Joell Embiid\nRental car in LA, going top speed\nAin't no shame, ain't no shame, no\n\n"}, {"title": "Resident Evil", "year": 0, "album": "", "writers": ["quentin-miller"], "artist": "quentin-miller", "lyrics": "We fell in love, I'm cool with her\nShe got a crib, so I move with her\nEverything was going so smooth with us\nUntil she started acting brand new, Miller\nWhy don't you ever wanna go do nothing?\nFunny, she don't have these problems when she going through something\nWhy don't you cook for me?\nWhy after sex it seems like you don't look at me?\nIn this book I'm reading it says, niggas just want shit to put they dick in\nYou know that ain't what I'm all about but\nShit yeah, I'm into getting intimate with the woman I'm living with\nWhen did asking for sex end up being offensive?\nCan you tell me what I'm missing?\nUh, cause I thought it was love here\nLately instead of living it's like I'm stuck here\nUh, somebody let me know, when did my home become resident evil?\nGirl, I ain't ever been so miserable in my whole life\nUh, and I don't want to leave but I need to\nGirl when you become so evil?\nAnd we both know where its gone\nAnd it's been so wrong, this just can't be right\nYeah, please, somebody let me know\nWhen did my home become resident evil?\nShe never cooks, she never cleans\nShe never gives head, it's every thing from my worst nightmare coming true\nUhm, I may just have to cut her loose\nAw, my momma said we shouldn't live together anyway\nI don't know why i never listen cause maybe if I did this would all be different\nIt would still be the same as the beginning but\nNow I'm stuck with Miss fuck this\nI'm going to bed, I'm too young for this\nI should be living out my wildest dreams\nThis ain't exactly what I wanted and I know I ain't perfect but I swear that I'd try\nI make sure that she never finds out when I lie\nI remember when she used to be on my side\nBut now it's more fun outside of resident evil\nGirl, I ain't ever been so miserable in my whole life\nUh, and I don't want to leave but I need to\nGirl when you become so evil?\nAnd we both know where its gone\nAnd it's been so wrong, this just can't be right\nYeah, please, somebody let me know\nWhen did my home become resident evil?\n\n"}, {"title": "Rite Aid", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Ya\nYa Ya\nIndependent studies on the way\nTen Ten fuck with me\n"}, {"title": "Road Less Traveled...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yo, ayy\nYeah\nRoad less travel, I traveled, I had to\nPosted on the block like a lamp or a statue\nLeft being broke and I'm not going back to it\nNick sent a pack so I got some shit to rap to\n1-3-1-7 in this bitch, yeah we back to it\nWdng, Mac and me, yeah I'm half of it\nRoad less travel, I traveled, I had to\nRoad less travel... okay\nShouts out to my fake friends with agendas\nShouts out to my enemies, I got big ones\nShout out to my team, we gon' ride 'til we win some\nI should've been a Srem how I'm fuckin' with your eardrums\nFace blunts, face death and my fears once\nFake news, fake dudes, I'm a real one (hehe)\nFuck waiting for a deal, I'ma sign to myself\nI'ma get it how I live, huh\nEvery beat I'm getting on getting killed, huh\nPut me front of judge and a jury of my peers for it\nHella years in and I'm still going\nIt's some millions at the end, and I'm here for it\nRoad less travel, I traveled, I had to\nPosted on the block like a lamp or a statue\nLeft being broke and I'm not going back to it\nNick sent a pack so I got some shit to rap to\n1-3-1-7 in this bitch, yeah we back to it\nWdng, Mac and me, yeah I'm half of it\nRoad less travel, I traveled, I had to\nRoad less travel... yeah\nNick Miles... Q.M, 10/10\n1-3-1-7\n\n"}, {"title": "R.O.E.", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Real lit boys\nReal lit boys for life\nThey say money the root of evil\nI'm in love with the root of evil\nIt put glass in my ceilin'\nLeather on my seats, my daughter got new sneakers\nThey say money the root of evil\nI'm in love with the root of evil\nThe more that I get makes it harder to trust in the people\nThe root of evil\nShe threw it at me like Brady throws passes in New England\nI got all this green on me like it's St. Patrick's Day\nAnd they say money's the root of evil\nShit, all I seen money do is keep the lights on\nNow I say bein' broke is the root of evil\nYou ain't got no smoke cause you bum off people, broke nigga\nNike hat like Mackleroy, good approach nigga\nFrom GA like Pastor Troy, hold up wait, wait one second\nWait, hold on, wait, wait, wait\nHey Thanks A Lot 3, winner 2015\nWinter, like it's always been\nNo offense to like the new listeners but it's always wintertime\nHey Thanks A Lot 3\nWe'll be here when it's cold outside\nFuck summer, WDNG\n\n"}, {"title": "Senseless.", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yo\nAyy\n30-20\nYeah\nShit don't even make sense\nAll I had to do was have patience\nI sit back and listen, I'm like, \"Wow\"\nThey more like my kids than my own child\nI do what it takes to make it pile\nThe way I'm moving flagrant, that's a foul\nBeen this lit since Webbie, \"Wipe Me Down\"\nYou niggas just starting to catch it now\nAyy, y'all been known the truth for a while\nIt's whatever now (Okay), Stüssy sweater now\nIt's 1-3-1-7- now (Okay)\nI'm Q.M., don't ever disrespect the lettuce, child\nLit, yuh\nIt's an event when we enter your function\nMoney and success on my line, it's a conference\nI don't need no fake people in my circumference\nTwo-face niggas make me sick to my stomach\nRidin' through the city like a motherfucking president\nStarted serving bars, I ain't worked a job ever since\nAlmost missed my flight, had to hit it one more time, though\nTrap in good condition, junkies blowing up my line (Okay)\nI can't get too comfortable, they'll stab you from behind, ayy\nThey hate more than what you got, they hate what's on your mind\nI cannot explain it, I just do not have the time\nFunny how we say it's up when it be going down\nShit don't even make sense\nAll I had to do was have patience\nI sit back and listen, I'm like, \"Wow\"\nThey more like my kids than my own child\nI do what it takes to make it pile\nThe way I'm moving flagrant, that's a foul\nBeen this lit since Webbie, \"Wipe Me Down\"\nYou niggas just starting to catch it now\n\n"}, {"title": "Show Me", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Woah\nWoah, woah, yeah\nHaha, woah\nYeah\nGot up in the game, and I did it my way\nI remember days when I couldn't buy jeans\nWe don't gotta stay, we can hit it at your place\nYou fucking with my wave now, oh, you don't say?\nWhere's my competition? You gon' have to show me\nEverytime I listen they sound like the old me\nI don't see no love that these niggas show me\nIf you say it's love, you gon' have to show me\nYeah, yeah, you gon' have to show me\nYeah, yeah, you gon' have to show me\n(Haha, having fun)\nYeah\nYeah\nWoah\nRidin' through L.A. I feel like a popstar\nYeah\nContra in my glove, looking out for cop cars\nYeah\nI've been breaking bread, and I also break hearts\nYeah, yeah\nLook at all the shit I did, you can't take away from me\nYou can't take it from me, nah\nCaught up in the game, and I did it my way\nI remember days when I couldn't buy jeans\nWe don't gotta stay, we can hit it at your place\nYou fucking with my wave now, oh, you don't say?\nWhere's my competition? You gon' have to show me\nEverytime I listen they sound like the old me\nI don't see no love that you niggas show me\nIf you say it's love you gon' have to show me\nYeah, you gon' have to show me\nYeah, yeah, you gon' have to show me\nYeah, you gon' have to-\nYeah\n\n"}, {"title": "Sicko (Re-imagined)...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah\nHS87 shit, 1-3-1-7 shit, yeah\nWhoa, whoa, whoa, whoa\nYeah, 1-3-1-7, yeah\nI won't hold you up, hold you up anymore\nI won't sell you up, sell you up anymore\nI don't give a fuck, give a fuck anymore\nI don't get the concept of love anymore (Yeah)\nI hold how I feel and it won't let it show\nBoth fans on a will and I won't let it go\nTime heals all wounds but the scars still show\nTime heals all wounds but the scars still sh- (Yeah, ayy)\nSun is down, ayy, freezin' cold, ayy\nThat's how you already know, ayy, winter's here, ayy\nMy dawg would probably do it for a Louis belt (Ooh)\nAnd I'll remix the song and do the beat myself\nHere, let me show you (Ooh)\nYou dig? (Ooh)\nGet used to it, you better get used to it\nYou better get used to it, wanna talk about hard times?\nYoung nigga done been through it\nOh yes, I been through it, got way too used to it\nToo used to it, you better get used to it\nLet you get used to it, til' you got way too used to it\nYou know you love me still, don't you say that you used to\nDon't say you used to (Ayy), don't say you used to (Ayy, yeah)\nWhen you lyin' to yourself I don't gotta lie to you\nI been flyin' by myself, ain't no pilot, ain't no crew\nI been quiet 'bout some things, if I spoke, I tell the truth\nThey don't wanna hear the truth, they don't wanna know the truth\nMinor setbacks, ayy, major comebacks, ayy\nBeen through all that, ayy, been to hell and back, ayy\nLove is all we got, ayy, they didn't tell us that\n\n"}, {"title": "Skateboard P Free....", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah, whoa\nI'ma stop playing with ya man\nHm-hm, I'ma stop playing\nStain on me, ain't no stain on me\nTherapy, pop one help me sleep\nYeah, hit the beat like Derek Jeter\nBig Quentin Miller when you greet him\nI took risk, I took real risk\nRented whips, money spent\nYeah, money came and went\nWhen it went it came again, cause I'm lit, yeah\nI came up on nothin' like I'm thug or somethin'\nMy name out here buzzin like a bumble (wait)\nIt's so tuff to be this good and stay this humble (wait)\nTop ten, top five, top three\nStanding right in front you (wait)\nIts gon' be my year every year\nHow'd I make it here, shit is weird\nStood up to my fears, face my fears\nNow I'm multi-million ears in my peers\nYoung man way too fast (whoa)\nTurned up way too fast (whoa)\nGlo'd up way too fast (whoa)\nSorry I cannot go back (broke)\nWait, let me just repeat my last quote\nSorry I cannot go back (broke)\nNo, no, no\nText to my ex, I regret\nOh you hate my guts? how could I forget...\nTake a second to reflect, on to the next yeah\nI'm not easily upset\nAccidentally cheated death on a test (whoa)\nMight've lost a step, can't even flex (no)\nTo get it back cost a very large check (whoa)\nYeah, pulled some strings like Geppetto then\nYeah, play my role like De Niro dem\nYeah, shawty must've went to Harvard Law\nShe got brains, she intelligent\nK.Y run me back, K.Y run me back\nOn the track, Swisha on the track (hey Swisha)\nQuentin Miller on the track, Miller on the track\nGot your favorite artist plaques, I'm just stating facts\nI can't take that back, no disrespect\nAin't no ill intent, but I really did, what I said I did\nYeah I really did, yeah I really did\n\n"}, {"title": "S.O.S.", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Know you gotta turn that goddamn Nick Miles beat down to goddamn negative 4 at least\nGood as music gets, hey!\nWait, hold up, wait, I need space, I need K\nCame in this bitch, it was not by mistake\nYou gotta put what you got on display\nYou gotta show me what you got, you want this K?\nBack in this bitch, real shit, I never left\nBad energy, you can keep to yourself\nI'm who I call when I need me some help\n1317, we don't need no one else\nWait, hold up, wait, I need space, I need K\nCame in this bitch, it was not by mistake\nYou gotta put what you got on display\nYou gotta show me what you got, you want this K?\nBack in this bitch, real shit, I never left\nBad energy, you can keep to yourself\nI'm who I call when I need me some help\n1317, we don't need no one else\nThey can tell, yeah they peep, they know well\nNike checks, wear 'em well, treat it like YSL, hold up\nNothing changed, big bills, keep the change\nWhat a lick, what a stain, ATL, chicano mane\nWait, hold up, wait, I need space, I need K\nCame in this bitch, it was not by mistake\nYou gotta put what you got on display\nYou gotta show me what you got, you want this K?\nBack in this bitch, real shit, I never left\nBad energy, you can keep to yourself\nI'm who I call when I need me some help\n1317, we don't need no one else\n\n"}, {"title": "Still Here", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, ye-yeah\nYeah, yeah\nFuck you niggas think\nFuck you niggas think\nIt's 2017\nI made this album in a week, man\nMan, ayy\nAnd you ain't never met nobody like me in your life\nI got so much sauce it's hard to keep that shit inside\nGotta keep it moving, running lights living this life\nYeah, had ideas and made them real\nYeah, gave y'all real and made y'all feel\nDon't know how I got here but I'm still here\nStill here yeah\nHey, hey\nWe straight, ayy\nOne-three-one-seven we straight, ayy\nWe straight, ayy\nOne-three-one-seven we straight, ayy\nSorry I'm late, I had to switch up my sneaks\nYeah, and now\nMy cup runneth over baby, my cup runneth over\nHundreds runnin' over, I got hoes coming over\nMy cup runneth over, my cup runneth over yeah (yuh)\nAnd I pray that my range stay\nI pray that my range stay\nI pray that my range stay around till it's over\nMy cup runneth over, my cup runneth over yeah\nI'm just tryna keep my word yeah\nI'm just tryna keep my word yeah\nI'm just tryna be a good person (ayy)\nThings wasn't always perfect\nI just had to keep on working\nNow the money coming in urgent\nNow its no limit like Percy\nMe and my niggas we family\nRunning through checks like stampedes\nWait till I get my Grammy\nWait till I get my Grammy\nSuper size rack my home tho\nSuper size rack my family\nSuper size rack goddamn\nSuper size rack goddamn\nHe-he, goddamn!\nAnd you ain't never met nobody like me in your life\nI got so much sauce it's hard to keep that shit inside\nGotta keep it moving, running lights living this life\nYeah, had ideas and made them real\nYeah, gave y'all real and made y'all feel\nDon't know how I got here but I'm still here\nStill here yeah\n\n"}, {"title": "Stuck Up.", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, ayy, okay\nYou think you’re prepared? You’re not prepared\nThem dudes over there do not compare\nStuck to the code that got me here\nIt's up, it's stuck, it's locked up there\nI just had got back to the city, I'm good\nShe tryna link up and I think that we should\nDon't nobody else do this shit how I do it\nThere's money to make and I'm tryna get to it\nA legend already, I don't gotta prove it\nI want the new Bentley, I don't want the Buick\nI jump on the beat and get very abusive\nBall on these niggas like Gary, no Busey\nMost of these rappers is not who they say they is\nI just do not know why y'all even play they shit\nSoon as y'all get information you say the shit\nAll of my secrets? I go to the grave with it\nMake your own bed then after you lay in it\nMoney it come and go, people that came and went\nYou gave the game away, didn't even pay for it\nThat be the lamest shit, ain't that the lamest shit?\nI could care less 'bout no clout or no fame and shit\nI'ma get money and keep entertaining shit\nBitches you fuckin’, the niggas you hangin' with\nThem be the best indicators of who you is\nI am not new to this, truly I'm true to this\nI spray at anyone, I don't care who you is\nSwear I'm the realest that's currently doing this\nWho else you know that influence influencers?\nYeah, ayy, okay\nYou think you’re prepared? You’re not prepared\nThem dudes over there do not compare\nI stuck to the code that got me here\nIt's up, it's stuck, it's locked up there\nSo many things that dropped this year\nI'm finna fuck up the block this year\nIt really ain't much I got to fear\nThey had me before but not this year\nI'm on a whole different vibe\nThere's no way of blowing my high so don't even try\nMost of these niggas be lying\nDon't even be going outside, so really it's quiet\nYeah, I said it, I meant it and I'm sticking by it\nYou said there's money to get at\nI'm asking you why do you preach to the choir?\nHit the hotel and checked into the president suite\nNow I need a Melania\nMy flow on water like Anya\nFrozen like Anna, niggas ain't hot enough\nSheesh, might even put on a fleece\nI don’t clock in to a job, I just be managing beats\nAll I can do is go hard, I don't know how to go weak\nYoung nigga paid the cost to turn to a boss\nI got the receipts\nYeah, ayy, okay\nYou think you’re prepared? You’re not prepared\nThem dudes over there do not compare\nStuck to the code that got me here\nIt's up, it's stuck, it's locked up there\nI just had got back to the city, I'm good\nShe tryna link up and I think that we should\nDon't nobody else do this shit how I do it\nThere's money to make and I'm tryna get to it\nA legend already, I don't gotta prove it\nI want the new Bentley, I don't want the Buick\nI jump on the beat and get very abusive\nBall on these niggas like Gary, no Busey\n\n"}, {"title": "Surreal", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah whoa\nIt's Falco man\nYeah, yeah whoaaa\nYeah, ayy\nReally don't make no sense\nReally don't make no sense\nShit don't even make no sense\nShit don't even make no sense\nHow did I get this lit?\nHow did shit get like this?\nI just might switch my bitch\nAyy, next style I might switch back\nMight just feel like that\nBetter go, get it right back\nLet it go, get it right back\nBlow it then get it right back\nBlow it up get it right back\nYou know what the fuck going on\nYou know how the fuck we gone come\nDon't stop till we get that money long\nRap music paying my bills\nGot me in Beverly Hills\nI'm having various pills\nYou should come Netflix and chill\nI'm really a legend forreal, forreal, forreal\nMight get rich then switch (Whoa)\nHit the mall, Nike my bitch (Whoa)\nThen we gone pipe this bitch like (Whoa)\nThen we gone pipe this bitch up (Whoa)\nReally don't make no sense\nReally don't make no sense\nShit don't even make no sense\nShit don't even make no sense\nHow did I get this lit?\nHow did shit get like this?\nI just might switch my bitch\nAyy, next style I might switch back\nMight just feel like that\nBetter go, get it right back\nLet it go, get it right back\nBlow it then get it right back\nBlow it up get it right back\nHold up, hold up, hey!\nThey ain't want me to fly but it's too late\nYeah, million, million Falco outer space\nContraband all up in my suitcase\nYeah, it's okay they gone hate\nIf they didn't I would feel a way\nLet 'em say what they gone say\nPeople gone talk that's fine, yeah\nGo ahead, speak your mind, yeah\nI'ma just keep on mine, yeah\nI'ma stay on my grind, yeah\nI'ma stay on my grind, yeah\nReally don't make no sense\nReally don't make no sense\nShit don't even make no sense\nShit don't even make no sense\nHow did I get this lit?\nHow did shit get like this?\nI just might switch my bitch\nAyy, next style I might switch back\nMight just feel like that\nBetter go, get it right back\nLet it go, get it right back\nBlow it then get it right back\nBlow it up get it right back\nYou know what the fuck going on\nYou know how the fuck we gone come\nDon't stop till we get that money long\n\n"}, {"title": "Taste... (freestyle)", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "I’m so unbothered\nY’all gon’ follow even if y’all hit unfollow\nFuck fight, if you want problem\nI’ll call strike like the umpire, hm-hm, okay\nNo squad realer than me and mines\nNiggas might as well be reading lines\nMight be in the suite like Zack and Cody\nCountin’ racks till I’m ballin’ like Shaq and...New school or old school, its enough smoke for both groups\n29 in October and I’m feeling great\nLike I’m finna turn 28...\nWe do not discriminate\nIf you hate, we disintegrate\nWolverine with the K, it regenerates\nWhip cream on the cake, you can get a...\nYou can get a taste\nJust so easy, I mean I could even...\nI don’t even gotta...\nI don’t need to...\nI ain’t finna...\nEven finish my sentences, and my shit still killing you niggas\nShit, lately I been tryna handle my business\nGet a handle on this shit before it’s too much to handle...\nI ain’t never gave two fucks or damns, now I kinda do\nViolent crimes I got daughters too... hold up\n(That’s gonna go over y’all, let me get it back)\nLike I’m playing cards with the house money\nHowever you want to play it’s a W either way\nI’ma do what I wanna do either way\nThree words I live by, make ‘em pay\nThree words I live by, make ‘em wait\nThree words for this night, get a taste\nYou can get a t...\nYou can get a t...\nYou can get a... (aight)\n\n"}, {"title": "Thanks.. From Toronto..", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, UTDinfiniti, Nike checks and fini's\nWe hit department store and start a frenzy\nMy team came in with me, 1317 infinity\nThat means that shit is never ending\nUTDinfiniti, Nike checks and fini's\nWe hit up Edgewood and start a frenzy, yeah\nOoh they tried to play me like Mario\nI should've dropped that HTA a long time ago\nI been grinding while you rap 'bout grinding\nCuz I move behind the scenes don't mean i'm behind you\nI been gone from the city tryna chase a million\nI might just hit your girl mentions if you need a reminder\nBackseat bumping WDNG in Toronto\nNew sneaks, I had to cop cuz I know you ain't got those\nQuentin Miller been hot since action figures and snot nose\nActions speaks, not words, catastrophe from my verbs, man\nPlease believe it gets worse my friend\nWhen she with me she gon come out that purse my friend\nPlease believe it gets worse my friend\nYou can get served my friend\nBut you know i'm gon charge for the verse my friend\nMoon roof, no, my car's not a vert my friend\nGot your bitch singing like Gerald Levert my friend\nYou falling down like Donnie McClurkin, damn\nRiding through somebody town and i'm lurking, damn\nText from somebody girl and I curved her, damn\nJack Daniela is Jamie Lee Curtis, damn\nYou don't really wanna pull back the curtains\nI'm up working with work on a Wednesday\nYoung Quentin Miller, no fuck 'bout what them say\nWho is \"them\"? Them the haters\nWho is \"them\"? Them them fake niggas\nLupe Fiasco, I skate on niggas\n'97, I ain't even got the plate on it yet\nHTA, I made em wait on it, yup!\n\n"}, {"title": "The Light", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yooo, hold up (whoa)\nShould already know, ya should've been known\nLets talk about this lifestyle I been on\n'Cause there's a chance I won't live long\nJust promise me you'll look out for my kids holmes\nJust look out for my kids\nTell 'em 'bout the good shit I did, tell 'em\nAlways shine your light bright, never dim\nTell 'em get out here and live\nMade it happen, we ain't have much\nNow it's time to run the bag up\nOh I'm ready for the game now\n'Cause I never miss a practice (whoa)\nWhoaaa, I feel the light in me\nIt glows, it glows\nI feel the tide coming, I'm standin' on the shore\nYeah, I could feel that, I could, aight, yeah\nOne time for my real dudes out here gettin' it\nOne time for my bad bitches out here gettin' it\nOne time for that brand new Quentin Miller shit\nHype, hype for that brand new Quentin Miller shit\nAnd we want them rings like Belichick\nAnd we want them rings like Phil and 'em\nCould care less if y'all feelin' him\nYeah, I'm in love with that ATM\nMaking love to the ATM\nShe link me up with my favorite friends\nThe friends that keep the lights on\nThe friends that get my daughter brand new Nikes\nThe friends that gets the shit I like, when I like\nHelp me really live this life man, damn\nYeah, you say you love me, do you really mean it?\nCan I trust you, tell you all my secrets?\nTell you 'bout my biggest demons\nConflicts all I ever knew\nTryna choose the right thing to do\nAnd still generate some revenue\n'Cause above everything, cash rules (yeah)\nCash rules everything around me\nYou ain't get the money, dolla-dolla bills y'all\nYeah, dolla-dolla bills y'all\nI don't know what the fuck I'm talkin' about\nIt's a freestyle, mhm\nI admit I could've did better\nI admit I could've done better\nI admit I could've tried harder\nI already know what I lost (yeah)\nI already know how I lost you\nI already know how I lost you\n\n"}, {"title": "The Source...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah... lit in the city like downtown\nBeen kickin' shit like a roundhouse\nHit when you see me in the restaurant\nDouble on my cup from the waitress(Huhu) and then you slept yourself to death...\nIt's a line I originated, no comment (haha)\n\n"}, {"title": "Thought It Was Over...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, just when you thought it was over\nWhen you thought it was over, look\nI tap into the highest frequencies at my lowest\nBack at it, I'm more wise, I'm more focused\nCan't think of a single artist I can't go with\nToe-to-toe with, look\nEverybody got two cents to pitch in\nAt this point I'm worth what, half a million?\nA discount for the verse like two-fifty\nCount it up if I miss count, start from the beginning\nOne of one like bands done\nTwo words to describe me, it's \"stand up\"\nBut I ain't no comedian, no jokes\nAll smoke for whoever want smoke\nI done been through much worse\nLearned to live with pain, roommates with the hurt\nTried to done me off, too late, didn't work\nHustle hard from the first to the first till they place me in first\nAnd you know how I come with the H.B. beats\nBrought it to Atlanta like it's A3C\nNo KC, everyday we cheat\nBlow it all, get it back, then repeat\nHe said he don't fuck with Quentin Miller, he sleep\nIf he flock behind someone else, he sheep\nDisses on the sneak, trust, we peep\nThey don't wanna see us eat, so we feast\nMoney's something that I generate monthly\nWeekly, daily, hourly, minutely, secondly\nHahaha, haha, not second though\nAnd you thought it was over\n\n"}, {"title": "Unexplained Freestyle", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Robotic leg off of Time Square\nHawk, T-T-Tony Hawk how I grind, yeah\n\nIt's so funny when I'm out here tryna explain\nFlex like that nigga Triple-H did\nStunt like I'm playing in the X-Games\nFuck tryna explain\nThese niggas just wanna hate me anyway\nOh they would just love it if I went away\nSorry to disappoint, but I'm here to stay\n\nMan I'm out here tryna explain\nI mean you wanna go the lyrical way?\nOr me to [?] you up?\nYou want some deep talk?\n\nMan I'm out here tryna explain\nFlex like that nigga Triple-H man\nStunt like I'm playing in the X-Games\n\nMan, who the fuck you think [?] man?\nI'm already seeing y'all stress man"}, {"title": "UnHOLY...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "I haven't heard your name in a minute now\nYou been considered lame for a minute now\nYou haven't had a hit in a minute now\nTryin to reel it in, know you fishin now\nAll this shit that you been poppin off\nNull and void\nQuit my job and made more money unemployed\nYou can throw them shots at me\nLets start a war\nWhen it comes to jabbin\nIm as good as Floyd\nI was never Gang Gang\nI was 1317 the whole time\nIn your city, Tech fleece, Track and field, the whole nine\nI've been making progress, my nigga I ain't lying\nWhen you cannot stop this\nCan't even slow it down\nIm really off yall\nMelrose straight to Nike Golf\nAww hell, I just went off\nAww, there should be a couple pallbearers just to take this beat\nAnd bury it\nHit your bitch, she hit the notes that Mariah Carey hits\nLast time I checked I was a ghostwriter, that's some scary shit\nHop up on the scene, feeling like a fresh black casper\nPut my daughter feet up in some new air maxes\nDamn, Uncle Sam want a verse I got to tax em\nPush my '97 like a brand new Jaguar\nWax on! No mister miyagi, Roll, rollin like Kelly\nFuck around with my family\nI got buns of belly, man..\nIts been a minute now\nIts been a little minute now\nNiggas thought I would be finished now\nDamnnnn.. you still in this now?\n"}, {"title": "Unreleased freestyle", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, ayy\nAyy, yeah\nWho the fuck is this though? Talking 'bout some work\nNeed to call me on my flip phone\nMy iPhone personal, that's not what I do biz on\nI'm in a different head space\nI see things clear when I get paid, it's like I meditate\nMama always said it'd be bad days and it'd be better days\nHow can it get better though? I'm literally killing everything\nI hit my connect and sometimes he don't hit me back\nWhen I find a new plug I guarantee that's just to rap\nDon't forget to ask, that energy is right where you left it at\nOh they want me dead and gone? I'm just not accepting that\nNo sir, I got my own plans that involve bands and me gettin' that\nMaking something out of nothing, turns out I'm the best at that\nI got a new thesis, Tear da Club Up, Three 6\nMake it fly like G6, tryna find a million like Kanye found Jesus\nBe thankful, it's not too much I can't do, yeah\n\n"}, {"title": "Untitled...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, Ooh\nI’m back on my shit\nI linked back up with Nick\nI came in with my Nike hat\nShe took my Nike hat\nPut on my Nike hat\nProceed to ride me like, yeah\nRan it up by myself\nDon’t get beside yourself (yeah)\nStroking that b-, like I’m Michael Phelps\nCome with that check if y’all some help\nNiggas wouldn’t answer the phone before\nNow they ask me to reach out\nHoes wouldn’t answer the phone before\nAnd they all want to speak now (yeah)\nShe pulled up at 1 A.M.? She must want a beat down (yeah)\nYou asked Nick for the Venmo account?\nOh, you must want a beat now\n1-3-1-7 I practice forgiveness, but I cannot let it go\nCome to your city and turn that bitch up\nLike Scarface on banana boat\nI be in places you cannot go\nDoing things that you cannot do\n\n"}, {"title": "Version 20.3 Freestyle....", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Ye-yeah, yeah, yeah\nYou could tell by like the-\nSh-shit I pick out like, I'm like-\nI'm not like one of these-\nPunk rappers like I'm a- (holla back!)\nYeah!\nCaught up in the mix like\nA song and a set created by Funk Flex\nYoung Quentin Miller I give you my address\nThe very top of the rap game blacklist\nFound myself between a snare and kick\nDeep in that bitch like LaFlare in the six ooh\nNo M.A, I go in for days\nFuck war, crooked cops and minimum wage\nHad to change my living, it was necessary\nHad to learn to love myself and not to stress on others\nEvery blessing that I get I split it with my brothers\nTo care less about money long and just comin' in\nAnd I can hear what they mumbling\nEverything they sayin' I'ma let it settle in\nA couple albums in, couple power plays later\nThey'll notice he wasn't playing\nHe did everything he said that he would\nThat shits amazing\nLike Jeezy and Ye from 808\nI was whippin' LA with Georgia plates\nNot only bet on myself but raise the stakes\nKilled the game, confess, close case\nFat boy, chest out like Usher Ray\nGunmetal base, cologne by Dolce\nNever ran, never chased\nJust left Chase, make sure that the bags safe\nI really was, yeah I really was\nReally real, really said what I really does\nUpdated my flow had to fix the bugs, QM.V.20.3\nProsthetic cost heavy\nWhat I'm doing to these beats\nPut me right back on my feet, so to speak\nStraight up out the mufuckin' peach\nI think I'm Ted Turner, what you think?\nI'm into this bread like yeast\nMy daughter's gotta eat, might aswell feast\nGot it on your chest, might aswell speak\nOr keep it to yourself cause it don't effect me\nMan, I been in my mind like Pharrell damn\nI don't even mind what you tell them\nI'm not even trying and I'm better than 'em\nSomeone get the lion, call the reverend\nThis shit make a nigga want hustle tho\nBreak the knob, break the knob, goin' up on folks\nCame in, entertain like Russell Crowe\nIts really not a thing, its really nothin'\nWe gon' show you how to hustle\nHe-he, yeah, aye\nWe gon' show you h- (yeah)\n\n"}, {"title": "Warp Speed", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Fucking chair\nYeah\nAll is fair in love and War\nEven lies even lies\nKarma knocking at the door\nLet me in as she cries\nLet me know if its my time\nI'm not running from the light\nLet me know what fate decides\nNo I'm not afraid to die\nCoz no one ever really dies\nHero with the rhymes\nHans Zimmer with the beats\nUsed to wanna be a star\nThat shit might not be for me\nStill my family gotta eat\nI find the only way to feed em\nPutting lyrics to the beats\nI could tell I was unique\nThat's why mamma kept me home\nEven when I'm left alone\nMy light be glowing steady glowing\nOMG fell deep\nLost a leg landed right back on my feet\nSo to speak\nFurthest from my peak\nQ I'm outta space\nFalco minus beat\nI just give everything in me\nI just can't sit around the crib\nI gotta get out here and get it\nYou should've seen how I was living\nBack when I was sleeping in the kitchen\nI was having meetings with execs\nNeither one of us could see it in me\nFast forward after hours dropped\nJust another dreamer in the city\nMessed with young niggas turning up\nKing curtis williams showed us there's a lane for the gifted\nStill wasn't getting back stage\nCouldn't turn up too late\nHad to be at work the next day\nBut it worked out okay\nMamma stayed up in church no telling how much she prayed\nMight be what saved me\nI couldn't say\nWish I had a helping hand in designing these plays\nLife is a beach, and I'm just riding these waves\nTill I decided light shining take my life by the reigns\nNow instead of just riding these waves I'm providing these waves\nReach the top of my game, get on top and remain(x2)\nFuck peace now we want war now\nI'll take you all down\nHad to run it a lum before something like cotoure now\nProducers wouldn't give me beats of course now\nGuess I'll make my own now\nGot my own agenda and I don't intent to let you niggas slow it down\nNo, I can't take the pay cut\nYeah I helped create the wave\nNow look the whole rap game waved up\nI guess I'm partially to blame but\nI saw the change coming back in 2014\nI knew what the game was gon be\n6th Sense Bruce Willis, you can feel it\nTruth is I am not a new kid, new to you but not new to this\nDown to earth not hollywood\nChic-Fil-A over Ruth Chris\nFacts\nYall know what the truth is Facts\n\n"}, {"title": "Windows...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah, we back\nOh yeah, we back for real (haha)\nThere he goes, there go him, there go me\nGot the whole city lit 'cause of me\nThey want sauce, its gon' cost, pay a fee\nPlenty flav's, I'm on deck, what you need?\nToo much cash to pull out the machine\nI get the bag then dip out, flee the scene\nOh you think you standin' out when you fit in?\nI might spend some in Margeila just to blend\nI got the boot, I got the boot, I got the Timbs\nI want the loot, gimme the loot, RIP B.I.G\nIt's nothing to do, it's nothing to do, I'll do it again\nIt's all for my crew, we never gon' lose, we always gon' win\nYuh, you don't gotta put on for me\nLet's keep it all the way real, let's keep it all the way G\nI'ma get to it for real, I want you all to see\nI used to shop at the window (But then)\nYuh, you don't gotta put on for me\nLet's keep it all the way real, let's keep it all the way G\nI'ma get to it for real, I want you all to see\nI used to shop at the window\n\n"}, {"title": "Wwtd Interlude...", "year": 0, "album": "", "writers": ["quentin-miller", "quentin miller"], "artist": "quentin-miller", "lyrics": "Yeah, yeah, I heard this sample, I was like\nWhat would Timbaland do, you know?... (Huhuh) yeah..\nI... yeah... beat the fuck out you niggas when it come to the writtens\nPush a button on you fake niggas running the business, the real is back now, humble your spirit\nOkay... ran off instinct, looks like Bentley's, Jill A. Benz keys?\nName card, face card, that's infinity... never go broke again\nI got hope for sale, never lose hope again...\nFirst I drop that destiny like I'm Beyoncé...\nRestaurants run the bill up like choncee\nGave you all the recipe to the modern way\nNike on me, NEW SLAVE NIGGA NEW SLAVE!\n\n"}]