[{"title": "Q.M. x CHASETHEMONEY unreleased", "year": null, "album": "Unreleased Songs  ", "writers": ["quentin miller"], "artist": "quentin miller", "lyrics": "Just 'cause they wish you well don't mean they mean well\nI can't slip up, pay attention to detail\nProduct zipped up and I send it through email\nI spend so much on apparel and retail\nNow I'm glowed up and I'm wishin' I did more\nI see it clearer than how I seen it before\nMan in the mirror whenever I look there\nI just didn't know exactly what I'm lookin' at\nMaster yourself, take control of your thought pattern\nCut off the friends that are fake and your bad habits\nTried to be zen master, turned out I'm bad at it\nStill took a stab at it so it's not bad actually\nI can't be mad actually, I'm in control of my destiny\nGuess it's time I start to act like it\nMy flow on mad science, I am a mad man\n'Bout to go Jon Hamm, y'all just don't understand\nDeep in the rabbit hole, Alice in Wonderland\nNobody fucks with your shit like the Tumblr app\nYou in the back of the race, we in front of that\nNo need to front all that, bro what you want with that?\nJust get the money bags, bring every one of those back\n\n"}, {"title": "Unreleased freestyle", "year": null, "album": "Unreleased Songs  ", "writers": ["quentin miller"], "artist": "quentin miller", "lyrics": "Yeah, ayy\nAyy, yeah\nWho the fuck is this though? Talking 'bout some work\nNeed to call me on my flip phone\nMy iPhone personal, that's not what I do biz on\nI'm in a different head space\nI see things clear when I get paid, it's like I meditate\nMama always said it'd be bad days and it'd be better days\nHow can it get better though? I'm literally killing everything\nI hit my connect and sometimes he don't hit me back\nWhen I find a new plug I guarantee that's just to rap\nDon't forget to ask, that energy is right where you left it at\nOh they want me dead and gone? I'm just not accepting that\nNo sir, I got my own plans that involve bands and me gettin' that\nMaking something out of nothing, turns out I'm the best at that\nI got a new thesis, Tear da Club Up, Three 6\nMake it fly like G6, tryna find a million like Kanye found Jesus\nBe thankful, it's not too much I can't do, yeah\n\n"}]